[
  {
    "时期": "1929年",
    "原文": "一种新型交通方式的出现，在带动相关产业发展的同时，也可能使原有的某些行业被削弱。在传统的交通方式中，颇为方便地穿梭于北京狭窄街巷的人力车，俗称“东洋车”或“洋车”，由于是清末从日本传入而得名，在南方通常叫做“黄包车”，其数量之多、从业者之众远远超过其他类型。电车公司意识到：\n电车在京城为创举，地方人士囿于故见，一时未能明瞭，而公家设备尚欠完密。故于发轫之始，取渐进稳重主义，使人民耳目相习，感觉电车种种便利，则基础方能确立。\n但是，“开车以来，迭受外界蹂躏，甚至毁车伤人。虽赖地方当局维持，一时得以无事，然无票乘车者仍未绝迹”。这些局部冲突日积月累，在1929年爆发的人力车夫捣毁电车事件中达到顶点。\n北京的人力车夫1923年已有10多万，人力车33000多辆，电车的兴起对他们的影响最为直接和广泛。电车公司创立时，京师总商会等团体已经提出：“此数十万贫民骤然失业，生计所迫，难免铤而走险、扰及治安，又何法以善其后？”不过，北京的电车运营路程毕竟有限，相对狭窄的街道、胡同依然是人力车极感便利而电车不能到达的地方，并未从根本上动摇人力车的地位。但是，1928年国都南迁后，北京从首都下降为行政院直辖的北平特别市，人口减少，市面萧条。人力车夫深感谋生艰难，不免对快速行驶的电车怀恨渐深。1929年10月22日，电车工会与人力车工会的冲突，终于引发了人力车夫捣毁电车事件。电车公司10月23日致电南京国民政府内政部、财政部、工商部称：\n养晚北平总工会发生纠纷，波及电车，突被洋车夫工会乱徒捣毁机车四十三辆、拖车二十辆、道岔十处。就车辆一项之损失，估计约二十余万元。电车工人受重伤者八人。军警当局比即逮捕乱徒五百余人。\n由此导致电车停驶18天，至11月10日恢复通车。电车公司致市政府呈文中认为，此次人力车夫击毁电车，“别有主使及背景，其目的或未必仅在电车。……惟以人力车夫思想之简陋，难保不误认电车定价低廉，有妨人力车夫营业”。新旧产业间的矛盾激化到以暴力形式表现出来，近代化工程技术与传统交通方式之间的冲突，使电车公司元气大伤，北京的城市近代化也遭遇了一次严重挫折。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.192-193",
    "交通工具": "人力车",
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.91
      ]
    ]
  },
  {
    "时期": "19世纪末",
    "原文": "19世纪末，京奉铁路段中由天津通达京师西南卢沟桥的津卢铁路以及卢沟桥至保定的卢保线先后建成。之所以远离京师核心之地，主要为避免火车对紫禁城的“侵扰”。八国联军侵入北京城之后，英军为了运送军队和物资，率先将津卢线展修至皇城正南的正阳门东瓮洞内。不久，卢保线也被延长至正阳门西瓮洞内。1905年，北京至汉口铁路通车，1909年，北京至张家口铁路通车。随着京奉线、京汉线、京张线、津浦线等铁路的先后建成，北京逐渐成为连接东西南北交通的全国铁路交通枢纽。",
    "出处": "张艳丽.北京城市生活史[M].人民出版社,2016.305-306",
    "交通工具": null,
    "交通要道": "京奉铁路",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.22,
        39.85
      ]
    ]
  },
  {
    "时期": "5574",
    "原文": "朱启钤（1872—1964），字桂辛，晚年号蠖公，贵州开阳人。他的岳父陈崧生是曾国藩的次婿，出任过驻英、法、比利时参赞，“留给他不少驻外时的杂记书籍，朱从这些读物中得出西人以制造致富的经验总结”。进入民国后，朱启钤曾任内务总长、交通总长、京都市政督办等职，推动了拆除正阳门瓮城、改建前门箭楼、开辟中央公园（今中山公园）、拆除千步廊为天安门广场等重大工程的实施。1914年5月，朱启钤提出《修改京师前三门城垣工程呈》，总统袁世凯批复：\n据署交通总长朱启钤呈请，展修京都环城铁路，由京张铁路局筹款承修，接通京奉东便门车站，以利交通而兴市政。计划甚是，应即照理。其路线经过地面所有勘用沿城官地，均准划归该部应用。至修改瓮城、疏浚河道及关于土地收用事宜，应由内务部会同步军统领督饬各该管官厅、营汛协力辅助，俾速施工，毋误要政。\n随后，京张铁路局派工程司陈西林屡次勘测线路，从距离、成本等方面衡量，向交通部提出计划：\n经过各门瓮城即仿京奉路穿过崇文门瓮城成案，均取直线一律通过办法，将经过各城门瓮城两边均行开通。仍将前面大箭楼留存，附加点缀，略为修葺，另开马路，较之崇文门现状更为适观，且便行人来往。\n1915年4月5日，交通部呈送《京师环城铁路勘定路线并修改瓮城情形绘图呈请钧鉴文》，向总统呈报此事并获准。随后，京张铁路局完成了填筑路基土方、修改瓮城各工程的招工投标事宜，6月16日开工，到12月24日交通部即已向准备几天后成为洪宪皇帝的袁世凯奏报，拟于1916年1月1日通车，“现由西直门起，经过德胜、安定、东直、朝阳四门，至通州岔道与京奉接轨，可直达正阳门，不特与本路干支各路衔接相通，兼可与中外各路联络一气”。此后，京汉铁路局与京绥铁路局合作，前者负责修建京汉铁路的广安门车站到西便门车站的铁路联络线，由广安门车站北头引出，到西便门车站西头接轨；京绥铁路局修建西便门至西直门之间的北段联络线。两段联络线在1919年8月建成通车，北京环城铁路由此实现了全线贯通。属于环城铁路系统的车站有：京绥西直门车站（西直门外）、德胜门车站（德胜门外）、安定门车站（安定门外）、东直门车站（东直门外）、朝阳门车站（朝阳门外）、东便门车站（东便门外）、通州岔道车站（正阳门东站迤东）、北京水关东站（正阳门车站迤东）、京奉正阳门车站（正阳门迤东）、京奉正阳门车站（正阳门外）、京汉正阳门车站（正阳门迤西）、永定门车站（永定门外）、大红门小车站（南苑大红门）、西便门车站（西便门外）、广安门车站（广安门外），其中几处是环线支路的车站。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.174-175",
    "交通工具": null,
    "交通要道": "现由西直门起，经过德胜、安定、东直、朝阳四门，至通州岔道与京奉接轨，可直达正阳门，不特与本路干支各路衔接相通，兼可与中外各路联络一气”",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "上古时期",
    "原文": "上古时期开辟的太行山东麓大道、由北京出山海关进入东北的大道、从北京向西北出居庸关到内蒙古高原的大道，到清代仍然是北京联系周边地区的陆上交通干线。这些交通干线与此前已有的次一级道路，共同构成了从北京通往周边地区的交通网络。乾隆二十八年五月辛巳（1763年7月5日），直隶总督方观承奏疏中说：\n直属自天兴、宛平，东至通州、三河、蓟州、丰润、玉田、抚宁一路；西至良乡、房山、易州、涿州一路；西南至定兴、安肃、清苑、满城、完县、望都一路；东南至新城、雄县、任邱、高阳、河间、献县、交河、阜城一路；运河大道武清、天津、大城、静海、青县、吴桥一路，共三十二州县。叠道应加夯硪、沟渠应添桥座者，以次修理。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.116",
    "交通工具": null,
    "交通要道": "由北京出山海关进入东北的大道、从北京向西北出居庸关到内蒙古高原的大道，到清代仍然是北京联系周边地区的陆上交通干线。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "东汉",
    "原文": "东汉初，幽州地区最值得一提的水路开发，是王霸利用温水通漕运。建武十三年，王霸“又陈委输可从温水漕，以省陆转输之劳，事皆施行”。《后汉书》注引《水经注》云：“温余水出上谷居庸关东，又东过军都县南，又东过蓟县北。益通以运漕也”。王霸利用了幽州地区的天然河道开发漕运功能，这是见于史籍最早的幽州地区开辟水运的先例。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.37",
    "交通工具": null,
    "交通要道": "王霸利用了幽州地区的天然河道开发漕运功能，这是见于史籍最早的幽州地区开辟水运的先例。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.07,
        40.29
      ]
    ]
  },
  {
    "时期": "东汉",
    "原文": "东汉献帝间，辽东、辽西、右北平三郡乌丸，承天下乱，破幽州，略有汉民合10馀万户。势控幽、并、冀、青诸州的军阀袁绍皆立其酋豪为单于。辽西单于蹋顿尤强，为袁绍所厚重，故袁绍之子袁尚、袁熙兄弟皆投归蹋顿，并数入塞为害。建安十一年（206年）秋，曹操准备率军亲征乌丸，但患军粮难致。于是，“凿渠，自呼沱入泒水，名平虏渠；又从泃河口凿入潞河，名泉州渠，以通海。”这是采纳了谏议大夫董昭的主意，事载《三国志·魏书·董昭传》。\n关于平虏渠，古代学者说多歧异。《元和郡县志》沧州鲁城县下云：“平虏渠在郭内，魏武北伐匈奴（应为乌丸_作者）开之”。唐鲁城县治在今沧州东北约85里，今青县东约60里，乃汉章武县故城所在。《太平寰宇记》沧州清池县下云：“平虏渠在县南二百步。魏建安中于此穿平虏渠以通军漕，北伐匈奴”。宋沧州清池县治在今沧州东南35里。据此，则平虏渠当在今沧州以东。《读史方舆纪要》晋州饶阳县下云：“滹沱河在县北。《通典》：滹沱旧在县南。魏武因饶河故渎决令北注新沟水，所以今在县北。宋白曰，决处即平虏渠也。旧于渠口置虏口镇，后讹为鲁口，因置鲁口城”。据此，则平虏渠当在沧州西之饶阳。但同书在“鲁口城”条下引《晋书》云：“公孙渊叛，司马宣王讨之，凿滹沱入泒水以运粮，因筑此城”。是知司马懿亦曾开渠，但与平虏渠有无关系，尚不清楚。对于古人的上述说法，今史念海先生认为，《元和郡县志》说较为可信。他说：“唐鲁城县在今沧州市东北，青县正东，西距青县不下五六十里。这里正是汉时滹沱水流经的地方。那时的泒水流经今静海县之北。今静海县南距青县以东的鲁城故县并不很远，平虏渠开凿在这里乃是很有可能的。或谓这里所说的平虏渠就是今青县至独流镇间一段南运河的前身”。常征、于德源认为，平虏渠“其故道至今尚存，那就是自青县通达独流镇入泒河（大清河）的一节运河”。谭其骧主编《中国历史地图集》有关图幅中，“平虏渠”三字就标注在今静海与青县间的运河之侧。可见当今学者对平虏渠的所在，观点是较为一致的。\n关于泉州渠，史籍记载较为具体确切。《水经注》云：鲍邱水收纳泃水之后，“又东合泉州渠口故渎，下承滹沱水于泉州县，故以泉州为名。北迳泉州县东，又北迳雍奴县东，西去雍奴故城120里。自滹沱北入，其下历水泽180里，入鲍邱河，谓之泉州口。陈寿《魏志》曰：曹太祖以蹋顿扰边，将征之，从泃口凿渠，迳雍奴、泉州以通河海者也”。按泉州县治在今杨村西南不远的城上村，雍奴县治当在今武清县东境的大空城处，雍奴县故城在今杨村西北的旧县村。泉州渠迳泉州县和雍奴县东，在雍奴故城东120里，准其地望，当在今天津市区以东、武清县东境、宁河县西境、宝坻县东南境。泉州渠历水泽180里，这水泽就是雍奴薮。《水经注》云：“鲍邱水又东，巨梁水（今名还乡河_作者）注之。……自是水之南，南极滹沱，西至泉州、雍奴，东极于海，谓之雍奴薮。其泽野有九十九淀，枝流条分，往往迳通，非为（巨）梁河、鲍邱归海者也”。由于雍奴薮的存在，使泉州渠得以充分利用天然水泊和相互迳通的水道，至有180里的路程无需人工开凿或少数地段加以开凿而已。因此，魏武从泃河口凿入潞河的泉州渠，所指绝非是历雍奴薮水泽180里的一段。\n那么，魏武真正开凿的一段泉州渠在哪里呢？虽然论泉州渠的学者多有，但对这个问题说得具体清楚、合理可信的，尚不多见。实际上，从泃河口凿入潞河的一段泉州渠，应当在今香河县北境。泉州渠与潞河交接之处，应当在今香河县西北北运河由西向东而折向南流之处。理由有五：\n第一，潞河为今通县以南的北运河。《汉书·地理志》渔阳郡渔阳县（治所在今怀柔县东南梨园庄附近_作者）下云：“沽水出塞外，东南至泉州入海。”《水经》云：“沽河从塞外来，南过渔阳狐奴县北，西南与㶟馀水合，为潞河；又东南至雍奴县西为笥沟；又东南至泉州县与清河合，东入海”。《水经》大约成书于东汉末，与魏武开凿泉州渠的时间甚近，所记潞河与今北运河相当。\n第二，泃河口即泃河注入鲍邱河的河口。《水经注》：鲍邱水“又东与泃河合”，而“泃水又南入鲍邱水”。今香河县东北境有地名曰渠口，渠口即泃河口。《读史方舆纪要》引《宝坻县志》云：“县治东北有渠河，自香河县来。盖泃水经香河县而后东入县界，故县有渠阳之称”。魏武所凿泉州渠应从这里向西连通潞河。\n第三，金置宝坻县，分辖村为四乡，北曰渠阳，见刘唏颜《新建宝坻县记略》碑。明新修宝坻县城，其北门亦曰渠阳，见王鏊《宝坻新城记略》碑。因此，宝坻县别称渠阳。渠阳者，是谓在渠水之北也。《宝坻县志》称：“宝坻县，潮河经其东，三汊纬其北，渠水绕西而络其南”，又“渠河水自香河县蒲石河东注，流经城池内开源水闸入城，……复南流，由通津桥出节流水闸，蜿蜒百里，至八门城会潮河入海”。这里的渠水或渠河水，既可视为泃河的故道，亦可理解为泉州渠的遗迹。也就是说，泉州渠是由西向东从今宝坻县中部穿过的。\n第四，《水经》中的沽水（潞河）与鲍邱水是分流入海的两条河。有关沽水之文已见上引，而“鲍邱水从塞外来，南过渔阳县东，又南过潞县西，又南至雍奴县北屈东入于海”。因此，魏武从泃河口凿入潞河，实际上就是把鲍邱水与沽水联通起来。魏武欲用兵三郡乌丸，粮草供应虽赖中原，但其战略出发地却是幽州。从泃河口凿入潞河的泉州渠，将潞河与鲍邱水联通，使幽州通海的水路北移而便捷了。这就是魏武开凿泉州渠的意义所在。\n第五，《水经注·鲍邱水》云：“鲍邱水自雍奴县故城西北旧分笥沟水东出。今笥沟水断，众川东注，混同一渎，东迳其县北，又东与泃河合。……又东合泉州渠口故渎。……鲍邱水又东，庚水注之”。上文已经指出，至东汉末，鲍邱水与沽水还是分流入海的两条河。但是，为什么《水经注》中的鲍邱水会在雍奴县故城西北旧分笥沟水东出呢？究其原因，乃是魏武从泃河口凿入潞河的结果。泉州渠凿成之后，潞河（笥沟）的水有一部分分流入泉州渠和鲍邱河。后来，鲍邱水在潞县以北与沽水合流，潞河之水倍增，分流入泉州渠的水量也加大。久之，泉州渠被冲宽刷深，变成潞河下游主流河道。与此同时，因水量被分出东注，原笥沟下游的水量锐减，流速变缓，泥沙淤积，河床增高，久之断流。《水经注》所谓沽水下游“今无水”或“今笥沟水断”，就是这样造成的，从而出现“众川东注，混同一渎”的局面。值得特别注意的是，这里混同一渎的“众川”，所指为沽水、鲍邱水、㶟馀水、㶟水等。其中，沽水、鲍邱水、㶟馀水在潞县以北已经合流，说见上文，只有㶟水没有涉及。《水经注》云：“㶟水自（落马洪）南流出山，谓之清泉河”；“㶟水又东南，迳良乡县之北界，历梁山南”；“㶟水又东，迳广阳县故城（在今房山区东北隅广阳城村_作者）北”，“㶟水又东北，迳蓟县故城（在广安门一带_作者）南，《魏土地记》曰：蓟城南七里有清泉河”，“㶟水又东，与洗马沟水（今莲花池河_作者）合”，“㶟水又东南，高梁之水注焉”，“㶟水东入渔阳（郡），所在枝分，故俗谚云：‘高梁无上源，清泉无下尾’。……清泉至潞，所在枝分，更为微津，散漫难寻故也”。显然，《水经注》中的㶟水下游河道，大致就是今凉水河。明清之世，凉水河流至通州西南高古庄时，尚分为三派，一向东北流，入张家湾南的马家庄飞放泊，名黄沤河；一向东南流，至武清入凤河，名新庄河；一向正东流，至漷县东入白河，名漷河。这种形势与枝分的㶟水尾流极相似。其中东去的一派当是㶟水主流。故《水经注》云：“沽水又南经潞县，为潞河。……㶟水注焉，俗谓之合口也。又东，鲍邱水于（雍奴）县西北而东出焉”。水注入潞河处，俗称合口。在通州东南35里今有地名曰和合站，旧名和合驿，“以白、榆、浑三河合流而名”。所谓合口，应当在此。唯有如此，才有可能众川东注，混同一渎，即自合口向东流，至今香河县西北东趋，迳县之北境至渠口，与泃河合，然后东迳今宝坻县中部向东南流去。这就是《水经注》中汇众川为一渎而东注的鲍邱水的流势，也就是泉州渠北段的所在。总之，泉州渠南口接泉州之东的泒河（大致在今天津附近），然后曲屈向北，历雍奴薮水泽180里，至今宝坻县东部接鲍邱河，再溯鲍邱河西去，经今香河县东北境的渠口（泃河口）和县之北境，至香河县西北境与潞河（今北运河）相接，即泉州渠的北口当在今北运河由西向东折而南流之处。泉州渠的开凿，便利了幽州通河海运漕的水路交通。\n关于新河，是联通鲍邱水与濡水（滦河）间众多河流的一条西东向渠道。《水经注》云：“濡水东南流，迳乐安亭南，东与新河故渎合。渎自雍奴县承鲍邱水东出，谓之盐关口。魏太祖征蹋顿，与泃口俱导也，世谓之新河矣”；“新河又东北绝庚水，又东北出，迳右北平，绝巨梁之水”；“新河又东，分为二水，枝渎东南入海。新河自枝渠东出，合封大水，谓之交流口”；“新河又东出海阳县，与缓虚水会”；“新河又东与素河会，谓之白水口”；“新河又东，与清水会”；“新河又东会于濡”。杨守敬指出：“新河旧自宝坻县东经丰润县、滦州，至乐亭县西北，入滦河，久堙”。此说大体不错。按新河承鲍邱水东出处，谓之盐关口，应即今宝坻处。宝坻县，金置。金以前，地名新仓镇。五代赵德钧于此“置榷盐院，谓之新仓，以贮盐。复开渠运盐，贸于瀛、莫（州）间，上下资其利”。可见历史上这里就是芦台盐集散、转销、榷税之地。汉魏时这里为盐关口也是可信的。新河从盐关口（宝坻）东去，将鲍邱水（今宝坻鲍邱河）、庚水（今蓟县州河，下游即蓟运河）、巨梁水（今丰润、玉田县还乡河）、封大水（今唐山、丰南县陡河）、缓虚水（今滦县、丰南县沙河）、素河（滦县、滦南县诉河）、清水（今滦南县小清河）、濡水（今乐亭县老滦河底）联通起来，目的就是便于向辽东、辽西转运军粮。当然，这条新河只能因势曲屈通过滨海地区，不可能径直穿过唐山以北的丘岭山地。\n综上所述，曹操为征三郡乌丸而开凿的平虏渠、泉州渠和新河，把南起滹沱河、北至鲍邱水，又转东至濡水的幽州以南、以东的众多河流湖泊串联起来，形成河北平原东部的水路交通网络，并以㶟水、高梁水与幽州相通。若再加上曹操于建安九年（204年）开凿的白沟，则幽州南下的水路交通可达中原腹地。这些渠道不仅在征三郡乌丸的完全胜利中发挥了重要作用，而且为后代南北水路交通的开发奠定了历史基础。\n",
    "出处": "侯仁之.北京城市历史地理[M].北京：北京燕山出版社,2000.388-394",
    "交通工具": null,
    "交通要道": "曹操开凿的平虏渠、泉州渠和新河",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.38,
        39.95
      ]
    ]
  },
  {
    "时期": "东汉",
    "原文": "东汉光武帝建武九年（公元33年），拜讨虏将军王霸为上谷郡太守（郡治沮阳，今怀来官厅水库南之大古城_作者）,“领屯兵如故，捕击胡虏，无拘郡界。”十三年（公元37年），卢芳亡入匈奴，“与匈奴、乌桓联兵，寇盗尤数，缘边愁苦。”其时，王霸“凡与匈奴、乌桓大小数十百战，颇识边事，数上书言宜与匈奴结和亲，又陈委输可从温水漕，以省陆路转输之劳，事皆行之”。对这里的温水，唐李贤引《水经注》注云：“温馀水出上谷居庸关东，又东过军都县南，又东过蓟县北。益通以运漕也”。也就是说，王霸所谓的“可从温水漕”，是指利用温馀水运输漕粮。《汉书·地理志》上谷郡军都县下云：“温馀水东至路南入沽”。按汉军都县城在今昌平西17里、南口镇东，路县城在今通县东8里古城村。据此可断，汉代温馀水即今温榆河。溯温馀水而上，向上谷郡转输漕粮，以省陆路转输之苦，山川形势既允可，亦在情理之中。这是目前见到的有关历史上北京地区水路运输的最早记载。",
    "出处": "侯仁之.北京城市历史地理[M].北京：北京燕山出版社,2000.387-388",
    "交通工具": null,
    "交通要道": "东汉之温水漕",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.07,
        40.29
      ]
    ]
  },
  {
    "时期": "东汉建武九年（公元33年）",
    "原文": "温榆河水系开发较早。《后汉书·王霸传》记载，汉建武十三年（公元37年）后，王霸“数上书，言宜与匈奴结和亲；又陈委输可从温水漕，以省陆输之劳。事皆施行。”唐章怀太子李贤认为，温水就是联系蓟县与上谷郡的温榆水，“益通以运漕也。”清人顾炎武则认为温水是湿水（永定河）之误。到底从哪条路线有可能通漕运，需稍考察一下。\n东汉建武九年（公元33年），“玺书拜霸上谷太守”。因“卢芳与匈奴、乌桓连兵，寇盗尤数，缘边愁苦。”十三年（37年）王霸与杜茂治飞孤道以固边防。接着就是提议通漕运，为上谷郡供应边饷。上谷郡治沮阳（旧怀来县治，官厅水库南），位于燕山山脉之北。如想运输平原粮饷，从地形上看，只有两条路线：一是出昌平南口居庸关，约京张铁路路线；一是沿永定河溯流而上，约丰沙铁路路线。前者沿温榆河可至昌平，再转陆运，出居庸关后距沮阳不过六、七十里了，后代也曾沿此线通漕运（详下）。而后者通漕运，因官厅山峡（长108公里）坡陡流急，难以行船。后代也均未见成功记载（元、明二代，多次尝试，均未成功）。就是现代兴建铁路也是这条路线艰难得多。且当时湿水下尾所在枝分、河道多变，似也不能通航。\n",
    "出处": "蔡蕃.北京古运河与城市供水研究[M].北京：北京出版社,1987.49",
    "交通工具": null,
    "交通要道": "一是出昌平南口居庸关，约京张铁路路线；一是沿永定河溯流而上，约丰沙铁路路线",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.07,
        40.29
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "东北方向：从大都东行过通州，经蓟州通辽阳行省驿道。这条驿路有一条大道过鸭绿江通往朝鲜半岛，渡海可达日本，是一条国际通道。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.87",
    "交通工具": null,
    "交通要道": "从大都东行过通州，经蓟州通辽阳行省驿道。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "河套方向：从大都出居庸关经大同通往河套地区，再西向通新疆伊州（哈密），取道天山北麓，通过察合台后王封地仰吉八里（今新疆玛纳斯西部）、阿里麻里（今新疆霍城北）可达钦察汗国，继续通行可达里海北岸的克里木半岛。这是通钦察汗国道的南线。取道天山南麓西行，跨越葱岭，通伊利汗国（今阿富汗、伊朗、伊拉克地区），此道名波斯道。波斯道与钦察道是东亚通中亚与西亚的重要干线，并有支线通南亚恒河流域的底里城，在中西交通史上，比汉唐的丝绸之路更具影响。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.87",
    "交通工具": null,
    "交通要道": "从大都出居庸关经大同通往河套地区，再西向通新疆伊州（哈密），取道天山北麓，通过察合台后王封地仰吉八里（今新疆玛纳斯西部）、阿里麻里（今新疆霍城北）可达钦察汗国，继续通行可达里海北岸的克里木半岛。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.07,
        40.29
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "内地干线：一是与运河平行的驿道，从大都之东的通州出发，经天津、德州、徐州、扬州，向西联通江宁（今南京），向南过江通往苏杭、福州，与大运河和近海漕运线一起组成东部水陆交通网的骨架。另一路是出大都向西南经涿州，向西通往太原，向南通汴梁，进而联通中原、华南、西南、西北各地。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.87",
    "交通工具": null,
    "交通要道": "一是与运河平行的驿道，从大都之东的通州出发，经天津、德州、徐州、扬州，向西联通江宁（今南京），向南过江通往苏杭、福州，与大运河和近海漕运线一起组成东部水陆交通网的骨架。另一路是出大都向西南经涿州，向西通往太原，向南通汴梁，进而联通中原、华南、西南、西北各地。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "元代实行两都制，大都为国都，忽必烈即位的开平府（今内蒙古正蓝旗东北四十里闪电河北岸兆奈曼苏默上都故城）为上都。每年春季皇帝赴上都避暑，秋天再返回大都过冬，两都因此又分别有“夏都”与“冬都”之称。大都与上都之间的通道可以分为东、西两路，西路又可分三道支线。周伯琦《扈从诗前后序》（贾敬颜《五代宋金元人边疆行记十三种疏证稿》本）载：\n两都相望，不满千里，往来者有四道焉。曰驿路，曰东路二，曰西路。东路二者，一由黑谷，一由古北口。古北口路，东道御史按行处也。予往年职馆阁，虽屡分署上京，但由驿路而已，黑谷辇路未之前行也。因忝法曹，肃清毂下，遂得乘驿。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.87-88",
    "交通工具": null,
    "交通要道": "大都与上都之间的通道可以分为东、西两路，西路又可分三道支线",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        117.15,
        40.68
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "大都通上都路线的东路，由大都东北行，过顺州（今顺义）、檀州（今密云），出古北口后分成两道。东道支线由此向北，经今滦平县东北的兴州，再沿北偏西方向，过丰宁县的波罗诺、凤山、北头营，隆化县的郭家屯，围场县的南山咀、老窝、御道口，在此转而向西，经内蒙古多伦到达上都。这条路线，在清代行记里仍有清楚的记载。东路的西道支线自古北口向西北沿潮河谷地北上，经今滦平县的六道河，丰宁县的窄岭、长阁、大阁镇、土城子，再向北或西北穿越丰宁县北部的山间沟谷，抵达多伦后转而西去，同样可到上都。中统二年（1261）十月，“诏平章政事塔察儿率军士万人，由古北口西便道赴行在所”；十一月，“分蒙古军为二，……讷怀从阿忽带出古北口，驻兴州”。他们所走的路线，就是这条东路。次年闰九月，“立古北口驿”，“敕京师顺州至开平置六驿”，旨在加强东路的交通建设。至元二十年（1283）十月，“车驾由古北口路至自上都”，忽必烈所走的也是这条路线。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.88",
    "交通工具": null,
    "交通要道": "由大都东北行，过顺州（今顺义）、檀州（今密云），出古北口后分成两道。东道支线由此向北，经今滦平县东北的兴州，再沿北偏西方向，过丰宁县的波罗诺、凤山、北头营，隆化县的郭家屯，围场县的南山咀、老窝、御道口，在此转而向西，经内蒙古多伦到达上都。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        117.15,
        40.68
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "元代皇帝往返于大都与上都之间，更多选择西出居庸关的西路。从大都健德门（今北土城西路健德门桥附近）西北行，经今海淀区的双线、清河、唐家岭、玉河、双塔，昌平区的土城、辛店（元名“西辛店”，曾一度为昌平县治），到达南口附近的龙虎台，然后可出居庸关。如果出大都和义门（西直门），过高梁桥、海淀、东北旺，再向前则与唐家岭之路相接。龙虎台西距南口不远，清初顾炎武《昌平山水记》云：昌平旧县“又西十里为龙虎台，地势高平如台，广二里，袤三里。……元时车驾巡幸上都，往来皆驻跸其上”。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.88",
    "交通工具": null,
    "交通要道": "从大都健德门（今北土城西路健德门桥附近）西北行，经今海淀区的双线、清河、唐家岭、玉河、双塔，昌平区的土城、辛店（元名“西辛店”，曾一度为昌平县治），到达南口附近的龙虎台，然后可出居庸关。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.07,
        40.29
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "走出四十里的居庸关险道之后，在居庸关北口不远的“岔道村”，西路分成向西与向东北的两支。向东北去的一路由岔道村经延庆县城东、大柏老、旧县（原缙山县治）、黑峪口、白河堡，转而向北进入河北省赤城县（元代称“云州”）境内，经南拨子、龙门所，东出长城后过塘子营、东万口、喜峰嵯等地，进入滦河源头地区，即可直趋上都。有时则从白河堡沿河谷北上，经赤城、云州、独石口等地奔赴上都。元代称这条路为“辇路”，因为在龙庆州（今延庆县）路段内经过了缙山、色泽岭、黑峪口等地，所以又有缙山道、色泽岭道、黑峪道之类的称谓。元世祖至元十八年（1281）闰八月，“敕守缙山道侍卫军还京师”；次年七月，“发察罕脑儿军千人治缙山道”。泰定三年（1326）七月，“发兵修野狐、色泽、桑乾三岭道”。顺帝元统二年（1334）四月，“罢龙庆州黑峪道上胜火儿站”；至元十四年（1354）五月，“诏修砌北巡所经色泽岭、黑石头河西沿山道路，创建龙门等处石桥”。上述历史事实都与这条“辇路”相关，元仁宗甚至诞生在缙山县香水园（今延庆县东北上下花园村）这座御道行宫里。此外，在赤城县东部长城以外，沿途仍有官路房、马道口、大京门、小京门等聚落名称，它们也是显示这条重要官道的证据。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.88-89",
    "交通工具": null,
    "交通要道": "走出四十里的居庸关险道之后，在居庸关北口不远的“岔道村”，西路分成向西与向东北的两支。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.07,
        40.29
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "元宪宗六年（1256），忽必烈在桓州东、滦水北营建开平城，后为元上都。至元四年（1267）建大都城，大都与上都之间有多条道路相通。东路从大都经顺州、密云，出古北口至上都。西路从大都出居庸关，路分三股：一股向西，经怀来、土木、宣化、张家口等地，转东北行至上都，称为御路；一股自土木向北，经雕鹗、赤城、独石口等地到上都，称为驿路；一股从居庸关三堡向东北，经小张家口、旧缙山县、黑峪口、龙门所，至上都，称为辇路。另外，从大都安贞门向北，经黄花镇、四海冶等地至上都，是传送紧急军情的要道。",
    "出处": "侯仁之主编 唐晓\n峰，温宗勇，尹钧科副主编.北京历史地图集．文化生态卷[M].北京：文津出版社,2013.147",
    "交通工具": null,
    "交通要道": "另外，从大都安贞门向北，经黄花镇、四海冶等地至上都，是传送紧急军情的要道",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.07,
        40.29
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "元顺帝时监察御史周伯琦扈从巡幸上都，东出西还，记载尤其详细。其作《扈从诗前后序》记载走东路到达上都的里程：\n至正十二岁次壬辰四月，予由翰林直学士、兵部侍郎，拜监察御史。视事之第三日，实四月二十六日。大驾北巡上京，例当扈从。是日启行，至大口留信宿。历皇后店、皂角，至龙虎台，皆捺钵也。国语曰纳钵者，犹汉言宿顿所也。龙虎台在昌平县境，又名新店，距京师仅百里。五月一日，过居庸关而北，遂自东路至甕山。明日至车坊，在缙山县之东。缙山，……今名龙庆州者，仁庙降诞其地故也。……又明日入黑谷（又名黑峪口，今永宁城西北二十里），过色泽岭，其山高峻，曲折而上，凡十八盘而即平地。遂历龙门及黑石头（今赤城县一带），过黄土岭，至程子头，又过摩儿岭，至颉家营。历白答儿（今独石口），至沙岭。自车坊、黑谷至此，凡三百一十里。……遂历黑咀儿，至失八儿秃，其地多泥淖，以国语名，又名牛群头。……至察罕脑儿（今沽源县东北），云然者，犹汉言白海也。……其地有行在宫，……驻跸于是，秋必猎校焉。此去纳钵曰郑谷店，曰明暗驿、泥河儿、旧李陵台驿、双庙儿（今正蓝旗黑城子），遂至桓州，曰六十里店。……前至南坡店，去上京止一舍耳。以是月十九日抵上京。历纳钵凡十有八，为里七百五十有奇，为日二十四。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.89",
    "交通工具": null,
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.07,
        40.29
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "《析津志》载：元大都“大街二十四步阔，小街十二步阔。三百八十四火巷，二十九衖通”。这些大街小巷经纬分明，南北和东西各有9条大街。在南北向大街的东西两侧，称为“火巷”或“胡同”的街道基本平行排列。“火巷”是源于防火通道的街巷，“衖通”应是连接若干条街巷的更宽一些的通道。元大都各坊在城内顺序排列，坊门之上署有坊名。《日下旧闻考》引《析津志》云：“坊名，元五十，以大衍之数成之，名皆切近，乃翰林学士虞集伯生所立。”但是，据今人考证，元大都设立诸坊之时，后来在元朝文名甚盛的虞集还是一个十四岁的少年而且并未在大都生活，绝不可能是各坊的命名者。此外，元大都有五十坊之说，也与《元一统志》所载四十九坊不符。我们的研究证明，元大都最初设立的坊只有“四十九”而不是“五十”个。《析津志》所谓“以大衍之数成之”的立意原本不错，但它的作者熊梦祥恰恰忽略了《周易·系辞上》“大衍之数五十，其用四十有九”的后半句，以致此后数百年间的多种论著相沿成习、一误再误，不是从未逐一查考诸坊的数量，就是怀疑《元一统志》漏载一坊，惟独不去核对与理解《周易》这部经典的原文。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.99",
    "交通工具": null,
    "交通要道": "“火巷”是源于防火通道的街巷，“衖通”应是连接若干条街巷的更宽一些的通道。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.38,
        39.91
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "元世祖至元三十年秋（1294年），郭守敬主持建成通惠河，连接起元大都至通州的漕运要道。当年，忽必烈由上都返回大都，路过积水潭，看见舳舻敝水的盛况，大悦，赐名积水潭至通州的漕运河道为通惠河。\n元代通惠河的上游水源起自昌平区白浮村的神山泉，郭守敬导神山泉沿山麓向西流，以避开高程约40米的清河、沙河河谷，继而南转，沿途接纳双塔河、温榆河的诸多泉水，又合一亩泉、玉泉水汇入瓮山泊。白浮瓮山河沿着高程50米的渠道流下，进而沿着高梁河至西水门进入大都城，向南汇入积水潭。河水过万宁桥、东不压桥，流经皇城北墙、东墙之外，向南流出城外，沿金时闸河故道转入高程约20米的通州，在杨闸村转而东南直至高丽庄与北运河相接。元代通惠河总长164里104步，设置24座闸，成宗年间闸名有更改，武宗以后陆续将木闸换为石闸加以维护。从高梁河段至高丽庄的河闸有：广源闸（2闸）、西城闸（2闸）、朝宗闸（2闸）、海子闸（又名澄清闸，3闸）、文明闸（2闸）、魏村闸（又名惠和闸，2闸）、籍东闸（又名庆丰闸，2闸）、郊亭闸（又名平津闸，3闸）、通州闸（又名通流闸，2闸）、杨尹闸（又名普济闸，2闸）、河门闸（又名广利闸，2闸）。由通州进入大都的船只依次通过各闸，可以一直驶入积水潭码头，并将粮食沿途存储在北太仓等粮仓。",
    "出处": "侯仁之主编 邓辉，\n温宗勇，尹钧科副主编.北京历史地图集．文化生态卷[M].北京：文津出版社,2013.98",
    "交通工具": "漕运",
    "交通要道": "郭守敬主持建成通惠河，连接起元大都至通州的漕运要道。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "元代为解决大都至通州漕运问题，郭守敬于中统三年（1262年）引玉泉山水至通州，以增加漕运水源，又于至元二十九年（1292年）主持修建通惠河，引昌平白浮泉水到瓮山泊，与玉泉山水汇合，再由瓮山泊引至大都城内积水潭，由积水潭引至通州。为此，开凿了白浮至瓮山泊的河道，后人统称之为白浮堰，以及开凿由瓮山泊到大都城的河道，即今之长河。沿长河修建了由青龙桥至麦庄桥的十里长堤，将玉泉山水系与高梁河水系连接起来。在通惠河上兴建广源闸和会川闸等船闸，以利于通航。通惠河的修建改变了海淀地区的水系格局，原来流入巴沟低地的玉泉山泉水改由通惠河流入大都，玉泉山水系与万泉河水系分离。\n此外，元代为保证宫廷用水，专门修建了由玉泉山至大都皇宫的金水河，金水河与通惠河上游的长河引水河段大致平行，由和义门南水关入城。\n",
    "出处": "侯仁之主编 邓辉，\n温宗勇，尹钧科副主编.北京历史地图集．文化生态卷[M].北京：文津出版社,2013.108",
    "交通工具": "船",
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "元朝的残余势力尽管退归漠北，但对北京仍然构成了严重的军事威胁。北京与周边地区各个关口之间的道路，因此变得极为重要。\n元人北归，屡谋兴复。永乐迁都北平，三面近塞。正统以后，敌患日多。故终明之世，边防甚重。东起鸭绿，西抵嘉峪，绵亘万里，分地守御。初设辽东、宣府、大同、延绥四镇，继设宁夏、甘肃、蓟州三镇，而太原总兵治偏头，三边制府驻固原，亦称二镇，是为九边。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.106",
    "交通工具": null,
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.91
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "元大都建成后，漕运西山木石的任务不再紧迫。文宗大德二年（1298）浑河再次泛滥，冲毁大都西南地区百姓庐舍禾稼，都水监为了防止洪水顺势沿金口河冲击大都新、旧二城，下令把金口闸门关闭。到了大德五年，鉴于汛期浑河的浩大水势以及洪水漫溢的危险，时任知太史院事的郭守敬下令将亲自规划的金口河堵塞，将金口闸以西至浑河岸边麻峪村的河道用砂石杂土全部填平，彻底消除了金口河对下游尤其是元大都的威胁。\n元朝后期通惠河疏于养护和疏浚，渠道破败淤塞，水源减少，沿河闸口多有毁坏，城市生活对物资的需求仍在增长，陆续有人建议重开金口河。文宗至顺元年（1331），行都水监郭道寿认为，“金口引水过京城至通州，其利无穷”。顺帝至正二年（1342），中书参议孛罗帖木儿、都水监傅佐建议重开金口河，中书右丞相脱脱也极力推许，他们奏称：“如今有皇帝洪福里，将河依旧河身开挑呵，其利极好有。西山所出烧煤、木植、大灰等物，并递来江南诸物，海运至大都呵，好生得济有”。这时希望运输的西山物资种类更多，大都城内用煤“每至九月间买牛装车，往西山窑里头载取煤炭，往来于此，……或以驴马负荆筐入市。冬月，则冰坚水涸，车牛直抵窑前”，“日发煤数百”，如能水运也可获利甚多。中书左丞许有壬等反对无效，至正二年（1342）正月至四月重新开挖了金口河，称为“金口新河”。\n金口新河与郭守敬的金口河有所不同：引水地点由麻峪上溯到三家店浑河出山口分水再入金口；在金口安置了坚固的铜质闸板以确保安全；深挖开挑金口旧河，多水汇合处开挖水塘以调节水量；在金中都旧城的北城壕增加两座节制水量的闸门。“将此水挑至大都南五门（按：当为“午门”，大都南城门的正门）前第二桥，东南至董村、高丽庄、李二寺、运粮河口”。今人结合考古资料推断：在人民大会堂西南的国家大剧院工地所发现的金口河遗址中，其第5沉积层即为元末金口新河沉积，河道较元初稍向北移，宽约40米。《析津志》称金口新河“东南至董村、高丽庄、李二寺”，而董村在今通州区北、萧太后河南部，高丽庄即今通州大高力庄、萧太后河北岸。所以，金口新河应当经过今人民大会堂西南侧以及元大都丽正门前第二桥后，东南经今东城区三里河，下接萧太后河。肖太后河在张家湾汇入运河。\n金口新河虽然比较重视以工程技术措施节制水流，但忽略了浑河坡降显著、水流过速的隐患。完工之后，脱脱命许有壬到金口率夫役开闸放水，不料浑河水汹涌而下：\n水至所挑河道，波涨潺汹，冲崩堤岸。居民彷徨，官为失措。漫注支岸，卒不可遏。势如建瓴，河道浮土壅塞，深浅停滩不一，难于舟楫。其居民近于河者，几不可容。\n随后只好放下闸板关闭金口，但惨重的祸患已经形成，再加上施工期间祸及大批民居、商肆、坟墓，“夫丁死伤甚众”，致使朝野怨声载道。御史弹劾建议开挑金口的责任者，朝廷只好把孛罗帖木儿和傅佐斩首以平民愤。金口河的罢废，意味着以卢沟水接济漕运的失败，缺水又多沙的运河对国都经济来源的保障变得越来越吃力。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.97-98",
    "交通工具": null,
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.35,
        39.88
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "为解决大都建设中运输粮食、木材、石料等物资的问题，至元二年（1265）郭守敬提出：\n金时自燕京之西麻峪村分引卢沟一支，东流穿西山而出，是谓金口。其水自金口以东、燕京以北，溉田若干顷，其利不可胜计。兵兴以来，典守者惧有所失，因以大石塞之。今若按视故迹，使水得通流，上可以致西山之利，下可以广京畿之漕。\n设想通过重开金朝曾经废弃的金口河，引卢沟水运送西山的木材和石料并接济漕运。郭守敬吸取了金代的教训，先在麻峪与金口（今石景山发电厂院内）之间的西岸开一个减水口，“西南还大河，令其深广，以防涨水突入之患”。这就是说，一旦遇到河水暴涨，就迫使浑河水沿着这条减水河向西南流，回归浑河下游故道。做了这样的准备后，郭守敬才开挖金口河渠道，从而规避了洪水对大都的威胁。元世祖采纳了郭守敬的建议，至元三年（1266）十二月下令“凿金口，导卢沟水以漕西山木石”，以供应大都所需的建筑材料。\n但是，地形上西北高、东南低的高屋建瓴之势以及泥沙含量的增加，使卢沟已有“浑河”之称，由它引出的金口河也存在着夏秋季节决口的隐患。至元九年（1272）五月发生了严重的水灾：\n五月二十五日、二十六日，大都大雨流潦，弥漫居民，室屋倾圮，溺压人口，流没财物、粮粟甚众。通玄门（金中都正北门）外，金口（河）黄浪如屋，新建桥庑及各门旧桥五六座，一时摧败，如拉朽漂枯，长楣巨栋，不知所之。里闾耆艾莫不惊异，以谓自居燕以来未省有此水也。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.96-97",
    "交通工具": null,
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.92
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "大都的粮赋供给几乎全部仰仗江南，《元史·食货志》记载，元朝一年征粮多达一千二百余万石，漕粮运输非常繁重。元初着力开辟南北大运河并发展海运，但只能运抵通州。通州至大都城的坝河水量较小，远远不能满足漕运所需。陆路运输耗费巨大，年运费高达六万缗，每每因下雨泥泞、道路不平而使“驴畜死者不可胜记”。面对通州到大都城的漕运问题，我国历史上著名的科学家，在天文、历法、水利等多个领域都有杰出贡献的郭守敬适逢其会。\n早在中统三年（1262），经刘秉忠推荐，元世祖忽必烈于开平（今内蒙古多伦西北）召见郭守敬，采纳了他提出的兴建大都城以及重新规划、沟通北运河等多种设想。至元十三年（1276）七月，“以杨村（今天津武清）至浮鸡泊漕渠迥远，改从孙家务。八月己巳，穿武清蒙村（今武清大孟村）漕渠”；“至元二十四年正月戊辰，以修筑柳林河堤南军三千，浚河西务（今武清河西务）漕渠”；“至元二十六年五月庚辰，发武卫亲军千人浚河西务至通州漕渠”。这些基本上都是在实施郭守敬的规划。至元二十六年，南北大运河的山东段济州渠和会通河疏浚完工；二十八年，从山东临清沿着旧御河（隋时永济渠）故道北至大都地区的内河漕运也全部疏浚，陡然增加了从通州到大都城下的运输压力。\n郭守敬在调查大都地区地理环境和水资源的基础上，向元世祖提出：\n大都运粮河，不用一亩泉旧源，别引北山白浮泉（今北京昌平白浮村北）水，西折西南，经瓮山泊（今颐和园昆明湖），自西水门（今北京西直门北）入城，环汇于积水潭，复东折而南，出南水门（今前门与崇文门之间以北），合入旧运粮河（即金中都闸河）。每十里置一闸，比至通州，凡为闸七。距闸里许，上重置斗门（即闸门），互为提阏，以过舟止水。\n郭守敬的规划旨在解决漕运的水源问题，恢复并改进了金中都闸河。至元二十九年春动工，元世祖令“丞相以下皆亲操畚锸”参加开工典礼。第二年秋，工程告成。昌平白浮泉水汇聚温榆河上源诸脉泉流一路西行，从上游绕过沙河、清河谷地，循西山山麓转而东南，沿途收集清泉聚入瓮山泊。然后，从瓮山泊进入长河、高梁河，至和义门（今西直门）水关进大都城，汇入积水潭内。接着，从积水潭出万宁桥（今地安门北，俗称后门桥），沿皇城东墙外南下出丽正门（今正阳门北）东水关，转而东南至文明门（今崇文门北）外，与金朝时开凿的闸河故道相接，流至通州高丽庄、李二寺河口，全长164里。这项伟大的水利工程，将大运河的终点延伸到大都城内的积水潭，元世祖为这条新水道赐名“通惠河”。郭守敬摒弃了金代的滚水坝，从文明门到通州，在通惠河之上修建了10组共20座水闸。每十里设闸一组，每组上下两闸，相距一里。上行漕船驶进下闸后，下闸关闭以节水，上闸开启以蓄水。两闸之间水涨船高，构成了技术上遥遥领先于世界的梯级航道，漕船经过递相提升，直达新的漕运码头积水潭，使这片水域呈现出“舳舻蔽水”的盛况。\n借助于通惠河，全国各地的物资源源不断地从水上“漂”来，造就了大都的繁华。积水潭沿岸客商云集，遍布货栈商肆。海子东岸至钟楼南北，有米市、面市、缎子市、皮帽市、“穷汉市”（劳力市场）、鹅鸭市、珠子市、柴炭市、铁器市等店铺。各类官方机构、楼堂馆所、豪门苑囿在积水潭周边兴起，附近及通惠河沿岸建起了千斯仓、万斯北仓、万斯南仓、丰闰仓、广衍仓、顺济仓、万亿库等粮仓。体现各种信仰的寺庙纷纷出现，其中的马祖庙充分表达了海上与大运河之上从事漕运的人们对平安的期盼。\n元朝每年输运大都的漕粮在三四百万石以上，漕运行业的管理非常特殊而严格。除了从中央到地方的漕运管理机构外，船队都由军人负责。运粮军人俱系江北、两淮调拨的汉军及新附军人，各有管军千户、总把、百户等武官管领、押运。所雇运粮船只的船户，也有派往各船的押纲官员（每30船为一纲）押运。由于地位特殊，漕运船队常有仗势欺人之举。如有客船想从粮船两边经过，稍稍碰撞了粮船故意伸出的脚板，或者“桅篷高低、牵绳长短，误相牵挽”，漕船军人、船户就借此为由毒打、抢劫客船。漕船军人、船户还动辄登岸向两岸居住的村庄、店家“取要酒食，强打猪鸡，殴打百姓，滋扰百端”。元朝为此特别立法：今后再有运粮军人、船户的非法行径，“除将散军、船户对证是实……痛行断罪外，将押运正官取勒约束不严，招伏断罪”。这条禁令于至元三十一年（1294）十月由中书省制定后，颁布于江淮都漕运使司及漕河两岸各漕运分司严格执行。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.94-96",
    "交通工具": null,
    "交通要道": "沟通大都与通州的通惠河",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.35,
        39.88
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "元初可供依赖的漕运通道，仍然是金代曾经用过的坝河，但“坝河”之名却始于元代。元代在河中修建了七座滚水坝，以保持较多的水量便于漕船行驶，这条河因此被称为“坝河”。据《元史·河渠志一》和宋本《都水监事记》的记载，这七座滚水坝自通州至大都，依次为深沟坝、王村坝、郑村坝、西阳坝、郭村坝、常庆坝、千斯坝。《元史》记载：“至元十六年（1279），开坝河，设坝夫户八千三百七十有七，车户五千七十，出车三百九十辆；船户九百五十，出船一百九十艘”。坝河内的运粮船分设在通州以西7坝中的6坝，平均每坝有船30只，分段将漕粮从通州北运到大都光熙门（今朝阳区北三环东路光熙门）。《析津志》记述：“光熙门与漕坝（即坝河）千斯坝相接。当运漕岁储之时，其人夫纲运者，入粮于坝内，龙王堂前唱筹。”扛夫每扛一定数量的粮食由船卸岸，就可得到一块“筹”即竹片或木片，完工后在码头的龙王堂前凭此领取报酬。\n坝河中的漕船遇到滚水坝，必须逐一“倒搬”才能通过。自通州向西每过一坝，都需要扛夫把粮食卸下，再搬到此坝西面等待运粮的空船上面。逐坝递运，最终抵达大都东北隅的光熙门，需要大量的人力物力。据《元史·王思诚传》的记载统计，坝河常设坝夫800余名（按每10户出一人计算）、马车近400辆、船近200只。元世祖至元二十五年（1288）规定，坝河倒坝人夫（即坝夫），由于每年只在漕粮入仓季节才有事可做，决定“拟合实役月日，每名月支米三斗、盐半斤”。对负责出仓、入仓时在粮仓与码头之间运输的马车夫，也应有这样的开支。\n为解决坝河水量不足的问题，中统年间郭守敬曾引玉泉水入坝河。大都建成后，玉泉水被引入大内专供皇城使用，坝河随之又陷入经常淤浅的境地。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.94",
    "交通工具": null,
    "交通要道": "坝河的漕运通道",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.38,
        39.91
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "位于漷州的柳林海子，在辽代是延芳淀的一部分。辽代设立漷阴县，元代升为漷州，至明代又降为漷县，今通州张家湾凉水河以南地域，包括天津市武清区西北部，就是漷州的辖境。辽代这里有方圆数百里的巨大湖泊“延芳淀”，每年春末皇帝带领达官显贵来此游猎，以训练有素的猛禽海东青捉拿淀中栖息的天鹅和野鸭。由于腐草沉淀和泥沙淤积，这片湖泊到元代已缩减离析为若干块水面，成为蒙古族皇帝打猎游玩的“飞放泊”，主要有南辛庄飞放泊、栲栳垡飞放泊、马家庄飞放泊、柳林海子和作为数个小湖泊之一的“延芳淀”。《元史》记载：世祖至元十八年（1281）正月，“车驾幸漷州”；次年二月，“车驾幸柳林”。至大元年（1308）七月，“筑呼鹰台于漷州泽中，发军千五百人助其役”。元代在柳林海子建立了大型的行宫，至治三年（1323）五月初十日，“大风，雨雹，拔柳林海子行宫内外大木二千七百”。顺帝至元三年（1337）正月，“帝猎于柳林，凡三十五日”。从上述情况推断，由柳林海子到大都城之间，必定有一条重要的通道，文宗至顺三年（1332）七月，也确曾“调军士修柳林海子桥道”。柳林海子大致在今通州区牛堡屯镇的柳营村附近，北距通州城约7公里，所以，由大都至柳林海子行宫估计不走通州道，而是可能出文明门（在崇文门北）或丽正门（在正阳门北）直奔东南。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.93-94",
    "交通工具": null,
    "交通要道": "辽代设立漷阴县，元代升为漷州，至明代又降为漷县，今通州张家湾凉水河以南地域，包括天津市武清区西北部，就是漷州的辖境。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "海路与运河的漕运，是维系元大都城市发展的生命线。每年从江淮地区运至大都的粮食有二三百万石，由通惠河、坝河直接运抵大都的漕粮只是其中的一部分，还有不少要暂时储存在通州的十六座仓廒之内，再由陆路转输至大都城。在元世祖至元三十年（1293）通惠河开通之前，通州至大都之间的粮食转运线异常繁忙。《元史》形容通惠河开通前后的情形时说：“先是，通州至大都，陆运官粮，岁若干万石。方秋霖雨，驴畜死者不可胜计，至是皆罢之。”这里对通惠河的作用不免过于夸大，实际上在郭守敬之后，泰定三年（1326）十月，曾经“发卒四千治通州道，给钞千六百锭”；顺帝至元二年（1336）八月，“大都至通州霖雨，大水，敕军人修道”。可见，元代始终非常重视这条道路的修治和保护，陆路运输依然是漕粮进京的方式之一。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.93",
    "交通工具": null,
    "交通要道": "每年从江淮地区运至大都的粮食有二三百万石，由通惠河、坝河直接运抵大都的漕粮只是其中的一部分，还有不少要暂时储存在通州的十六座仓廒之内，再由陆路转输至大都城。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "开平即上都；横岭在居庸关西南21公里，今怀来县东界、军都山西侧有“横岭乡”。四海冶故地即在今延庆县四海乡驻地“四海村”，因元代有冶铁业而得名。有关这条道路的详情缺乏其他史料记载，但从大比例尺地图上观察四海冶堡南北的山川形势，也能多少看出某些端倪。若从健德门出大都城，沿着去居庸关的大道至昌平县（元代昌平县城在今昌平西8里旧县村），向东北穿过十三陵老君堂口，经黑山寨至黄花城。若从安贞门（在北三环安贞桥北）出大都，则直奔小汤山，向北经兴寿、下庄，至黄花城。从黄花城向北出撞道口、二道关，即至四海冶。沿着今菜食河谷至小川，转为西北过白河，沿黑河河谷溯源而上，经东卯、巴图营子，即与缙山道相接了。这条路显然是大都与上都之间的捷径，但从未见元代车驾经行的记载，估计也许是专门用来传递紧急军情政令的特殊通道。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.92-93",
    "交通工具": null,
    "交通要道": "横岭在居庸关西南21公里，今怀来县东界、军都山西侧有“横岭乡”。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.07,
        40.29
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "综上所述，所谓西路，是相对于古北口大道而言的。西路又有三个分岔：途经缙山、黑峪口、龙门所的辇路在东；途经榆林、土木、雕鹗、赤城、独石口的驿路居中；途经鸡鸣驿、宣化、张家口的御路偏西。由大都去上都时，三者在居庸关外陆续分离；由上都回大都时，它们则在居庸关外逐次合拢，从而沟通了两都之间的来往。\n明末清初的史学家顾祖禹，在《读史方舆纪要》中说：\n四海冶堡，[在永宁]县东百里。元时往来上都，恒取道于此。……嘉靖中，边臣许论言：四海冶上通开平大路，下连横岭，为三卫窥伺之地，宣府东路要防也。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.92",
    "交通工具": null,
    "交通要道": "途经缙山、黑峪口、龙门所的辇路在东；途经榆林、土木、雕鹗、赤城、独石口的驿路居中；途经鸡鸣驿、宣化、张家口的御路偏西。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.07,
        40.29
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "元代王恽《开平纪行》，记载了他自大都前往上都的历程。中统二年三月五日，王恽奉旨北上开平府。\n五日丙寅未刻，丞相禡禡与同僚发自燕京。是夕，宿通玄北郭（中都北郭中门）。……六日丁卯，午憩海店（今海淀镇），距京城二十里。……是晚宿南口新店，距海店七十里。戊辰卯刻，入居庸关。……午憩姚家店（今关沟附近下姚家河）。是夜宿北口军营，……距南口姚店三十里而远。己巳辰刻度八达岭，……出北口，午憩棒槌店，……午饭榆林驿。是夜宿怀来县，南距北口五十三里。……庚午泊统墓店（即土木堡），……是夜宿雷氏驿亭（今新保安镇）。地形转高，西望鸡鸣山，南眺桑干上流。……东南距怀来七十里而远。辛未午刻入宣德州，……是夜宿考工官刘氏第。……距雷氏驿九十里。癸酉，行六十里值雪，宿青麓。十三日甲戌，至定边城（张家口东北九十里静边城），憩焉，盖金所筑故城也。是夜宿黑崖子（今赤城县云州镇西北），距青麓九十里。十四日乙亥，抵榷场峪，盖金初南北互市之所也。是夜宿双城北十里小河之东南，距黑崖甸北一百有五里。十五日丙子，停午至察罕脑儿，时行宫在此。乱（涉）滦河而北，次东北土■下。……二十三日甲申，次鞍子山南（今骆驼山），距滦河四十里。二十四日乙酉，次桓州故城。……二十六日丁亥，……距鞍子山二十有五里。二十七日戊子，次新桓州（今内蒙古正蓝旗四郎城）。……二十八日己丑，饭新桓州。未刻，扈从銮驾入开平府，盖圣上龙飞之地。……（八月）二十日庚戌，诣都堂辞诸相南归。二十一日辛亥辰刻由都西门出，是夜宿桓州。二十二日壬子，抵旧桓州。二十三日癸丑，前次牛群头（今独石口北石头城子），取直东南下崖岭，夜半宿山南农家。明日甲寅，宿云州张继先家。二十五日乙卯，自望云沿龙门河（即沽河）南行，入寒山峪（今赤城山）。遇大雨，息寒山递铺。午霁，渡泥涧，人马坠而下、挽而上，登靖边北岭。……二十六日丙辰，下十八骨了（今塞石岭）。行约两舍，抵田家止宿。二十七日丁巳，宿北口小店。明日逾灰岭（今昌平灰岭口），试桃花峪温汤。……是晚，宿新店。又二日，至燕。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.90-91",
    "交通工具": null,
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.92
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "由“土木”向西北的岔路，经沙城、新保安、鸡鸣驿、下花园、响水铺、宣化（元顺宁府宣德县）、沙岭子、张家口，由此东北行或北上取道万全、中都（今张北县）转至上都。这条路虽然偏远，但历史悠久、路宽道平、最为畅通，元代称之为“御路”或“野狐岭道”，野狐岭即位于万全县东北三十里。此外，这条路的南半段也是由大都通往元旧都和林（在今蒙古国鄂尔浑河上游的哈尔和林）的必经之路。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.90",
    "交通工具": null,
    "交通要道": "由“土木”向西北的岔路，经沙城、新保安、鸡鸣驿、下花园、响水铺、宣化（元顺宁府宣德县）、沙岭子、张家口，由此东北行或北上取道万全、中都（今张北县）转至上都。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.35,
        39.88
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "七月二十二日，周伯琦随元顺帝从上都返回大都：\n发上都而南，是日宿六十里店纳钵。明日过桓州，至李陵台、双庙儿。又明日至明安驿、泥河儿。翌日至察罕脑儿。由此转西，至怀秃脑儿，有大海在捺钵后。怀秃脑儿，犹汉言后海也。曰平陀儿，曰石顶河儿，土人名为鸳鸯泺。……国语名其地曰遮里哈刺纳钵，犹汉言远望则黑也。……察罕脑儿至此有百余里，皆云需府境也。界是而西，则属兴和路矣。纳钵曰苦水河儿，曰回回柴，国语名忽鲁秃，汉言有水泺也。隶属州保昌。曰忽察秃，犹汉言有山羊处也。……又西二十里，则兴和路（今张北县）者，世皇所创置也。岁北巡，东出西还，故置有司为供亿之所。……东界则宣德府境，上都属郡也。府之西南名新城，武宗筑行宫其地，故又名曰中都。……由兴和行三十里，过野狐岭，岭上为纳钵。……前至得胜口，宣德，宣平县界也。……得胜口南至宣平县十五里，小邑也。……又前至沙岭，……又五十里至顺宁府，……南过坳儿岭（今宣化东南三十里鹞儿岭），……四十里至鸡鸣山，……又南二十里，乃平地，曰雷家驿，京尹所治也。雷家驿之西北十里，纳钵曰丰乐。丰乐二十里，阻车纳钵。又二十里至统幕，则与中路驿程相合。而南历狼居胥山，至怀来县。……县南二里，纳钵也。……南则榆林驿，……自怀来行五十里，至妫头。又十里入居庸关，关南至昌平龙虎台。又南则皇后店、皂角、大口焉。遂于八月十三日至京师。凡历纳钵二十有四，为里一千九十又五，此辇路西还之所经也。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.89-90",
    "交通工具": null,
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.35,
        39.88
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "元代开通了京杭大运河，又改造了金代闸河。在郭守敬的主持下，从昌平白浮泉引水入大都积水潭，下流至通州，称为通惠河。在元大都积水潭与通州北温榆河之间，利用旧河道开凿了坝河。通惠河与坝河是元代的主要漕运水道，积水潭成为京杭大运河的终点码头，出现了“舳舻蔽水”的盛况。",
    "出处": "侯仁之主编 唐晓\n峰，温宗勇，尹钧科副主编.北京历史地图集．文化生态卷[M].北京：文津出版社,2013.159",
    "交通工具": null,
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "元代通惠河限一百五十料船进入。若每料容重以60斤计，则一船载重约9000斤。再以每石米重一百斤折算，一船不过载米九十石。这是由于运河修建在水源紧张的北京地区，为节水行舟，河道一般修建的较窄，大都城内河宽一般不足30米。\n明清通惠河水资紧张，只能行驳运，不通商旅，河宽不过十丈，剥船长约六丈、宽一丈二尺，日运米约二万石，从五月起至九月可运二百五十万石左右。\n由于通州至北京是逆水，重船行进需要拉纤，在平水、逆风时也非拉纤不可。据记载，元代曾有“屋于岸道，固以狭病牵舟者，则毁其屋”的事情，是说明拉纤制度的存在。到明清通惠河成了静水，仍需纤夫。另外，通惠河元代拉纤亦有用畜力者，延用至明清。《雅坪散录》记载：（元）宋本《至治集》《驴牵船赋》有“今京东五闸剥运船多用之”的记载。运河两岸纤路之外，都种植杨柳和麻，由各闸官分段管理，或租与百姓维护，只收一定数量的麻，以便维护闸座和平时启闭闸板使用。\n",
    "出处": "蔡蕃.北京古运河与城市供水研究[M].北京：北京出版社,1987.154-155",
    "交通工具": "漕船",
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "至元十三年（1276年），元兵攻陷南宋都城临安（今杭州），不久就筹划水运江南粮食北上。当时经水陆联运可抵达通州，而通州至大都的运输问题日益突出。中统年间引玉泉水入坝河，但在开凿了金水河后，玉泉水大部分专门供大内使用（详下），坝河漕运受到严重影响，因而导致了至元十六年（1279年）大开坝河之举。",
    "出处": "蔡蕃.北京古运河与城市供水研究[M].北京：北京出版社,1987.39",
    "交通工具": null,
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "以大都为中心的驿站系统建立之后，就被人们频繁使用。如政府官员行政往来，时时不断。有的官员奉命执行公务，远涉千万里，皆使用驿站系统。如元代前期著名文士陈孚奉命出使安南（今越南等地），就作有多首诗歌以纪其行。《出顺承门》一诗曰：“又骑官马过中原，袖有芝泥御墨痕。岭海孤臣天咫尺，五云回首是都门。”诗中的“官马”就是指驿站提供的马匹。他又作有《过卢沟桥》、《良乡县早行》等诗，以描述从大都南下的驿站沿途景观。\n",
    "出处": "张艳丽.北京城市生活史[M].人民出版社,2016.117",
    "交通工具": "马匹",
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.22,
        39.85
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "由于有京杭大运河的开通，使得位于华北平原之上的大都城也设置有水站，与陆路驿站一起，为政府提供车辆和船只服务。据当时负责驿站系统的政府官员称：“至元三十年十月，通政院呈：通州水、旱站见设二十料小船一十只，每只四户，计四十户。内在逃四户，见有船九只供递。使臣站车伍拾辆，每辆一十三户，共六百五十户。内在逃八十七户，见在四十三辆。陆路自大都东接蓟州，递运繁冗。今拟蓟州车站，元设车数存留车一十五辆，余止车户改作船户，总合添船九十一只。不敷户计，于大都、河间两路附近州县当差户内佥拨。所据合该船只，撁船头疋，即系创立站赤，拟合官为应付。内车户就用元有驴畜撁船。……又据都水监呈：委边监丞与通政院王都事，一同踏逈，得通州李二寺仓东濒河，可以安立水站等事。奉都堂议得：不敷船五十四只近后定夺外，准拟于李二寺安置水站，拟拨站船四十六只。内除元有船九只外，就用通州车站户。该船三十七只，付税粮房，于刘灿所管船内依数应付。下兵部，行移通政院依数关支，就便安置施行。”据此可知，主管驿站系统的通政院、都水监等衙门，会根据时政变化而不断调整驿站系统。\n从元大都南下，主要有两条通道，一条是从大都城向南，出顺承门，过卢沟桥，一路南下走陆路；另一条是从大都城向东，出齐化门（今朝阳门），到通州，坐船沿京杭大运河南下，走水路。因为水路比较平稳舒适，所以很多人都是走这条路线。元代著名诗人张之翰就曾经沿水路南下，并作诗加以描述。《开船》诗曰：\n水宿四千里，船行第一程。岸随人北去，云送我南行。\n橹画之玄字，柁鸣鹅鹳声。亲朋入城去，独酌两三觥。\n这第一程的水路，是从大都城起身到通州城。他又作有《行至通州河上》诗曰：\n几壶光禄酒，一卷翰林诗。流水登舟远，斜阳上马迟。\n无人相慰借，有限自支持。回首都门柳，青青记别离。\n从都城到通州所走的水路，就是著名科学家郭守敬主持开凿的通惠河。《泊河西务》一诗曰：\n牵路缘高岸，风桥转古堤。村墟全寂寂，风日便凄凄。\n平野无人种，深村有鸟啼。近都才百里，特地作新题。河西务是从通州至直沽（今天津入海口）的中转水站，是重要的转运枢纽。\n元代后期的著名诗人傅若金也曾从大都南下，所走也是水路。他作有《河西务》一诗曰：\n驿路通畿甸，敖仓俯漕河。骑瞻南日去，帆听北风过。\n燕蓟舟车会，江淮贡赋多。近闻愁米价，素食定如何。\n把河西务在漕运系统中的重要作用描写得淋漓尽致。他又作有《直沽口》二诗，其一曰：\n远漕通诸岛，深流会两河。鸟依沙树小，鱼傍海潮多。\n转粟昏秋入，行舟日夜过。兵民杂居久，一半解吴歌。从江南运粮北上的百姓大多是把粮食卸在直沽口，随即南还，故而这里的民众也就十分熟悉江南地区的方言了。",
    "出处": "张艳丽.北京城市生活史[M].人民出版社,2016.117-119",
    "交通工具": "车辆和船",
    "交通要道": "水路",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.91
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "据《析津志》记载，施工时“将金口旧河深开挑，于聚水处做泊子，准备阙水使用。挑至旧城，又做两座闸，将此水挑至大都南五门前第二桥……。”可见这段新河河道大部分是利用金口旧河道。中间所做“泊子”，即调节水库，从地形上推测似利用了玉渊潭或在其附近的水域。玉渊潭元代又称丁家潭，是京城燕游之地，有开阔的水面，这项措施确比金口河高出一筹。旧城指原中都城，又称南城，此时城墙虽已拆除，但街道、寺院建筑等多存在。所做的“两座闸”应在北城濠西部，目的是防止金口水冲入旧城。“大都南五门前第二桥”，也就是“丽正门第二桥”。据元人宋本记载，位于丽正门第一桥之南。第一桥当在大都护城河上，第二桥应在金口新河之上。五门又作午门，即丽正门，明初仍有称正阳门为午门的记载。\n从旧城至顺承门（今西单稍南）一段河道，即所谓“顺承门西南新河”是这次新开凿的。初开挑时“大废民居房舍、酒肆茶房，若台榭墟墓”等。这一带是大都新城与旧城毗邻地区，当时已是繁华闹市区，要断然从中间开凿一条大河，移民拆迁工作量很大，加之官吏横行，致使怨声载道，这也是新河失败主管官吏被劾的重要原因之一。\n",
    "出处": "蔡蕃.北京古运河与城市供水研究[M].北京：北京出版社,1987.29-30",
    "交通工具": null,
    "交通要道": "金口以下至丽正门间河道",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.35,
        39.88
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "这里所称的高梁河东段，是指积水潭以下至通州的主要水道，共有两支：其一是南行后，再沿金口河至通州的路线，即金闸河和元代通惠河路线暂称南支；其二是自积水潭北部东引，经今北护城河、坝河至通州路线，为叙述方便暂称作北支。\n金口河不成功，世宗时浚治的漕渠又不畅通（详下），通州至中都的粮饷只得常用陆运。章宗承安五年（1200年），都水监丞田栎普查了运粮河道。五年以后，即泰和五年（1205年）正月，章宗“至霸州，以故漕河浅涩，敕尚书省发山东、河北、河东、中都、北京军夫六千，改凿之”。这次动员军夫地区包括中都在内，所改凿的重点应是中都至通州的运河，也就是“金闸河”。\n据《金史》记载，乌古论庆寿于“泰和四年（1204年）迁本局提点。是时议开通州漕河，诏庆寿按视。漕河成，赐银一百五十两，重币十端。”这次开河的建议人叫韩玉，《金史》记载他在“泰和中建言开通州潞水漕渠，船运至都。升两阶……”。从开渠后可以“船运至都”的记载看，这次所开漕渠，应包括通州以南的“潞水漕渠”和通州至中都的一段运渠。这次开凿后的第二年（泰和六年），规定漕河所经的府、州、县各官吏都带管漕河事，“俾催检纲运，营护堤岸”。其中包括了“大兴府”和“通州”在内，这也反映了漕河所在位置。该年十二月，“通济河创设巡河官一员，与天津河同为一司，通管漕河闸岸，止名天津河巡河官，隶都水监”。通济河所指是哪段？据《金史·百官志》记载，“通济河都巡官兼建春宫地方河道”。建春宫在今南苑附近，属大兴府。由此可见通济河是指闸河，天津河应指通州以南的漕河。\n闸河水源引用的是白莲潭所贮之水，即“为闸以节高良、白莲潭诸水，以通山东、河北之粟”。引水路线，一条可能是沿古高梁河道，另一条可能是利用白莲潭东闸外的渠道。闸河长五十里，大约设了五、六座闸，原定五日转脚之费，可能是计划每日过一闸，后来因供水不足而慢了一倍。正如泰和八年（1208年）“通州刺史张行信言，‘船自通州入闸，凡十余日方至京师，而官支五日转脚之费。’遂增给之。”\n金闸河从开河到迁都汴京（今开封），仅使用了十年左右时间。但是值得指出其兴建指导思想上，吸取了金口河教训，避免引含沙量高的浑河，并通过建闸节水来减缓坡降、克服水源不足矛盾，这确是北京地区实现漕运的可行经验。元代正是借鉴了这一经验兴建了通惠河并取得巨大成功，一直使用到明清（详第三章）。\n",
    "出处": "蔡蕃.北京古运河与城市供水研究[M].北京：北京出版社,1987.35-36",
    "交通工具": null,
    "交通要道": "高梁河东段南支的利用",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.35,
        39.88
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "元代卢沟桥上下虽不见“渔舟”，但确有浮运木材的“运筏”往来。今存元人所绘《卢沟运筏图》（现存历史博物馆，作者失考。）中清晰可辨（参见图2-13）。图中卢沟桥上游左岸木筏正在下水，桥下游几个“运筏”上有人在用篙撑运。郭守敬至元三年（1266年）“决金口以下西山之木伐，而京师材用是饶”。似是这种形式的水运，不一定是通船。",
    "出处": "蔡蕃.北京古运河与城市供水研究[M].北京：北京出版社,1987.58-59",
    "交通工具": "渔舟",
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.22,
        39.85
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "高梁河东段北支水道，最早可能就是开车箱渠时的下游一条支渠，到金代开始用来通漕运。金代因高梁河水源不大，又支引过多，这条路线并不畅通。元初郭守敬曾引玉泉水济之，后来扩建成著名的坝河，与通惠河并为大都至通州的南北二条重要运道，一直使用到元末。明清北京水源只剩下玉泉一处，无供水坝河的可能，致使这条运河湮废，最后成为东郊的一条排水干河。",
    "出处": "蔡蕃.北京古运河与城市供水研究[M].北京：北京出版社,1987.36-37",
    "交通工具": null,
    "交通要道": "高梁河东段北支的漕运——坝河",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "坝河的水源，与元大都的水源一样，元代在水利专家郭守敬的精心规划设计和努力之下，得到了较好的解决，因而也一直能够发挥重要的漕运作用。元末明初水源枯竭后，坝河的漕运也逐渐废弃了。\n元中统年间，在郭守敬建议下曾导引玉泉济坝河漕运，在以后一段时间里，供水还是有保证的。但是，为什么到了至元十六年要彻底改造坝河，非筑七坝节水不可呢？这与大都城的建设有密切关系。至元十一年至十五年间，宫城及大内建成后，为了保证清洁的供水，专门开辟了玉泉山至大内的金水河。从此，玉泉水首先要保证供应大内，坝河漕运的水量就受到严重影响，得不到保障，只得兴建节水闸坝工程。\n至元三十年（1293年）通惠河竣工，大都水源增加，坝河可以分引一部分白浮瓮山河引来的温榆河上源的泉水。《析津志》记载：“白浮泉源出（昌平）县东神山，流经本县东入双塔河，为通惠、坝河之源”。元代文献中还多处将坝河与通惠河相提并论，可见是同源而分支的两条运河。元末通惠河上源失修，白浮瓮山河逐渐湮废，坝河水源也锐减，加上其他管理上的原因，导致坝河全部废弃。明清北京水源只靠玉泉一处，更无济坝河漕运之可能。这样，这条元代著名的运河，今天完全成了东郊的一条排水干渠。\n最后，还有必要讨论一下元代坝河的供水路线。是由积水潭直接向东，经今北护城河水道至坝河，还是完全绕大都北护城河（今土城外残存水道），再到光熙门入坝河？前者水道如上述金元之际一直用来通漕运，也正是《析津志》记载的高梁河从积水潭“逶迤自东坝流出”的路线。元大都城建成后，这条水道并没有、也无必要填埋，这从《析津志》中记载的这一沿线上有大量桥梁存在得到证明。另外，从考古发掘看，元“京畿漕运使司”位于今雍和宫大街北口，原北城墙豁口处。“京畿漕运使司”（初在河西务，后移到城内），选在这里也正因为乘船至坝河很方便，距漕仓也很近（当时通惠河尚未建）。此外，元大都北部城区一直比较冷落的原因之一，也与这条水道的存在有很大关系。由于水道存在，造成南北交通不便。从元初所立“泄水渠”位置看，这条水道也是元大都城中一条重要东西方向的排水干渠。再从地形上看，今北护城河正位于冲洪积扇脊部，直达光熙门是合理的，而大都土城外的高程已低于光熙门；从那里供给坝河用水是困难的。\n坝河的漕运管理，中统初年，就仿照金代的“河仓规制”，建千斯相应通济万斯等仓，“专用收贮随路僭漕粮斛、祗备应办用度。由大都漕司、劝农司”管理。这时设立漕运所管理漕运。至元四年又设水济、广贮等仓。至元五年改为漕运司，隶都水监。至元十二年改为都漕运司，废都水监。至元十六年大开坝河后，实行水陆并进的办法，设“新运粮提举司”管理陆运站东250辆，隶属于兵部。新开设的运粮坝河隶属于户部管理。至元十九年设“京畿都漕运使司”。其职责，据《大元海运记》记载，“自济东阿为头，并御河上下，直至直沽、河西务、李二寺、通州、坝河等处水陆趱运，接运海道粮斛及各仓收支一切公事，并隶本司管领”。将原定水陆分管的机构统一来，以便于管理。",
    "出处": "蔡蕃.北京古运河与城市供水研究[M].北京：北京出版社,1987.39",
    "交通工具": null,
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.38,
        39.91
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "元初在京城任职的王恽曾经记载一件事情：“窃见中都迤南系四方官员、客旅朝会经行驿程正路，近体知得，良乡县南十三里有旧来经由留里河桥官道，南至涿州六十里，兵革以来，桥废不行。目今靠西由继阳套绕转至涿州七十五里，若经夏秋，河水泛涨，泞泥虚陷，致使铺马、客旅来往生受。兼继阳套地形卑下，村坊远窵，接连沟浍，屡常失盗，深为未便。窃详若依旧起盖留里河桥道，不惟道路髙平径直，使铺马、客旅往返近三十余里，又免水潦泞泥、盗翦之患，官民实为两便。伏乞御史台备呈中书省行下，相视起造施行。”文中的“留里河”今称“琉璃河”，为京南重要驿道，琉璃河桥是驿道上的主要通道，废坏之后，影响很大，只能由政府负责加以修缮。\n为了更有效地保护驿路，元朝政府又命百姓在驿路两旁种植了许多树木，既保护了路基，也为行人提供了乘凉之便。时人作诗描述驿路旁种树的情景称：\n都门辇路花万株，塞垣苦寒多白榆。\n独怜柳枝弱袅袅，春情好写闺中书。诗中所称“辇路”，又往往被称为“御路”，是元朝帝王每年巡幸上都的必经之路，也是最重要的一条驿路，两旁种有“花万株”，可见其盛况。\n著名文士余阙在京城送友人回乡时亦作诗称：\n都门杨柳万丝垂，城下行人驷牡騑。\n宫中近得三年谒，箧里新裁五色衣。\n汉皋秋晚游娼少，梦渚波寒猎火微。\n我有愁心似征雁，随君日日向南飞。所谓“都门杨柳万丝垂”，是指驿路两旁种有许多柳树。诗人傅若金也作有《彰义门柳》一诗曰：“送客都门见柳行，几回扳折断愁肠。如今自向城西别，无那柔条拂马长。”彰义门是大都旧城的城门，也是人们出京南下的必经之门，驿路两旁也都植有柳树。\n",
    "出处": "张艳丽.北京城市生活史[M].人民出版社,2016.120-121",
    "交通工具": null,
    "交通要道": "文中的“留里河”今称“琉璃河”，为京南重要驿道，琉璃河桥是驿道上的主\n要通道",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.35,
        39.88
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "枢密院角市的形成与城市的对外交通直接相关。如前文已分析过的，在大都城东部，陆路沿东华门、齐化门、通州一线，是大都重要的对外交通线，同时此处也正在文明门大街与齐化门大街的交汇点上，是形成市场的良好地点。",
    "出处": "诸葛净.辽金元时期北京城市研究[M].南京：东南大学出版社,2016.108",
    "交通工具": null,
    "交通要道": "在大都城东部，陆路沿东华门、齐化门、通州一线，是大都重要的对外交通线，同时此处也正在文明门大街与齐化门大街的交汇点上，是形成市场的良好地点。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "元世祖统一中国，在金中都的东北郊以金室离宫大宁宫为中心，规划建设了新的都城，是为元大都。元大都的城市功能和城市规模、人口规模远过辽南京和金中都，因此，元大都更加仰赖江南米粮和全国财赋的供应，元代漕运空前发展。\n元代的漕运，分海运与河运两途。初以海运为主，兼以河运。通惠河开通后，则以河运为主，兼有海运。甚至在局部地段，还曾辅以陆路转运。\n实行海运，伯颜首倡。伯颜平江南时，曾命张瑄、朱清等人把南宋库藏图书，自崇明州从海道运往大都。至元十九年（1282年），伯颜想起这件事，认为海运可行，于是奏请朝廷，命上海总管罗璧、朱清、张瑄等造平底海船60艘，运粮46，000余石，由海路运往京师。起初海运之道，“自平江（元平江路治吴县，今苏州_作者）刘家港入海，经扬州路通州（今南通）海门县黄连沙头、万里长滩开洋，沿山㠗而行，抵淮安路盐城县，历西海州、海宁府东海县、密州、胶州界，放灵山洋投东北，路多浅沙，行月馀始抵成山。计其水程，上海至杨村码头，凡一万三千三百五十里。”至元二十九年（1292年），朱清等言其路险恶，复开生道，“自刘家港开洋，至撑脚沙转沙觜，至三沙、洋子江，过匾担沙、大洪，又过万里长滩，放大洋至青水洋，又经黑水洋至成山，过刘岛，至芝罘、沙门二岛，放莱州大洋，抵界河口，其道差为径直。”明年（1293年），千户殷明略又开新道，“从刘家港入海，至崇明州三沙放洋，向东行，入黑水大洋，取成山转西至刘家岛，又至登州沙门岛，于莱州大洋入界河。当舟行风信有时，自浙西至京师，不过旬日而已，视前二道最为便云”。虽然海运比河漕节省费用，但因风险很大，船漂人溺、浪吞粮弃的事故，时有发生。\n元代的河漕先行于海运。起初，“运粮则自浙西涉江入淮，由黄河（自开封向东流，经今商邱南、徐州北，东南至淮安，转向东北入海_作者）逆水至中滦站（在开封西北黄河北岸），陆运至淇门（淇水入卫河处，在今河南淇县东南、滑县西南_作者），入御河（即卫河），以达于京”。至元二十年（1283年），新开济州河成，河运漕船不必再溯黄河水向西远至中滦站，可由徐州向西北，经济州（治任城，今山东济宁市）而至安山，然后进入大清河（今山东境内黄河河道），经利津入海，北至直沽，再逆白河水而上，到达通州。同时，还开凿胶莱运河，以省海运绕道山东半岛成山头之远途，并一度发挥重要作用，但后来废弃。济州河开通后，曾命三省造船三千艘，专于济州河运粮。但因大清河海口沙壅严重，候潮以入，船多损坏，民亦苦之，遂改由旱路从东阿转运至临清，再由临清循御河水运而下。至元二十六年（1289年），征调三万馀丁夫，动用一百五十万缗楮币、四万石米、五万斤盐，在南起须城（今山东东平）安山西南，北至临清御河间，开凿一条长达250余里、设置31座水闸的运河，名为会通河。会通河开成后，河运漕船由江南可直接驶入御河，并抵达通州。\n通州至大都尚有50里路程。南方漕粮运抵通州后，每年有若干万石需经陆路车载驴驮地转运入京城。无雨季节路较通畅，夏秋霖雨，满路泥泞，民夫不胜其苦。至元二十八年（1291年），都水监郭守敬奉诏兴举水利，因建言：“疏浚通州至大都河，改引浑水溉田，于旧闸河踪迹导清水，上自昌平县白浮村引神山泉，西折南转，过双塔、榆河、一亩、玉泉诸水，至西水门入都城，南汇为积水潭，东南出文明门，东至通州高丽庄入白河。总长一百六十四里一百四步。塞清水口一十二处，共长三百一十步。坝闸一十处，共二十座，节水以通漕运，诚为便益。”对于郭守敬的高见良策，元世祖极为赞赏地说：“当速行之。”于是，复立都水监，使郭守敬领之。又“命丞相以下皆亲操畚锸倡工，待守敬指授而后行事”。工程始工于至元二十九年（1292年）春，告竣于三十年（1293年）秋，投入工程的军士、工匠、水手、没官囚隶等共20，162人，总计2，850，000工，耗费楮币1，520，000锭，用粮38，700，木石等料无算。当元世祖从上都回到大都时，见积水潭内“舳舻蔽水”，极为兴奋，遂命名为通惠河，并重奖郭守敬。通惠河的开凿，在北京水利和水路交通史上具有极其重要的意义。首先，大大开拓了元大都的水源，把昌平白浮泉及其西山沿麓之水汇集导流入瓮山泊（今昆明湖的前身），这一引水工程称白浮堰。郭守敬创造的这一水利工程，把元大都的水源开拓到昌平西部，使通惠河漕运水量更得保障。其次，标志着京杭大运河的最终完成。通惠河使京杭大运河的北端由原来的通州潮白河岸畔延伸入大都城内积水潭，使大都城有了通畅的水路进出通道，漕船可以直接驶入大都城内积水潭。因此，就无需由通州向大都陆路转运漕粮了。通惠河漕运全赖坝闸调节水量，漕船到来时，提闸放水；漕船通过后，落闸蓄水。通惠河上的坝闸，共有11处24座，分别是：广源闸2，在护国仁王寺西。西城闸2，上闸在和义门（明改西直门）外西北1里，下闸在和义水门西3步。朝宗闸2，上闸在万亿库南百步，下闸去上闸百步。海子闸3，在都城内。文明闸2，上闸在丽正门外水门东南，下闸在文明门西南1里。魏村闸2，上闸在文明门东南1里，下闸西至上闸1里。籍东闸2，在都城东南王家庄。郊亭闸3，在都城东南25里银王庄。杨尹闸2，在都城东南30里。通州闸2，上闸在通州西门外，下闸在通州南门外。河门闸2，在通州南高丽庄。至成宗元贞元年（1295年），西城闸改名会川，海子闸改名澄清，魏村闸改名惠和，籍东闸改名庆丰，郊亭闸改名平津，杨尹闸改名溥济，通州闸改名通流，河门闸改名广利。后于至大四年（1311年）至泰定四年（1327年）间，渐次将原立木闸改用砖石重建，以图永固。（附图：白浮堰与通惠河略图）\n在通惠河开通之前，坝河是最重要的一条漕道。坝河又称阜通七坝，原是高梁河下游东趋的一派，至通州北注入温榆河。早在元世祖中统年间，郭守敬即请开玉泉水以通漕运，那时的漕运水道就是坝河。至元十六年（1279年）曾大规模疏治坝河，始置新运粮提举司，管理坝河漕运。当时，设坝夫户8377，车户5070，出车390辆；船户950，出船190艘。可见，当时的漕运还是颇具规模的。至元二十八年（1291年）底，又“浚运粮坝河，筑堤防”。通惠河开通后，坝河漕运不辍，故仍积极治理。例如，大德六年（1302年）五六月间，对坝河河堤浅涩低薄之处加以修治。其中，深沟坝9处，王村坝2处，郑村坝1处，西阳坝3处，郭村坝3处，千斯坝1处，共用工30，240。\n元顺帝至正二年（1342年），曾有再开金口河之举。按金口河初创于金，无效而罢。至元二年（1265年），郭守敬建言：“金时，自燕京之西麻峪村，分引卢沟一支东流，穿西山而出，是谓金口。其水自金口以东、燕京以北，灌田若干顷，其利不可胜计。兵兴以来，典守者惧有所失，因以大石塞之。今若按视故迹，使水得通流，上可以致西山之利，下可以广京畿之漕”。于是，重开金口河，以运西山木石，供给营建大都所需物料。为防洪患，在工程技术上采取了必要措施，即于金口以上向西南开凿一条深而广的分洪沟渠。这次重开金口河，收到较好的效益。大德二年（1298年），浑河水发为民害，遂落闸将金口堵闭。五年（1301年），浑河又水势浩大，郭守敬怕洪水冲没田、薛二村，南、北二城，又将金口以上河身用沙石杂土尽行堵闭。待到至正初，中书参议孛罗帖木儿和都水傅佐建言“起自通州南高丽庄，直至西山石峡铁板开水古金口120馀里，创开新河一道，深5丈，广15丈，放西山金口水东流至高丽庄，合御河，接引海运至大都城内输纳”时，却遭到以左丞许有壬为代表的廷臣的广泛反对。唯因丞相脱脱力排群议，务于必行，遂于至正二年正月兴工，四月功毕。等到起闸放金口之水时，因流湍势急，沙泥壅塞，船不可行，劳民伤财。又开挑之际，毁民庐舍坟莹，夫丁死伤甚众，惹起民愤。因此，御史纠劾建言者，孛罗帖木儿、傅佐皆获罪被诛。这一事例再次说明，卢沟河在水路交通上是没有多少价值的。至元二十八年（1291年），有人说滦河自永平至开平可挽舟逾山而上，卢沟河自麻峪上至寻麻林也可行舟。朝廷派遣郭守敬前往察勘后，证实“滦河既不可行，卢沟舟亦不通”。当然，藉以漂运木筏还是可以的，著名的元代“卢沟运筏图”反映的便是这种情况。\n元代漕运，海运与河运并举，每年运粮三四百万石左右，最多达五百万石。掌管漕运的衙门，初为军储所，寻改漕运所；至元五年（1268年），改漕运司；十二年（1275年），又改都漕运司；十九年（1282年），再改京畿都漕运使司；二十四年（1287年），始有京畿都漕运司和济宁都漕运司分掌漕事。其海运，又有海道运粮万户府主管，该府于至元二十年（1283年）置，掌每岁海道运粮供给大都。初运仅数万石，后不断增加，至泰定、天历年间，每年海运粮都在三百万石以上。其河运，又有都漕运使司，总司在河西务，分司在临清，掌御河上下至直沽、河西务、李二寺、通州等处漕运及漕粮管理；新运粮提举司，掌坝河漕运；通惠河运粮千户所，掌通惠河漕运事。河运自冰开发运，至河冻时止，每年约运240天。所用船定制为150料。每30只船编为1纲，每纲设押纲官2员。共30纲，曰济源、曰陵州、曰献州、曰白马、曰滏阳、曰完州、曰河内、曰南宫、曰沂莒、曰霸州、曰东明、曰获嘉、曰盐山、曰武强、曰胶水、曰东昌、曰武安、曰汝宁、曰修武、曰安阳、曰开封、曰仪封、曰蒲台、曰邹平、曰中牟、曰胶西、曰卫辉、曰浚州、曰曹濮州、曰荥阳，总计900馀只船，船户8，000馀，年运量二三百万石。\n元代京师先后设有22仓。中统二年（1261年）设万斯北仓、千斯仓、相因仓、通济仓；至元四年（1267年）设永济仓、广储仓；十六年（1279年）设永平仓、丰润仓；二十四年（1287年）设万斯南仓；二十六年（1289年）设既积仓、盈衍仓；二十八年（1291年）设大积仓；二十九年（1292年）设广衍仓、顺济仓；皇庆元年（1312年）设惟亿仓、既盈仓、大有仓、屡丰仓、积贮仓、丰穰仓、广济仓；另有丰实仓，未详设置之年。在通州则设有有年、富有、广储、盈止、及秭、乃积、乐岁、庆丰、延丰、足食、富储、富衍、及衍等13仓。此外，在河西务等地还建有一些仓。这些仓库都是贮存漕粮，以备支用的。\n总之，元大都的水路交通获得极大发展。因此，元代的海运与河漕规模远过前代。京杭大运河及其漕运成为元大都的生命线。\n",
    "出处": "侯仁之.北京城市历史地理[M].北京：北京燕山出版社,2000.405-412",
    "交通工具": null,
    "交通要道": "元大都的漕渠和漕运",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.92
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "元大都时期，水路方面，无论是走运河还是海路，都是先到通州，然后既可从北面坝河入都，亦可由南水门入，终点都是皇城以北的海子，从坝河走的以漕粮为主，而多数商旅客贩则是从南入城北上至海子，经由京杭运河的水路是从南方入京的主要途径。",
    "出处": "诸葛净.辽金元时期北京城市研究[M].南京：东南大学出版社,2016.108",
    "交通工具": null,
    "交通要道": "先到通州，然后既可从北面坝河入都，亦可由南水门入，终点都是皇城以北的海子，从坝河走的以漕粮为主",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "元世祖忽必烈于中统初年建都燕京，为解决中都至通州的漕运，仿照金代制度在旧漕河旁设立粮仓。据王恽记载：“中统元年冬十月，创建葫芦套省仓落成，号曰千斯。时大都（指燕京）漕司、劝农等仓，岁供营帐工匠月支口粮，此则专用收贮随路僭漕粮斛，只备应办用度，及勘会亡金通州河仓规制。自是漕船入都……”。中统二年又兴建了相应仓、通济仓、万斯北仓等漕仓。经过中统元年争夺皇位的战争，忽必烈深知燕京漕运的重要作用。但是发展漕运，首先会遇到水源困难的问题，因此有“中统三年（1262年）八月，郭守敬请开玉泉水以通漕运”的建议，并立即得到元世祖的批准。\n郭守敬在张文谦推荐下，在上都向忽必烈面陈水利六事，第一件就是引玉泉水济运的计划。他的建议是：“中都旧漕河东至通州，权以玉泉水引入行舟，岁可省僦车费六万缗。”“中都旧漕河”，即指金代所开的漕河，当时既然建议引水济运，证明当时运河还是存在的，只因水源缺乏，或通或塞，但仍在使用。过去许多人以为这次是引玉泉水入金闸河故道，是没有根据的。因为金闸河湮塞至开凿通惠河的八十年中，未见通漕运记载；相反，如果是这次引水入闸河，必需修复闸坝工程，才能“节水行舟”，那么仅隔三十年后不湮废得一点影子都没有，致使开通惠河时偶然发现闸河的旧砖木，还会令人惊讶，使人叹服郭守敬的高明。再从元初漕运情况看，也一直是走坝河水道。问题是元世祖批准了这项建议后，是否执行了呢？《元史》中无明文记载。查元人阎复《静轩集》记载，中统年间，召宁玉“充河道官，疏浚玉泉河渠。”宁玉又是何许人？该文记载，“宁玉年十七，以鼓枻之勇，为水军万户张侯所知，署盟津渡长。鄂渚之役，大军驻南阳，遣公（宁玉）督漕宿亳，军食以济。”后来于至元三年，又在河南邓州一带“由新野而南以通转漕。”总之，可以看出宁玉是一位在漕运上颇有经验的官员。中统年间派他疏浚玉泉河渠，只能是以通漕为目的，因为当时大都城未建，金水河未开，在那样百废待兴的时代，引水不可能有别的解释。另外，从时间上看，也与郭守敬建议时间相符。\n至元二年（1265年）春，为修建中都，“敕徙镇海、百八里、谦谦州诸色匠户于中都，给银万五千两为行费。又徙奴怀、忒木带儿炮手、人匠八百名赴中都造船运粮。”这也与发展中都漕运有密切关系。\n从中统到至元初年，在中都附近，先后修建七座漕仓，从侧面反映出郭守敬引水济运的结果，无疑是促进了中都的漕运发展。\n",
    "出处": "蔡蕃.北京古运河与城市供水研究[M].北京：北京出版社,1987.37-39",
    "交通工具": null,
    "交通要道": "元初引玉泉水济运",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.92
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "元世祖忽必烈于中统初年建都燕京，为解决中都至通州的漕运，仿照金代制度在旧漕河旁设立粮仓。据王恽记载：“中统元年冬十月，创建葫芦套省仓落成，号曰千斯。时大都（指燕京）漕司、劝农等仓，岁供营帐工匠月支口粮，此则专用收贮随路僭漕粮斛，只备应办用度，及勘会亡金通州河仓规制。自是漕船入都……”。中统二年又兴建了相应仓、通济仓、万斯北仓等漕仓。经过中统元年争夺皇位的战争，忽必烈深知燕京漕运的重要作用。但是发展漕运，首先会遇到水源困难的问题，因此有“中统三年（1262年）八月，郭守敬请开玉泉水以通漕运”的建议，并立即得到元世祖的批准。\n郭守敬在张文谦推荐下，在上都向忽必烈面陈水利六事，第一件就是引玉泉水济运的计划。他的建议是：“中都旧漕河东至通州，权以玉泉水引入行舟，岁可省僦车费六万缗。”“中都旧漕河”，即指金代所开的漕河，当时既然建议引水济运，证明当时运河还是存在的，只因水源缺乏，或通或塞，但仍在使用。过去许多人以为这次是引玉泉水入金闸河故道，是没有根据的。因为金闸河湮塞至开凿通惠河的八十年中，未见通漕运记载；相反，如果是这次引水入闸河，必需修复闸坝工程，才能“节水行舟”，那么仅隔三十年后不湮废得一点影子都没有，致使开通惠河时偶然发现闸河的旧砖木，还会令人惊讶，使人叹服郭守敬的高明。再从元初漕运情况看，也一直是走坝河水道。问题是元世祖批准了这项建议后，是否执行了呢？《元史》中无明文记载。查元人阎复《静轩集》记载，中统年间，召宁玉“充河道官，疏浚玉泉河渠。”宁玉又是何许人？该文记载，“宁玉年十七，以鼓枻之勇，为水军万户张侯所知，署盟津渡长。鄂渚之役，大军驻南阳，遣公（宁玉）督漕宿亳，军食以济。”后来于至元三年，又在河南邓州一带“由新野而南以通转漕。”总之，可以看出宁玉是一位在漕运上颇有经验的官员。中统年间派他疏浚玉泉河渠，只能是以通漕为目的，因为当时大都城未建，金水河未开，在那样百废待兴的时代，引水不可能有别的解释。另外，从时间上看，也与郭守敬建议时间相符。\n至元二年（1265年）春，为修建中都，“敕徙镇海、百八里、谦谦州诸色匠户于中都，给银万五千两为行费。又徙奴怀、忒木带儿炮手、人匠八百名赴中都造船运粮。”这也与发展中都漕运有密切关系。\n从中统到至元初年，在中都附近，先后修建七座漕仓，从侧面反映出郭守敬引水济运的结果，无疑是促进了中都的漕运发展。\n",
    "出处": "蔡蕃.北京古运河与城市供水研究[M].北京：北京出版社,1987.37-39",
    "交通工具": null,
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.92
      ]
    ]
  },
  {
    "时期": "元",
    "原文": "忽必烈受命经略漠南汉地军国庶事之后5年，岁丙辰（1256年）三月，命僧子聪卜地于桓州东、滦水北，城开平府，经营宫室。庚申（1260年），忽必烈登基，建元中统。中统四年（1263年）五月，升开平府为上都（故址在今内蒙古正蓝旗东闪电河北岸）。至元四年（1267年），于故金中都城（燕京）东北郊新建中都城。八年（1271年），建国号为元。九年（1272年），改中都名大都。终元一代，实行两都制。皇帝夏赴上都避暑，秋回大都过冬。因此，元代大都与上都之间的道路是极为重要的。\n元大都与上都之间的道路，分东路和西路。东路较为简单，西路又歧分3条。此外，在东、西路之间，还有一条专供传递紧急军情的捷径，可称四海冶路。（附图：元大都与上都间主要道路略图）\n东路：由大都向东北，经顺州（今顺义）、檀州（今密云），出古北口，奔兴州（今河北滦平县兴州），再经今河北丰宁满族自治县东境北趋，转西而至上都。中统四年（1263年），“敕京师顺州至开平置六驿”，就是在这条道路上设置的驿站。至元二十年（1283年）十月，“车驾由古北口路至自上都”；致和元年（1328年）九月，因元朝皇室发生一场争位夺权的内讧，“上都兵入古北口”，掠石槽（在今顺义西北），被掌大都枢密符印的太平王燕帖木儿遣兵击退。所经行的都是东路。\n西路：由大都向西北，经清河、榆河、新店（元昌平县曾治此）、龙虎台，出居庸关。一路向西，经榆林、怀来（旧城）、狼山、统幕（土木），至此路又分两股：一股继续向西北，经鸡鸣驿、宣德府（今宣化），出今张家口，至兴和路（今张北），转向东北至大都。这一股是西路的西路。至元二十五年（1288年）三月，元世祖幸上都。秋八月返还，“庚辰（二十八日），车驾次孛罗海脑儿”；九月癸未朔（初一日）,“大驾次野狐岭（在张家口北）”；壬辰（初十日），“大驾至大都”。显然，这次走的就是西路的西路。另一股由土木向北，经洪赞、刁窝、赤城、云州，出独石口，北去大都，这一股又称驿路。至元十六年（1279年）六月，“榆林、洪赞、刁窝，每驿益马百五十、车二百，牛如车数给之”。所指就是这条驿路上的几个驿站。一路由八达岭南三堡向北，经今延庆县小张家口、红门、沈家营、大柏老、旧县（元缙山县）、车坊、黑峪口、白河堡等地，又经赤城县的长伸地、龙门所，向东过长城，再沿着黑河上游谷地而至大都。因这一条路经过缙山县，故称缙山道；又过黑峪口，亦称黑峪道，又称色泽岭（今延庆县东北佛爷顶）道。至元十九年（1282年）七月，“发察罕脑儿军千人治缙山道”。元统二年（1334年）四月，“罢龙庆州黑峪道上胜火儿站”。泰定帝三年（1326）七月，“发兵修野狐、色泽、桑乾三岭道”。这里的缙山道、黑峪道、色泽岭道，所指就是由居庸关向北通大都的路。元代皇帝的车辇经常通过这条路，故也称辇路。为了安全起见，元廷特派一批侍卫军沿途布防护守。至元十八年（1281年）闰八月，“敕守缙山道侍卫军还京师”，足以为证。\n在这里需要补充说明的是，在大都与上都间往来的西路上，有几处地方颇为有名，值得注意。一是大口，二是龙虎台，三是香水园。\n大口，《元史》中多见记载。例如：太祖成吉思汗八年（1213年）秋天，分兵三道，攻掠太行山东西的金朝诸多州县，今山西、河北、山东广大地区，皆惨遭蒙古骑兵铁蹄的蹂躏。三路蒙古大军破城掠地、烧杀抢劫一番之后，“帝至中都，三道兵还，合屯大口。”至顺元年（1330年）五月，“车驾发大都，次大口”。至和元年（1328）九月，上都诸王梁王王禅兵袭破居庸关，“游兵至大口”。顾祖禹云：“所谓大口皆天津口也”。按顾氏之说误，天津口即天津关，在今门头沟区西端黄草梁下，而大口显然在大都城北。《昌平州志》云“大口故城在州东南五十里”，又“大口村在州东南五十五里”。按大口故城即《元史》中之大口，大口村无疑因大口故城而得名，其地望当在清河附近。今清河东北不远有东小口、西小口地名，显然是与大口相对而称的。\n龙虎台，今为村名，在昌平西北约7公里，西距南口镇约1公里。元代在这里建有行宫，故元帝往来于大都、上都时，常驻跸于此。例如至元十九年（1282年）八月，“大驾驻跸龙虎台”。二十七年（1290年）地震，“帝驻跸龙虎台，召集贤翰林两院官，询致灾之由”。“文宗尝驻跸龙虎台，（马）祖常应制赋诗，尤被叹赏，谓中原硕儒惟祖常云”。“顺帝元统初，（陈）颢扈跸行幸上都，至龙虎台，帝命造膝前而握其手曰：‘卿累朝老臣，更事多矣，凡议政事，宜极言无隐。’颢顿首谢不敏”。直到明代前期，龙虎台仍是皇帝进出居庸关时的驻跸之所。\n香水园，元代著名行宫，在缙山县内。仁宗皇庆元年（1312年）五月，“缙山县行宫建凉殿”。这里的缙山县行宫，就是香水园。天历二年（1329年）五月，元文宗北迎明宗皇帝，丁丑（二十一日），“帝发京师”，“戊寅（二十二日），次于大口”，“庚辰（二十四日），次香水园”。至元二十二年（1285）三月丙子，“元仁宗诞生于香水园”。因此，至仁宗延佑三年（1316年），决定“改缙山县为龙庆州，帝生是县，特命改焉”。《清一统志》称，香水园在延庆州东北。\n在上述东、西路之外，还有一条四海冶路。《读史方舆纪要》云：“四海冶堡，（永宁）县东百里。元时往来上都，恒取道于此”。可见这条路也是很重要的。四海冶在今延庆县东境。度其山川形势，由大都取道于此而去上都的路，当出大都安贞门，直北经小汤山、上庄、黄花城，至四海冶，然后经珍珠泉、北小川，转西北行，过白河，再沿黑河河谷而上，便与缙山道（黑峪道）北段相接了。明嘉靖中边臣许论所谓四海冶“上通开平大道”，正在于此。这条四海冶道几乎直南直北，最为近捷。但多山路，马可行，车难通，故元帝往来于两都绝少走这条路，而传送紧急公文军情，取道四海冶是最节省时间的。\n上述由大都往上都的陆路交通，或东北行出古北口，或西北行出居庸关，或直北行奔四海冶，堪称发达便利。至于由大都往东、往南、往西南的道路，承继前代，也通畅无阻。\n往东，40里至通州，又60里至夏店，又120里至蓟州，再前行，一路正东至遵化，转东北至北京（金北京大定府，元初改置北京路总管府，至元七年又改为大宁路，即今内蒙古自治区宁城县西大明城）；一路东南至玉田，又东北行至永平，再分赴各地。这仍是燕山南麓古道。但从大都齐化门至通州的40里路，因需转运大批漕粮而变得更为重要起来。泰定三年（1326年）十月，“发卒四千治通州道，给钞千六百锭”。顺帝至元二年（1336年）八月，“大都至通州霖雨，大水，敕军人修道”。就反映了这一事实。\n往南和西南，70里良乡，又60里涿州，至此分二路：一路正南70里新城，正南微东70里雄州，又60里任邱，又60里河间，又60里献州，又70里阜城，又80里景州，又60里陵州，至此分三路：一路东南由平原渡河至徐州，一路正东偏南至益都，一路正南偏西由东昌至归德，然后再分别继续前行或分道。另一路向西南，又70里定兴，又60里见白塔，又65里保定，至此分为二路：一路西南行90里由庆都至真定，一路正南行由蠡州至大名，然后由真定、大名再分赴各地。其中，往西南的路仍是太行山东麓大道。\n",
    "出处": "侯仁之.北京城市历史地理[M].北京：北京燕山出版社,2000.362-367",
    "交通工具": null,
    "交通要道": "元大都与上都之间的道路，分东路和西路。东路较为简单，西路又歧分3条。此外，在东、西路之间，还有一条专供传递紧急军情的捷径，可称四海冶路。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.92
      ]
    ]
  },
  {
    "时期": "北宋",
    "原文": "胡峤所行居庸关道，较之王曾与路振所行古北口道更为遥远，向西绕行了很远才至辽上京。而在沈括《熙宁使虏图抄》中说：“自幽州由歧路出松亭关，走中京五百里。循路稍有聚落，乃狄人常由之道，今驿回屈几千里，不欲使人出夷路，又以示疆域之险远。”这条道路按《武经总要》载松亭关条：\n松亭关，关东北五里至滦河关城，自幽州东趋营平路，甚平坦，自古匈奴犯边，多由此路。幽州东北四百八十里，北趋泽州路，至中京四百五十里，西至平川蓟州，有柜安、燕氐二山口，通车马。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.74",
    "交通工具": null,
    "交通要道": "自幽州由歧路出松亭关，走中京五百里",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.07,
        40.29
      ]
    ]
  },
  {
    "时期": "北宋",
    "原文": "熙宁八年（1075）沈括出使辽国。因其国君驻永安山（今内蒙古巴林右旗西北瓦尔漫汗山），沈括由中京至永安山附近的犊儿山（今奥兰哈达山）报聘。沈括记载：“大（永）安山，契丹之北部，东南距京师驿道三千二百十有五里。自庆州，上京皆有便道。”沈括至中京的路线与王曾、路振相仿佛，从中京行至上京，再继续北行永安山。\n从居庸关出塞通辽的道路，见于五代后晋胡峤《陷辽记》：\n初，萧翰闻（耶律）德光死，北归，有同州郃阳县令胡峤为翰掌书记，随入契丹。而翰妻争妒，告翰谋反，翰见杀，峤无所依，居虏中七年。当周广顺三年，亡归中国，略能道其所见。云：“自幽州西北入居庸关。明日，又西北入石门关。关路崖狭，一夫可以当百，此中国控扼契丹之险也。又三日，至可汗州。南望五台山，其一峰最高者，东台也。又三日，至新武州。西北行五十里有鸡鸣山，云唐太宗北伐闻鸡鸣于此，因之名山。明日，入永定关，此唐故关也。又四日，至归化州。又三日，登天岭。岭东西连亘，有路北下。四顾冥然，黄云白草，不可穷极”。契丹谓峤曰：“此辞乡岭也，可一南望而为永诀。”同行者皆恸哭，往往绝而复苏。又行三四日，至黑榆林。时七月，寒如深冬。又明日，入斜谷，谷长五十里，高崖峻谷，仰不见日，而寒尤甚。已出谷，得平地，气稍温。又行二日，渡湟水。又明日，渡黑水。又二日，至汤城淀，地气最温，契丹若大寒，则就温于此。……又二日，至仪坤州，渡麝香河。自幽州至此无里候，其所向不知为南北。又二日，至赤崖，翰与兀欲相及，遂及述律战于沙河。述律兵败而北，兀欲追至独树渡，遂囚述律于扑马山。又行三日、遂至上京，所谓西楼也。西楼有邑屋市肆，交易无钱而用布。有绫锦诸工作、宦者、翰林、伎术、教坊、角抵、秀才、僧、尼、道士等，皆中国人，而并、汾、幽、蓟之人尤多。自上京东去四十里，至真珠寨，始食菜。明日，东行，地势渐高，西望平地松林郁然数十里。遂入平川，多草木，始食西瓜，云契丹破回纥得此种，以牛粪覆棚而种，大如中国冬瓜而味甘。又东行，至褭潭，始有柳，而水草丰美，有息鸡草尤美，而本大，马食不过十本而饱。自褭潭入大山，行十余日而出，过一大林，长二三里，皆芜荑，枝叶有芒刺如箭羽，其地皆无草。兀欲时卓帐于此，会诸部人葬德光。自此西南行，日六十里，行七日，至大山门，两高山相去一里，而长松丰草，珍禽野卉，有屋室碑石，曰：“陵所也。”兀欲入祭，诸部大人惟执祭器者得入。入而门阖。明日开门，曰“抛盏”，礼毕。问其礼，皆秘不肯言。已而，翰得罪被锁，峤与部曲东之福州。福州，翰所治也。峤等东行，过一山，名十三山，云此西南去幽州二千里。又东行，数日，过卫州，有居人三十余家，盖契丹所虏中国卫州人，筑城而居之。峤至福州，而契丹多怜峤，教其逃归，峤因得其诸国种类远近。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.73-74",
    "交通工具": null,
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.07,
        40.29
      ]
    ]
  },
  {
    "时期": "北宋",
    "原文": "据北宋使者所记，辽南京通中京、上京道，一是从古北口出塞，一是从居庸关出塞。\n北宋大中祥符五年（1012），王曾奉命出使契丹。他从宋朝边境雄州先到辽南京，再从南京出古北口至辽中京。《上契丹事》记其行程：\n自雄州白沟驿渡河，四十里至新城县，古督亢亭之地。又七十里至涿州。北渡范水、刘李河，六十里至良乡县。渡卢沟河，六十里至幽州，号燕京。\n出燕京北门，至望京馆。五十里至顺州。七十里至檀州，渐入山。五十里至金沟馆。将至馆，川原平旷，谓之金沟淀。自此入山，诘曲登陟，无复里堠，但以马行记日，约其里数。九十里至古北口，两傍峻崖，仅容车轨。又度德胜岭，盘道数层，俗名思乡岭，八十里至新馆。过雕窠岭、偏枪岭，四十里至卧如来馆。过乌滦河，东有滦州，又过摸斗岭，一名渡云岭、芹菜岭，七十里至柳河馆。松亭岭甚险峻，七十里至打造部落馆。东南（北）行五十里至牛山馆。八十里至鹿儿峡馆。过虾蟆岭，九十里至铁浆馆。过石子岭，自此渐出山，七十里至富谷馆。八十里至通天馆。二十里至中京大定府。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.71-72",
    "交通工具": null,
    "交通要道": "辽南京通中京、上京道，一是从古北口出塞，一是从居庸关出塞。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.92
      ]
    ]
  },
  {
    "时期": "北朝",
    "原文": "在北朝时期，由辽东发迹的鲜卑更是依赖幽州这一战略位置，以其为据点南进中原。由幽州通往华北平原的大道因其政治、军事作用而愈发重要。建兴二年（314），后赵石勒定都襄国（今河北邢台），从襄国出兵袭击西晋幽州牧王浚。他亲帅大军从襄国出发，在柏人（今河北内丘）渡易水，过范阳（今河北涿州），清晨抵达蓟城城下，以致王浚措手不及，兵败被擒。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.36-37",
    "交通工具": null,
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.38,
        39.95
      ]
    ]
  },
  {
    "时期": "周",
    "原文": "随着周武王封召公奭于燕，北京与其他地域的联系得到空前发展。西周后期，强盛的燕国吞并了蓟国。《史记正义》载：“蓟微燕盛，乃并蓟居之，蓟名遂绝焉。””乃并蓟居之”，就是燕国将都城迁徙到了蓟。同时，燕国向冀北、辽西扩张，北京及周边的方国部族如孤竹、令支、无终，或臣服于燕，或为燕所灭，相继纳入燕国的封域。北京昌平白浮村西周墓、延庆西拨子村考古遗存中，出土了大量青铜礼器、兵器、车马器、陶器、玉器、象牙器及有字卜甲等，显示出北方草原文化的影响。作为周王朝在北方的重要封国，燕国的不断开拓增强了自身的影响力，与周边的联系和往来愈加频繁，与王朝中心之地的联系也不可缺少。燕侯定期前往国都镐京（今陕西西安市西）朝觐纳贡，周王则遣使往来燕地，蓟城通往镐京的道路应当颇为通畅。房山区琉璃河镇董家林村一带的西周燕都遗址发掘出了驷马马车，亦可说明当时的道路已比较宽阔。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.16",
    "交通工具": "马车",
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.38,
        39.95
      ]
    ]
  },
  {
    "时期": "咸丰年间",
    "原文": "咸丰年间震钧著《天咫偶闻》，也提到此河与辽萧太后修南京城（又名萧太后城）有关。今人推测，萧太后河是从辽南京城东南的迎春门南下，经今陶然亭湖一带水泊东行至今龙潭湖，出左安门向东南方向经十里河、老君堂、马家湾、高力庄，在通州张家湾入北运河。该河河床均宽31米，底均宽8米，两岸及河底均为黄粘土筑成，坚固无比，在民间有“铜帮铁底运粮河”之称，应当是一条重要的漕粮运河。综合以上描述可知：辽南京的漕运物资从蓟运河口登陆后，沿蓟运河西入泃河或北运河，从水陆两途运抵南京。萧太后河的出现，是历史上的北京城挖掘人工河道以沟通北运河的开端。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.79-80",
    "交通工具": null,
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "唐",
    "原文": "由蓟州向东南经玉田县（今县）至平州石城县（隋、唐初临渝县）、平州治所卢龙县（今县），东行过临渝关，向东北前行，沿白狼水河谷至营州治所柳城郡（今辽宁朝阳）。《新唐书》平州北平郡条其略为：\n平州北平郡，初治临渝，武德元年徙治卢龙。县三。有府一，曰卢龙。有卢龙军，天宝二载置。又有柳城军，永泰元年置。有温沟、白望、西硖石、东硖石、绿畴、米砖、长杨、黄花、紫蒙、白狼、昌黎、辽西等十二戍，爱川、周夔二镇城。东北有明垤关、鹘湖城、牛毛城。卢龙，本肥如，武德二年更名。石城，本临渝，武德七年省，贞观十五年复置，万岁通天二年更名。有临渝关，一名临闾关。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.55",
    "交通工具": null,
    "交通要道": "幽州通柳城郡及奚、契丹辽东道",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.91
      ]
    ]
  },
  {
    "时期": "唐",
    "原文": "《旧唐书·李忠臣传》：“及禄山反，与其伦辈密议，杀伪节度吕知诲，立刘正臣为节度，以忠臣为兵马使。攻长杨，战独山，袭榆关、北平。”\n幽州经临渝关道至营州柳城郡后，可分为通东北蕃族与辽东两条主干道。隋唐东北有契丹、奚、霫、室韦、靺鞨（黑水靺鞨）、渤海靺鞨以及乌罗浑等族，辽东则有高丽、新罗、百济三国。离唐边境近者为契丹与奚，其次为室韦与霫，靺鞨与乌罗浑国则更远。据《旧唐书》载诸族与唐界限：\n契丹，居潢水之南，黄龙之北，鲜卑之故地，在京城东北五千三百里。东与高丽邻，西与奚国接，南至营州，北至室韦。冷陉山在其国南，与奚西山相崎，地方二千里。逐猎往来，居无常处。\n奚国，盖匈奴之别种也，所居亦鲜卑故地，即东胡之界也，在京师东北四千余里。东接契丹，西至突厥，南拒白狼河，北至霫国。自营州西北饶乐水以至其国。\n霫，匈奴之别种也，居于潢水北，亦鲜卑之故地，其国在京师东北五千里。东接靺鞨，西至突厥，南至契丹，北与乌罗浑接。\n室韦者，契丹之别类也。居峱越河北，其国在京师东北七千里。东至黑水靺鞨，西至突厥，南接契丹，北至于海。\n靺鞨，盖肃慎之地，后魏谓之勿吉，在京师东北六千余里。东至于海，西接突厥，南界高丽，北邻室韦。\n渤海靺鞨大祚荣者，本高丽别种也。高丽既灭，祚荣率家属徙居营州。万岁通天年，契丹李尽忠反叛，祚荣与靺鞨乞四比羽各领亡命东奔，保阻以自固。……属契丹及奚尽降突厥，道路阻绝，则天不能讨，祚荣遂率其众东保桂娄之故地，据东牟山，筑城以居之。……圣历中，自立为振国王，遣使通于突厥。其地在营州之东二千里，南与新罗相接。\n乌罗浑国，盖后魏之乌洛侯也，今亦谓之乌罗护，其国在京师东北六千三百里。东与靺鞨，西与突厥，南与契丹，北与乌丸接。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.55-56",
    "交通工具": null,
    "交通要道": "通东北蕃族与辽东两条主干道",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.91
      ]
    ]
  },
  {
    "时期": "唐",
    "原文": "另一道路是由幽州经潞县、蓟州渔阳县（今蓟县）、石门峡（今遵化县西），过松亭关，渡滦河，经古卢龙镇，沿吐护真河（又名土河，今老哈河）到奚、契丹王帐。\n蓟州渔阳郡，开元十八年析幽州置。县三。南二百里有静塞军，本障塞军，开元十九年更名。又有雄武军，故广汉川也。东北九十里有洪水守捉，又东北三十里有盐城守捉，又东北渡滦河有古卢龙镇，又有斗陉镇。自古卢龙北经九荆岭、受米城、张洪隘度石岭至奚王帐六百里。又东北行傍吐护真河五百里至奚、契丹衙帐。又北百里至室韦帐。\n这条道路过滦河后，与檀州古北口道的路段重合，如《资治通鉴》所载：\n薛讷与左监门卫将军杜宾客、定州刺史崔宣道等将兵六万出檀州击契丹。……行至滦水山峡中，契丹伏兵遮其前后，从山上击之，唐兵大败，死者什八九。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.57-58",
    "交通工具": null,
    "交通要道": "由幽州经潞县、蓟州渔阳县（今蓟县）、石门峡（今遵化县西），过松亭关，渡滦河，经古卢龙镇，沿吐护真河（又名土河，今老哈河）到奚、契丹王帐",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        117.15,
        40.68
      ]
    ]
  },
  {
    "时期": "唐",
    "原文": "唐军攻下高丽十余城，但安市久攻不下，于九月班师回朝。途径柳城，“诏集战骸葬柳城，祭以太牢。帝临哭，从臣皆流涕。帝总飞骑入临渝关，皇太子迎道左。”“十一月辛未，幸幽州。癸酉，大飨，还师。”随后经由并州返回长安。\n唐高宗对辽东用兵取得了更大的战果，乾封元年至总章元年，终于平定高丽并在平壤设置了安东都护府。显庆五年攻破百济并置熊津等五都督府，龙朔元年以新罗为鸡林州都督府。唐朝对东北边疆的开拓达到了顶峰，幽州经临渝关通东北塞外的这条道路也得到了最大限度的开拓。其详细路线，由幽州东行六十里经潞县（今通州东）、三河县（今县东南）、蓟州治所渔阳县（今蓟县）。据《资治通鉴》载：初，契丹既强，寇抄卢龙诸州皆遍，幽州城门之外，虏骑充斥。……幽州东十里之外，人不敢樵牧。（赵）德钧于州东五十里城潞县而戍之，近州之民始得稼穑。至是，又于州东北百余里城\n三河县以通蓟州运路。虏骑来争，德钧击却之。九月，庚辰朔，奏城三河毕。边人赖之。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.54-55",
    "交通工具": null,
    "交通要道": "幽州通柳城郡及奚、契丹辽东道",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "唐",
    "原文": "其一是由幽州向北经顺州、檀州密云县、燕乐县古北口，向北行可达奚境。《新唐书·地理志》檀州条：\n檀州密云郡，本安乐郡，天宝元年更名。县二。有威武军，万岁通天元年置，本渔阳，开元十九年更名。又有镇远军，故黑城川也。有三叉城、横山城、米城。有大王、北来、保要、鹿固、赤城、邀虏、石子■七镇。有临河、黄崖二戍。密云，有隗山。燕乐，东北百八十五里有东军、北口二守捉。北口，长城口也。又北八百里有吐护真河，奚王衙帐也。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.57",
    "交通工具": null,
    "交通要道": "幽州向北经顺州、檀州密云县、燕乐县古北口，向北行可达奚境。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        117.15,
        40.68
      ]
    ]
  },
  {
    "时期": "唐末五代",
    "原文": "唐末五代契丹日渐强盛，屡屡侵逼幽州。为抵御契丹，驻守幽州的节度使赵德钧苦心经营，在幽州东筑城、置县、驻兵，以保障粮草运输。《资治通鉴》记载：\n幽州城门之外，虏骑充斥。每自涿州运粮入幽州，虏多伏兵于阎沟，掠取之。及赵德钧为节度使，城阎沟而戍之，为良乡县，粮道稍通。幽州东十里之外，人不敢樵牧；德钧于州东五十里城潞县而戍之，近州之民始得稼穑。至是，又于州东北百余里城三河县以通蓟州运路，虏骑来争，德钧击却之。九月，庚辰朔，奏城三河毕。边人赖之。\n另外，又积极开辟幽州粮运水道。后唐长兴三年“六月壬子朔，幽州赵德钧奏：新开东南河，自王马口至淤口，长一百六十五里，阔六十五步，深一丈二尺，以通漕运，舟胜千石，画图以献。”赵德钧所开东南河，起自淤口（今河北信安），接巨马河，终于王马口（今河北廊坊西南王玛村），靠近桑干河（今永定河）在固安、永清一线的南派河道。河北南部运粮船沿原永济渠至今天津独流镇以后，西北折入巨马河，溯流西上至淤口，再循新开凿的东南河向东北行，经永清县东境至王马口入桑干河南派，西北浮航至幽州蓟城西南。这条自淤口至王马口的“东南河”，代替了旧有的永济渠北端，《太平寰宇记》等文献于是亦称之为“永济河”、“永济渠”，但显然已非隋唐的永济渠了。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.61-62",
    "交通工具": null,
    "交通要道": "东南河",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.38,
        39.95
      ]
    ]
  },
  {
    "时期": "宋辽",
    "原文": "公元10世纪中叶至13世纪上半叶，先是建都于开封的北宋王朝（960-1127年）与建都临潢（今内蒙古自治区巴林左旗）的契丹辽国（947-1125年），以白沟为界，南北对峙；继而建都临安府（今杭州）的南宋王朝（1127-1279年）与初都会宁府（今黑龙江省阿城南之白城）、后迁都燕京（今北京）的女真金国（1115-1234年），以淮河为界，南北分治。这期间，双方既有战争烽火，又有相安无事的和平交往。\n在北宋与辽、南宋与金南北对峙的年代里，遇到皇帝或皇太后的生日、新皇帝登基以及重大节日时，双方都要派遣使臣相互祝贺；遇到皇帝、皇太后驾崩时，也互派使臣告哀或吊慰；为了处理两国间的大政要务，更需要互派使臣进行交涉协商。因此，宋辽金时期，南北聘使往返不绝于路。今北京这地方，在辽为南京，在金为中都，是宋辽金使臣往返必经之地。从当时许多使臣留下的行程录中，可以清楚地得知他们所走的道路。例如：宋真宗大中祥符五年（1012年），王曾奉命出使辽国。《王曾上契丹事》载：“自雄州白沟驿渡河，四十里至新城县，……又七十里至涿州，……六十里至良乡。渡卢沟河，六十里至幽州，号燕京”。“出燕京北门，至望京馆。五十里至顺州。七十里至檀州，渐入山。五十里至金沟馆……。自此入山，诘曲登陟，无复里堠，但以马行记日，约其里数。九十里至古北口。……又度德胜岭，……八十里至新馆。过雕窠岭、偏枪岭，四十里至卧如来馆。过乌滦河，东有滦州。又过墨斗岭、芹菜岭，七十里至柳河馆。……七十里至打造部落馆。东南行，五十里至牛山馆，八十里至鹿儿峡馆。过蛤蟆岭，九十里至铁浆馆。过石子岭，自此渐出山，七十里至富峪馆，八十里至通天馆，二十里至中京大定府”。显然王曾走的是古北口大道。\n金太宗天会二年（1124年），宋著作郎许亢宗使金，以贺金太宗登位。《许奉使行程录》载：\n第一程：自雄州60里至新城县。第二程：自新城县60里至涿州。第三程；自涿州60里至良乡县。第四程：自良乡60里至燕山府。第五程：自燕山府80里至潞县。第六程：自潞县七十里至三河县。第七程：自三河县60里至蓟州。第八程：自蓟州七十里至玉田县。第九程：自玉田县90里至韩城镇（在玉田东南、唐山市西）。第十程：自韩城镇50里至北界清州。第十一程：自清州90里至滦州。第十二程：自滦州40里至望都县。第十三程：自望都县60里至营州（今河北昌黎）。第十四程：自营州100里至润州（今秦皇岛西南）。第十五程：自润州80里至迁州（今山海关）。此后，又行长短不同的24程，才到达辽上京会宁府。很清楚，许亢宗走的是燕山南麓和山海关大道。\n上述两例有一个共同点，即皆从雄州记起。雄州即今河北雄县，在北宋时是御辽的边防重镇之一。北宋建国后，加强了由国都开封北至雄州以通辽国的一条新辟不久的驿道。这条纵贯河北平原中部的驿道，据有的学者研究，是由开封北行，经澶州（今河南濮阳）、大名府（北宋之北京今河北大名）、恩州（今河北清河）、冀州（今冀县）、深州（今深县南）、武强（今武强西南）、乐寿（今献县）、瀛州（今河间）、莫州（今任丘）等地，而至雄州。但因河北平原上河流众多，有时大水泛滥常常阻断这条南北大道，只好改行西路，即由开封奔滑州（今河南滑县旧城）、汤阴、相州（今安阳）、磁州（今河北磁县）、邢州（今邢台）、赵州（今赵县），然后转东北行，经安平至瀛州，与东路会合。过雄州30里，即到宋辽分界的白沟河畔白沟驿。这里是宋使走出国境的最后一站，也是辽使进入宋境的第一站。因此，宋辽两国皆在白沟驿举行迎送使臣的礼仪。有诗曰：“白沟河边番塞地，送迎番使年年事”。赴辽的宋使过了白沟驿，便经新城、涿州、良乡，到达辽南京（又称燕京）。反之，赴宋的辽使经燕京、良乡、涿州、新城至白沟驿后，再沿着雄州以南的驿路，到达宋都开封。因此，南北纵贯河北平原上的这条大道，标志着宋辽时代燕京的对外交通有了新的发展。北宋宣和三、四年间，因为新定燕山，“调河北、河东、京东、京西之民，转菽粟金帛器甲往燕山，络绎于道”。当时走的就是这条大道。宣和七年（1125年），童贯为宣抚使，在河东太原，奉命到燕山府犒军。他离开太原后，经真定府也是取道河间、莫州、雄州之路入燕山府的。这些事实足以说明宋辽时纵贯河北平原中部的这条大道的重要性。\n《大金国志》“附录二·地理·驿程”详细记载了自淮河岸边的泗州（今江苏盱眙）到金上京的长达4000余里的驿路。若以燕京为中心，向南则经卢沟河铺、良乡、刘李店、涿州、泽畔店、黄村、故城店、梁门、保州、……真定……邢州……邯郸……磁州……相州……汤阴……滑州……封邱……宁陵……宿州……灵璧……临淮等地，到达泗州。显然，这段驿路主要是太行山东麓大道。而由燕京往北，经过交亭、潞州、三河、下店、邦军店、蓟州、罗山铺、玉田县、沙流河、永济务、榛子店……平州……旧榆关……千州等地，出山海关，又经过45段驿程，才到达金上京会宁府。无疑，这段驿路乃是燕山南麓和山海关大道。由此可见，金国兴起以后，太行山东麓大道和燕山南麓、山海关大道变得更加重要起来。这与金国的势力向南已达到淮河，而它的上京却在白山黑水间有直接关系。\n至于居庸关大道，虽然少有宋辽金使臣经行这里，但也是由燕京往塞外的一条重要路线。五代周同州合阳县令胡峤为契丹俘获，居契丹7年，后逃回中国。胡氏被押往契丹时，自幽州西北入居庸关，经可汗州（治怀来旧城）、鸡鸣山、归化州（治今宣化）等地，向西绕了一个大弯，最后到达契丹皇都即上京临潢府（在今内蒙古巴林左旗南）。\n在这里还应当指出，辽金时代，契丹或女真人从塞外南侵时，往往经行一些山口隘路，以求快速进军。例如，契丹要南伐时，先在幽州北千里的鸳鸯泊点兵。“及行，并取居庸关、曹王峪、白马口、古北口、安达马口、松亭关、榆关等路”。这里的居庸关、古北口、榆关（在今山海关西南）上文屡屡提到，无需多说。曹王峪当即今怀柔县亓连口，白马口即今密云县白马关，安达马口即今密云县东北安达木河上游流入长城处的山口，松亭关在今迁安县喜峰口北。由此可见，这些山口都是契丹或女真人入塞侵扰时的捷径。\n",
    "出处": "侯仁之.北京城市历史地理[M].北京：北京燕山出版社,2000.359-362",
    "交通工具": null,
    "交通要道": "第一程：自雄州60里至新城县。第二程：自新城县60里至涿州。第三程；自涿州60里至良乡县。第四程：自良乡60里至燕山府。第五程：自燕山府80里至潞县。第六程：自潞县七十里至三河县。第七程：自三河县60里至蓟州。第八程：自蓟州七十里至玉田县。第九程：自玉田县90里至韩城镇（在玉田东南、唐山市西）。第十程：自韩城镇50里至北界清州[13]。第十一程：自清州90里至滦州。第十二程：自滦州40里至望都县[14]。第十三程：自望都县60里至营州（今河北昌黎）。第十四程：自营州100里至润州（今秦皇岛西南）。第十五程：自润州80里[15]至迁州（今山海关）。此后，又行长短不同的24程，才到达辽上京会宁府。很清楚，许亢宗走的是燕山南麓和山海关大道。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.92
      ]
    ]
  },
  {
    "时期": "宣统元年",
    "原文": "从这一年九月开始施工，到宣统元年八月戊子（1909年9月25日），邮传部奏：\n京张铁路全路告成，计长三百五十七里，连岔道计长四百四十九里。此路为我国铁路北干之起点。道员詹天佑总司工程，经营缔造。其会办以及各段工程师暨执事各员，均属异常出力。拟请优给奖叙，以昭激劝。\n这项奖励申请在九月戊申（1909年10月15日）得到批准：“以京张铁路全工告竣，予总办詹天佑、会办关冕钧、工程司颜德庆等奖叙有差”。南起北京丰台、经八达岭隧道至张家口的京张铁路，是我国在资金、设计、施工等方面完全独立自主的伟大创举。\n京张铁路的设计者詹天佑，是国人引以自豪的卓越铁路工程专家。詹天佑（1861—1919），字眷诚，祖籍安徽婺源，生于广东南海县。同治十一年（1872）考取赴美国学习的“幼童出洋预备班”，光绪七年（1881）以优异成绩毕业于耶鲁大学土木工程系，获学士学位。同年归国后，在修筑京奉铁路的滦河大桥、主持修建高碑店至易县的支线铁路时，他已经展现了杰出的才能。光绪三十一年（1905），詹天佑担任京张铁路总工程师。他独具匠心的精妙设计，创造了中外铁路建筑史上的奇迹。以险要著称的居庸关孔道，地质地理情况复杂，平均坡度约为30‰，设计和施工的难度极大。詹天佑在亲自考察的基础上，设计了长达1091米的八达岭隧道和巧妙至极的“人”字形线路，发明了“竖井施工法”，既保证了火车顺利通过居庸关和八达岭，又大大减少了工程量，在技术上超越了当时国际铁路建设的水平。京张铁路提前两年完工，工程费用比预算节约白银28万两（一说35万两）。1919年4月24日，詹天佑在汉口仁济医院病逝。他与夫人谭菊珍的墓地原在海淀区万泉庄，1982年5月20日由铁道部迁至青龙桥车站。为了纪念这位伟大的爱国铁路工程专家，1922年中华工程师学会在青龙桥火车站竖立了第一任会长詹天佑的铜像，总统徐世昌撰文并书写了纪念碑的碑文。1987年在八达岭隧洞的山峦上，修建了占地6000平方米的詹天佑纪念馆，供后来者瞻仰缅怀。2005年10月12日为纪念京张铁路肇建一百周年，张家口南站竖立了高4.75米、人像高2.8米的詹天佑铜像。\n早在京张铁路即将竣工之际，宣统元年七月戊申（1909年8月16日）“邮传部奏：展筑张绥铁路。……现京张指日竣工，便可专营此路。即饬令京张路局人员一手经理，暂时定名张绥，毋庸另行设局，以节糜费”。这条由张家口至绥远（内蒙古呼和浩特新城）的“张绥铁路”，修到山西阳高县时，因武昌起义爆发而停工缓办。1912年底继续修建，经过山西大同出长城，1915年到达内蒙古丰镇后又因第一次世界大战的干扰而停工。1919年再次续修，1921年终于抵达绥远。\n这段铁路与京张铁路合在一起，称“京绥铁路”，共长609公里。1923年延伸到包头，称“京包铁路”，京张铁路成为它的首段。鉴于原来的京张铁路关沟段通过能力较差，1955年建成了自北京丰台至河北怀来县沙城的“丰沙铁路”，它实际上就是当年詹天佑勘测京张铁路时认为比较理想但因造价较高而被迫放弃的那条路线。\n京张铁路施工期间的光绪三十二年六月己巳（1906年7月24日）,“商部奏：京西运煤，拟请饬由京张铁路接修枝路，以便运输。依议行”。这份奏折叙述了门头沟采煤的状况：\n京城之西山产煤素富，从前周口店、石梯、门头沟三处煤厂林立，专运西山南北所产灰煤。该处商民，大都恃此以为生计。近年以来，迭据门头沟商人先后禀称：自周口店接修京汉枝路，通至琉璃河，于是山南之煤，南达保定、正定，北达京城、天津，运路因以日广。而门头沟向运山北之煤，以枝路未修，但恃驼运，脚价既昂，销路又滞，厂商相继失业，良善不免流离，莠民或从而滋事。惟有由商人等招集股本，接修门头沟枝路，并设立运煤公司，专运山北灰煤，俾苏民困各等情。\n由此到两年以后的光绪三十四年（1908），筑成了京张铁路的京门支路，起点为西直门，向西行至三家店，渡过永定河，止于门头沟外小龙村，全长47里，供运输煤炭和建筑材料之用。进入民国以后， 1924年5月1日至1927年7月1日，建成了由门头沟至板桥、长34公里的“门板支线”；此后至1931年冬，建成了由清水涧至斋堂的“清斋支线”，二者合称“门斋铁路”，也是以运输煤炭建材为主的铁路支线。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.171-173",
    "交通工具": null,
    "交通要道": "京张铁路",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.07,
        40.29
      ]
    ]
  },
  {
    "时期": "明",
    "原文": "永乐七年（公元1409年）五月，明成祖朱棣开始在昌平北修建陵寝，即明十三陵的第一个陵——长陵。当时所需大批建筑材料和粮食，可能就是从通州沿温榆河直运昌平的。陵墓建成后（历朝都有修建），派军队驻守。为供应守陵军夫粮饷，以及居庸等边关粮仓的粮储，温榆河的漕运地位日益重要。\n隆庆六年（公元1572年）十月，“户部奏请开浚榆河，自巩华城（今沙河镇）达于通州渡口，运粮四万石，给长陵等八卫官军月粮。从之。”这是一次较大规模的治理，周梦旸所著《水部备考》一书记载较详：“十月蓟辽总督刘应节，巡抚扬兆，议于巩华城外安济桥至通州渡口疏通一河，长可一百四十里。内水深成槽，见可行舟者一百余里；散漫淤浅，稍串开通者三十余里，以运诸陵官军饷。发军卒三千人治之，不数月河成。”这次施工自十月动工，约翌年（万历元年）完成。疏通了“陵泉诸水”，应包括巩华城以上至昌平陵寝航道。竣工后，可“岁漕江北粳米二十万石以赡昌平”。从此军士可免去陆路车运之艰辛。\n当时由通州运来的漕粮，直接交巩华城奠靖仓收纳，然后再转交驻军或居庸军仓。\n明代，商船也可沿温榆河直驶巩华城外安济桥下。蒋一葵《长安客话》记载“沙河东注与潞河合。每雨集水泛，商船往往从潞河直抵安济桥下贸易，土人（百姓）便之”。看来，因水量关系，当时似只是季节性通航。\n",
    "出处": "蔡蕃.北京古运河与城市供水研究[M].北京：北京出版社,1987.52-53",
    "交通工具": null,
    "交通要道": "明代通州至巩华城的漕运",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "明",
    "原文": "明代由北京通往全国各地的陆路，在继承前代的基础上，略有变化。这种变化主要表现在两个方面：\n第一，明初，锐不可挡的兵锋一直深入蒙古势力的腹地，洪武间于开平、大宁等地设置许多卫所，屯驻大批军队，甚至封王镇守（如辽王朱植即驻大宁）。当时，由北平北上的道路延伸很远。但明成祖永乐元年（1403年）改北平为北京之后，不久即放弃开平、大宁等地，将原来设在那里的都司、卫所统统内迁，于保定、顺天府境安置，北京以北的塞外复为蒙古势力驻牧。永乐迁都北京后，为护卫京师安全，坚筑长城不懈，固守内外边塞，直至明终，明廷势力不及北京塞外。因此，由北京经张家口、独石口、四海冶、古北口、喜峰口等要塞北上的道路，可以说，都被内外长城截为两段了。永乐七年（1409年）四月，“命编置紫荆、居庸、古北、喜峰、董家、山海六关口出关勘合，以防诈伪。每关一百道，以‘礼’、‘乐’、‘射’、‘御’、‘书’、‘数’六字为号。……公差出关者，必得内府勘合为验乃出，无者从守关官执奏”。由此，辽、金、元时期通达塞内、外的几条南北要路已不再畅通无阻，交通价值大为降低。这是退步的一面。但随着长城的不断修筑和加强边备的需要，由北京通往蓟州、宣府、大同等边镇的道路却益加重要起来。例如，永乐二十年（1422年）春北征，分前、后两拨向居庸关外馈运给养，共用驴340，000头，车117, 573辆，挽车民丁235，146人，运粮凡370，000石；督领官员共98人，还有马军1000名、步军5000名护送。如此庞大的馈运粮草的队伍，有力地说明出居庸关至宣化、大同的道路的宽阔和重要性。\n第二，与前代相比，明代在道路桥梁建设上成就显著。例如，永乐年间修建清河上的广济桥；十五年（1417年）十月“修通州城东白富河桥”；正统十一年（1446年）八月“建通州八里庄桥（即永通桥）”。十三年（1448年）建昌平沙河等处石桥（朝宗桥）；天顺七年（1463年）四月，“新建弘仁桥成。”“桥长二十五丈，广三丈，为洞有九以酾水，为栏于两旁以障田者，精致工巧，无以复加。”嘉靖二十五年（1546年）五月建成良乡琉璃河石桥；万历二年（1574年），建成涿州胡良河桥与城北石桥（永济桥）；三十七年（1609年），又建良乡南关外普济桥等等。这些大型桥梁的建成，无疑大大便利了南来北往、东去西回的北京陆路交通。明良乡县令樊巍有一首《良乡行》诗，反映了卢沟桥大道上繁忙景象，诗云：\n“君不见，畿南首邑有良乡，寥寥一塔自隋唐。襟喉京省当燕名，水似玻璃控远方。万国朝金阕，九重乐未央。八蛮通道称宾贡，四夷款塞纷来王。鲜芝献川岳，玉米走苏常。金砖与醮盏，骞茗并鱼缸。西番载皮柜，南缅贡象房。中官络绎驰丹毂，侯伯新封就土疆。车马常百计，夫皂不可量。既索旗帜引，仍求鼓吹扬。箱奁笼锦绣，箧笥过邱冈。武夫排道路，尘埃蔽穹苍。更有皇华使，驰驱日夜忙。羽檄报声息，黄符催运粮。县官冲风雪，驿递立冰霜。迎送已劳苦，需索尤难当。一朝用不敷，下吏被鞭伤。挪移还惹罪，包赔倒私囊。千家门户皆深闭，各行头役俱逃亡。午夜沿街索灯火，关文挂号空彷徨。过客咸嗔不应付，可怜苦楚谁能尝？父窜霸州东，子走房山阳。吁嗟六百丁，鱼游釜中汤。纵有一万二千协济数，解纳后时多赔偿。官钱私债频年借，前官后宦总凄凉。寄语四方游宦客，选官切莫选良乡”。\n虽然这首诗抒发了作者满腹的苦楚和牢骚，但也生动地描述了良乡所处的由北京通往中原大道上的繁盛景况。值得注意的是，大型弘仁石桥（又称马驹桥）的修建，表明由北京向东南而去的一条大道，其地位和作用重要起来了。这条路所经过的采育、凤河营等地，元时尚为沙漠地。明永乐二年（1404年），从山东、山西移民于此，设立58营，种蔬果，养禽畜，供给皇宫享用。随着这里的开发经营，人烟渐众，与北京城的关系日益密切，通往北京城的大道也就非昔日可比了。“凡外郡畿内之人自南而来者，东西二途胥出此渡（指弘仁桥所在旧日渡口）。车之大而驾者，小而挽者，物类之驮者，人之有肩负者、骑者、步者，纷纷络绎，四时不休”。足见此路的效益。这种状况不见明以前的记载。\n在明代北京的诸多道路中，有两条特别重要。一条是出德胜门去皇陵的御路，一条是出永定门去南苑的御路。\n明皇陵在昌平北（景泰前昌平县治今旧县）黄土山。永乐七年（1409年）五月己卯（初八日），永乐帝亲临山下，选定皇陵于此，封黄土山为天寿山，并遂即命兴工营建山陵，即长陵。此后，这里渐次埋葬着成祖、仁宗、宣宗、英宗、宪宗、孝宗、武宗、世宗、穆宗、神宗、光宗、熹宗、思宗十三位明帝与部分皇后，故统称明十三陵。因皇帝皇后发丧入葬，每年皇帝亲自谒陵或遣官代祭列祖列宗时，遵泥礼仪，讲究排场，兴师动众，浩浩荡荡，所以由京城到皇陵的道路就非同一般，必须宽平坚直，畅通无阻。原来由京城德胜门至居庸关的大道，自清河斜向西北，经唐家岭、榆河、双塔、辛店等地而奔南口。明皇陵兴建后，偏东另辟新路，由清河经沙河而趋皇陵。在这条皇家御路上，永乐间建清河广济桥，正统间建沙河朝宗桥、安济桥。弘治十七年（1504年）建元（玄）福宫，俗称回龙观。嘉靖十六年（1537年）三月，礼部尚书严嵩建言：“沙河为圣驾展视陵寝之路，南北道里适均，我文皇肇建山陵之日，即建行宫于兹，正统时为水所坏，今遗址尚存，诚宜修复而不容缓者。且居庸、白洋近在西北，若鼎建行宫，于中环以城池，设官戍守，宁独车驾驻跸为便，而封守慎固，南护神京，北卫陵寝，东可以蔽密云之冲，西可以扼居庸之险，联络控制，居然增一北门重镇矣”。隔年，兴工始建沙河行宫，这就是巩华城。城有四门，南曰扶京，北曰展思，东曰镇远，西曰威漠。南北二门为銮舆出入之处。上述桥梁、宫观、行宫的修建，使这条皇陵御道更加重要和便利。\n南苑，又称南海子，在永定门外20里，本元之下马飞放泊。永乐十二年（1414年），增广其地，筑以围垣，长18660丈，辟四门，内中林木繁茂，水泉旺盛，禽兽繁衍，是一处供皇帝猎围的皇家苑囿。平时有海户经管守护。因为明朝皇帝经常前往游乐，所以出永定门去南苑的路也就成为一条重要的御路。\n对于北京城内的街衢道路，明政府也颇重视修治和管理。例如，成化六年（1470年），“令皇城周围及东西长安街，并京城内外大小街道沟渠，不许官民人等作践掘坑及侵占淤塞；如街道低洼，桥梁损坏，即督地方火甲人等并力填修。”弘治十三年（1500年）奏准，“京城内外街道，若有作践掘成坑坎，淤塞沟渠，盖房侵占，或傍城行车，纵放牲口，损坏城脚，及大明门前御道棋盘街，并护门栅栏，正阳门外御桥南北、本门月城将军楼、观音堂、关王庙等处，作践损坏者，俱问罪，枷号一个月发落”。嘉靖十年（1531年）题准，“大通桥至京仓粮运陆路，每年二月内，巡城御史督并兵马司修筑”。万历八年（1580年）题准，“京师街道沟渠，近朝去处，间用砖石拦砌，以防车碾作践；及各腰墙、河墙、堤防、门厂修理，用银三十二万二千七十两有奇。凡五城兵马掌京城内外街道沟渠，各奉札付分坊管理。每二年申呈更调”。\n",
    "出处": "侯仁之.北京城市历史地理[M].北京：北京燕山出版社,2000.367-372",
    "交通工具": null,
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.91
      ]
    ]
  },
  {
    "时期": "明",
    "原文": "居庸关、紫荆关、古北口等关口，是蒙古侵入时经常选择的孔道。在明中后期，蒙古诸部落也多次抄小道入侵北京，嘉靖帝时情况尤为严重。《明史·丁汝夔传》记载：\n当是时，俺答岁寇边，羽书叠至。天子方斋居西内，厌兵事，而大学士严嵩窃权，边帅率以贿进，疆事大坏。其明年（引者按：嘉靖二十九年）八月甲子，俺答犯宣府，诸将拒之不得入。汝夔即上言：“寇不得志于宣府，必东趋辽、蓟。请敕诸将严为备。潮河川乃陵京门户，宜调辽东一军赴白马关，保定一军赴古北口。”从之。寇果引而东，驻大兴州，去古北口百七十里。大同总兵官仇鸾知之，率所部驰至居庸南。顺天巡抚王汝孝驻蓟州，误听谍者谓寇向西北。汝夔信之，请令鸾还大同勿东，诏俟后报。及兴州报至，命鸾壁居庸，汝孝守蓟州。未几，寇循潮河川南下至古北口，薄关城。总兵官罗希韩、卢钺不能却，汝孝师大溃。寇遂由石匣营达密云，转掠怀柔，围顺义城。闻保定兵驻城内，乃解而南至通州。阻白河不得渡，驻河东孤山，分剽昌平、三河，犯诸帝陵，杀掠不可胜纪。京师戒严，召各镇勤王。\n俺答由北向东，再转至南，寻觅可侵入的关口，几乎无孔不入，北京周边均被寇抄。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.109-110",
    "交通工具": null,
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "明",
    "原文": "明朝边境自西至东，绵延数千里，关隘重重，“自永平、蓟州、密云迤西二千余里，关隘百二十有九，皆置戍守”。对明朝北边以及首都北京而言，防御任务最重的军镇关口，分布于西起大同、东至蓟州之间的太行山、燕山、军都山山脉之中。从明太祖开始，这些重要关口就置军戍守。\n（洪武六年）于紫荆关及芦花岭设千户所守御。又诏山西都卫于雁门关、太和岭并武、朔诸山谷间，凡七十三隘，俱设戍兵。九年，敕燕山前、后等十一卫，分兵守古北口、居庸关、喜峰口、松亭关烽堠百九十六处，参用南北军士。十五年，又于北平都司所辖关隘二百，以各卫卒守戍。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.106",
    "交通工具": null,
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.91
      ]
    ]
  },
  {
    "时期": "明",
    "原文": "经居庸关通宣府的道路，是北京通往西北的干道。明成祖于永乐八年、十二年两次出征蒙古，随同出征的金幼孜《北征录》及《北征后录》，记载了朱棣出征的行程，沿途地点串联起来就使这条路线清晰可见。为使行文简洁，这里仅节略《北征录》的部分相关文字。它所记载的永乐八年出征路线为：\n永乐八年二月初十日，上亲征北虏。是日，师出北京。驾出德胜门，幼孜与光大胡公由安定门出。晚次清河。十一日早，发清河。晚次沙河。十二日早，寒，发沙河，午次龙虎台。十三日早，发龙虎台，度居庸关，晚次永安甸。十四日早，发永安甸。午后次怀来。十五日早，发怀来，午次镇安驿。十六日早，发镇安驿，午次鸡鸣山。十七日，发鸡鸣山，午次泥河。十八日发泥河，午次宣府。十九日，驻跸宣府。二十一日，发宣府，晚至宣平。二十四日早，发宣平，次万全。二十五日，发万全。行数里，至城下。过城北，入德胜口。二十六日，驻跸兴和。\n三月初七日早，发兴和。行数里，过封王陀，今名凤凰山。午次鸣銮戍。初八日，驻跸鸣銮戍。初十日早，发鸣銮戍，驻营凌霄峰。十一日，驻跸凌霄峰北。十六日五鼓，发凌霄峰。驾发由东路，幼孜三人向西路。幼孜与光大，由哨马路迷入橐駞山谷中。山重叠，顶皆石，山下有泉水一沟甚清，饮马其上。十七日早，由山间望东南行逾数十里。午至锦水碛，见上。十八日，驻跸锦水碛。十九日早，发锦水碛。午次环琼圃。二十日，驻跸环琼圃，午次压虏川。二十一日，驻跸压虏川。二十二日早，发压虏川，午次金刚阜。二十五日早，发金刚阜，午次小甘泉。二十六日，发小甘泉，午次大甘泉。二十八日，移营于大甘泉北十里屯驻。二十九日早，发大甘泉北，午次清水源。三十日，驻跸清水源。\n四月初五日午，发清水源，晚至屯云谷。初六日早，发屯云谷，午次玉雪冈。初七日，发玉雪冈，午次玄石坡。初八日早，发玄石坡，午次鸣毂镇。初九日早，发鸣毂镇，晚至归化甸。十二日早，发归化甸，由山谷中行，午至杨林戍。十六日早，发杨林戍，午次禽胡山。十七日午，次香泉戍。十八日早，发香泉戍，午后至广武镇。十九日，发广武镇，晚次高平陆。二十日，发高平陆，午次怀远塞。二十一日早，发怀远塞，午次捷胜冈。二十二日早，发捷胜冈，午次清冷泊。二十三日午，发清泠泊，晚至双秀峰。二十四日早，发双秀峰，逾时至威虏镇。二十五日，午后发威虏镇，晚至紫霞峰。二十六日早，发紫霞峰，晚至玄云谷。二十七日早，发玄云谷，午次古梵场。二十八日早，发古梵场，晚至长清塞。三十日早，发长清塞，至顺安镇。\n五月初一日早，发顺安镇。驻营河上，地名曰平漠镇。初二日，驻跸平漠镇，赐食御庖鲜鱼。初三日，发平漠镇。由此顺胪朐河东行，午至祥云巘。初四日晨，发祥云巘，午次苍山峡。初五日，发苍山峡，午次云台戍。初六日，发云台戍，午次锦屏山。初七日，发锦屏山，午次玉华峰。初八日，发玉华峰。胡骑都指挥款台获虏一人至，知虏在兀古儿扎河。晚遂度饮马河下营。初九日，上以轻骑逐虏，人各赍粮二十日。其余军士，令清远侯帅领驻札河上。二十二日，分军由饮马河先回。上以骑兵追逐余虏，东行，步行者俱不得从。晚次威远戍。二十三日午，发威远戍，晚至广安镇。二十四日，发广安镇，由此循饮马河南东北行，午次蟠龙山。二十五日，发蟠龙山，雨意未止，晚次临清镇。二十六日，午后离饮马河，取便道入山中，晚次定边镇。二十七日，发定边镇，午食后渡河，暮至双清源。二十八日，发双清源，晚次平山甸。二十九日，发平山甸，晚次盘流戍。\n六月初一日早，发盘流戍，晚次凝翠冈。初二日，发凝翠冈，午经阔滦海子，晚次玉带河。初三日，发玉带河，次雄武镇。初四日，发雄武镇，晚次清胡原。初五日，发清胡原，晚次澄清河。初六日发澄清河，夜至青杨戍。初七日，发青杨戍，晚次苍松峡。初八日，发苍松峡，渡泥河数次。晚，度黑松林。次飞云壑。初九日，发飞云壑。行二十余里，凡度数山。度一大山，见虏出没于山谷中。上已驻兵于静虏镇，遣传令都指挥王贵来收兵。初十日早，发静虏镇，命诸将皆由东行。晚次驻跸峰。十一日，上先将精骑穷追虏溃散者。午始行入山谷中，渐见虏弃辎重。晚次长秀川，而辎重弥望。十二日，发长秀川，随川东南行，虏弃牛羊狗马满山谷。暮次回曲津。十三日，发回曲津，午次广漠戍。十四日，发广漠戍，晚次蔚蓝山。十五日，发蔚蓝山，晚次宁武镇。十六日，发宁武镇，晚次紫云谷。十七日，发紫云谷，晚次玉润山。十八日，发玉润山，晚次紫微冈。十九日，发紫微冈，晚次青阳岭。二十日，发青阳岭，晚次清华原。二十一日，发清华原，晚次淳化镇。二十二日早，发淳化镇，渡河。晚次秀水溪。二十三日，发秀水溪，晚次峡中。二十四日，发淙流峡，晚次锦云峰。二十五日，发锦云峰，晚次永宁戍。二十六日，发永宁戍，晚次长乐镇。二十七日，发长乐镇，晚次通川甸，即应昌东二海子间。二十八日，发通川甸，晚次金沙苑。二十九日，发金沙苑，晚次玻璃谷。三十日，发玻璃谷，晚次威信戍。\n七月初一日，发威信戍，午次武平镇。初二日，发武平镇，晚次开平。初四日午，发开平，晚次环州。初五日，发环州。晚次李陵台，今名威虏驿。连渡数河，晚次宁安驿。初七日，发宁安驿，经元西凉亭故址，晚次盘谷镇。初八日，发盘谷镇，由是入山峡中，晚次独石。初九日，发独石，晚次龙门。初十日，发龙门，次燕然关。十一日，发燕然关，次长安岭，至此方出险。十二日，发长安岭，次镇安驿。十三日，发镇安驿，次怀来。十四日，发怀来，次永安甸，上召赐瓜果。十五日，发永安甸，度居庸关，晚次龙虎台。十六日，发龙虎台，晚次清河。十七日，驾入北京。\n《北征后录》所记路线与《北征录》大致相当。明成祖两次北征的路线，与元代从大都至上都开平府的路线相差不大。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.106-109",
    "交通工具": null,
    "交通要道": "经居庸关通宣府的道路，是北京通往西北的干道。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.07,
        40.29
      ]
    ]
  },
  {
    "时期": "明",
    "原文": "从北京南过良乡，经易州出紫荆关，是通往军事重镇大同府的一条要道。正统七年，宦官王振鼓动明英宗亲征瓦剌，出居庸关经宣府、阳和至大同。“及帝亲征，西宁侯宋瑛、驸马都尉井源为前锋，遇敌阳和”，英宗所行的一段路线与成祖北征路线相合，但是从大同返回北京时，“振初议道紫荆关，由蔚州邀帝幸其第。既恐蹂乡稼，复改道宣府。军士纡回奔走，壬戌始次土木。瓦剌兵追至，师大溃。帝蒙尘，振乃为乱兵所杀”。从大同经蔚州入紫荆关再经易州，本是返回北京较为近便的路线。但是，王振擅作主张，由蔚州折向北，于是导致了土木堡之变。也先俘虏英宗后，先返回大同，然后再挟持英宗，“破紫荆关直入，窥京师”，一时京城人心惶惶。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.109",
    "交通工具": null,
    "交通要道": "从北京南过良乡，经易州出紫荆关，是通往军事重镇大同府的一条要道。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.07,
        40.29
      ]
    ]
  },
  {
    "时期": "明",
    "原文": "明代自京城南去的道路，除了出正阳门和永定门去皇家园囿南海子的御路之外，最重要的是太行山东麓的南北大道。这条道路在先秦时期已具雏形，此后一直是幽州以及辽南京、金中都、元大都连接中原的主要通道，今天的京广铁路一线就是它的延续和发展。明代这条大道的位置与前代并无不同，出北京西南经卢沟桥、良乡、琉璃河、涿州南下的一段，交通却变得最为繁忙。良乡县令樊巍《良乡行》写道：“车马常百计，夫皂不可量。……迎送已劳苦，需索尤难当。……寄语四方游宦客，选官切莫选良乡”。为便于皇帝出行，嘉靖十八年（1539）在良乡以南的琉璃河修建了行宫。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.111",
    "交通工具": null,
    "交通要道": "除了出正阳门和永定门去皇家园囿南海子的御路之外，最重要的是太行山东麓的南北大道",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.35,
        39.88
      ]
    ]
  },
  {
    "时期": "明",
    "原文": "明初，漕运管理制度随着运河的变化而变动较大，自嘉靖起至清中叶比较稳定，清后期运河受阻，管理也日益混乱，问题渐渐增多。\n明永乐初迁都北京后，漕运任务日重，漕运和河道统归漕运总兵官兼管。正统三年（1438年）设总都仓场，衙署设在今东单裱褙胡同。景泰年间，设通仓御史一员，京仓巡城御史带管一员，负责京通漕粮收运。成化七年（1471年）以后，设总漕专理漕运，设漕运参将，运输仍用军卒。明都察院设巡漕察御史一员，驻通州，以巡视漕务为专职，掌管稽察工作。成化后设坐粮厅管理。\n清初承袭明制，设总督仓场，由户部满、汉侍郎各一员充任，专门执掌漕运，其地位视如京师部院衙门。仓场衙门仍在京城内，下设京粮厅；公署坐落在通州新城南门内（见图3-27），下辖坐粮厅。坐粮厅满、汉各一员，由给事中、御史及各部郎中、员外郎中选派，任期二年。其下辖石坝州判一员、土坝州同一员、通济库大使一员、通州税课司大使一员。坐粮厅管理漕粮，查验抵坝漕船米数和米色（数量和质量），催■重、空粮船，督令经纪车户转运粮米交京、通各仓，以及各闸坝堤岸的修固等事务。乾隆三十年后，由漕运通判专管，并兼抽通州税课，另设巡漕御史一员，监督漕运管理，直至道光三年（1823年）裁撤。\n通州石坝州判衙门，设在通州北门外，石坝掣斛厅在通惠河岸边隙地。每当漕船到通抵坝，差户部章京一员，御史一员前赴石坝“监察”收粮情况。这时衙门成为这些“监察”大员的临时驻札公署。在石坝上建有大光楼一座，通称石坝楼，是仓场侍郎和坐粮厅稽查、督催粮运的临时办公地点。\n土坝州同督漕公署设在通州东门外的“土坝掣斛厅”。每年漕运季节，土坝州同督率文武官弁沿河稽查、催运①。\n自明嘉靖后，漕粮一部分运至通州石坝起岸，由人夫搬运至葫芦头里河（通惠河）的剥船上，一部分运至土坝起岸，车运至京通各仓。当时通惠河五闸，各设水脚15名，合计75名，加石坝30名，共计105名②。运至大通闸的粮米，由所设60名车户负责运至京师各仓。通惠河各闸设剥船60只，每船4人，负责驳运。\n清代土石二坝及通惠河五闸剥运夫役情况，据《通州高志》，列如表4-3。\n",
    "出处": "蔡蕃.北京古运河与城市供水研究[M].北京：北京出版社,1987.152-153",
    "交通工具": null,
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "明清",
    "原文": "明洪武年间，北平（原元大都）虽失去国都地位，但成为定都南京的明王朝进攻和防范已败逃漠北的残馀蒙古贵族势力的前沿基地，有燕王朱棣率武将镇守。燕王“靖难”成功即帝位后，遂改北平为北京，府曰顺天。永乐十九年（1421年）迁都，北京又成为明王朝的宗庙社稷所在。无论是明初，还是永乐迁都以后，北京所需的米粮主要仰赖江南供应。因此，水路和漕运的畅通，仍然是明廷的重要政务。\n洪武年间，主要从山东莱州海运粮米以饷北平、辽东。永乐以后，始用装载300石以上的淮船，浮淮河，入黄河，逆水而上运抵阳武，陆挽170里至卫辉，复用船浮卫河，转输北京。这种水陆联运与海运（明初海运路线犹仍元旧）相参。迨会通河重新开通后，海、陆二运皆罢，唯存遮洋船，每年从山东、河南、小滩（在直隶大名县东北卫河滨）等水次，兑粮300，000石，十之二输往天津，十之八由直沽入海转输蓟州。由是，大运河漕运发达起来。\n明代的大运河总名漕河，长达3000馀里，是由不同的河湖水系联通而成的。从昌平神山泉诸水，经北京城，过大通桥，东至通州入白河者，称大通河。从通州南流至直沽，合卫河入海者，是白河。从临清北流至直沽，合白河入海者，名卫水，又称御河。从临清至济宁天井闸，是汶水，其水在南旺向北、向南分流。从济宁天井闸至茶城，是泗水、光水、小沂河及山东泉水。从茶城至清口，是黄河。从清口至瓜州、仪真，是淮安、扬州诸湖水。再南即长江。长江以南则是松、苏、浙江运道。自淮、扬至京口以南河道，总称转运河。长江以北运道，自瓜州、仪真达淮安一段，又谓之南河。由黄河达丰、沛一段，又称中河。由山东达天津一段，又名北河。由天津达张家湾一段，别称通济河。因为大运河的不同区段名称及水道特点不同，故明代漕运又有白漕（白河段）、卫漕（卫河段）、闸漕（会通河段）、河漕（黄河段）、湖漕（淮、扬湖区段）、江漕（长江段）、浙漕（江南至浙江段）等不同名堂。为了保证漕道畅通，明代曾不断地整修疏浚大运河，特别是在鲁西南和苏北地段，所下功夫最大。宋礼、陈瑄、潘季驯等官员以及山东汶上县平民白英老人等，都为之作出过突出贡献。\n南北大运河是北京的水路大动脉。其中，与北京城关系最为密切的是大通河（通惠河）。洪武中，该河渐废。永乐四五年（1406-1407年）间，曾发军民修治其堤岸闸坝，尚可输运大木建材。其后，大通桥以上河段尽废，原因有二：一是宣德七年（1432年），将皇城东墙移建于通惠河东岸，即将城内通惠河的一段圈入皇城内，不允通行舟船；二是永乐帝选定昌平黄土山（改名天寿山）为陵寝地后，原白浮堰一段不允再施工动土，以免破伤“地脉”。因此通惠河上游水源只是玉泉和西湖景之水，较元代大为减少。但因漕运需要，仍有人建议疏浚通惠河。例如，成化中，漕运总兵官杨茂建言：“每岁漕运，自张家湾舍舟陆运，遇雨泥泞，每车雇银一两，仅载八九石，其费皆出于车。看得通州至京城四十馀里，古有通惠河故道，石闸尚存，永乐间曾于此河船运大木。以此度之，船亦可行。先年曾奏，欲于此河积水船运，又有议于三里河从张家湾烟墩桥以西，疏挑二十里湾泊，粮船以避水患者，二事俱未施行。今此河道通流，其水约深二尺，不劳疏挑，惟用闸蓄水，令运粮卫所每船二十五只造一剥船，自备米袋，挨次剥运。如此则运士得省脚费而困惫少苏矣”。经廷臣会商并派人踏勘后，认为“若从西湖源头将分水青龙闸闭住，引至玉泉诸水，从高梁河量分其数，一半仍从皇城金水河流出，其馀从都城外壕流转通惠，流于正阳门东城壕，再将泄于三里河水闸住并流入大通桥，闸河随时开闭，天旱水小则闭闸潴水，短运剥船，雨涝水大则开闸泄水，以行大舟。况河道闸座现成，不用增造，官吏闸夫现有，不须添设。……止是闸座河渠间有决坏淤浅处，要逐加修浚，较之欲创三里河工程甚省。况前元创开此河，漕运七八十年，公私便宜，后来废弛。今若复兴，则舟楫得以环城湾泊，粮储得以近仓上纳，在内食粮官军得以就近关给。通州该上纳粮储又得运来都城。与夫天下百官之朝觐，四方外夷之贡献，其行李方物皆得直抵都城下卸。……乞敕各该衙门会计物料，量拨官匠并在营现操官军人等，自西山玉泉一带并都城周围堑及大通桥直抵通州张家湾一路河道，分工逐一修浚。如此，则不惟省一时粮运之脚费，实足以垂万世无穷之利益矣。”成化十二年（1476年）六月，“浚通惠河成。自都城东大通桥至张家湾浑河口六十里，与卒七千人，费城砖二十万，石灰一百五十万斤，闸板桩木四万馀，麻、铁、桐油灰（《日下旧闻考》中此字作炭_作者）各数万。计浚泉三，增闸四，凡十月而毕”。但因水源不足，河制窄狭，不过二年而浅涩如旧，舟不畅通。弘治、正德年间，又屡命疏浚通惠河，无奈因大小臣工不肯实心任事，又为奸人嗜利之徒从中阻挠，故功不果就。直至嘉靖六年（1527年），巡仓御史吴仲再倡其利，语云：“通州运河元时郭守敬创建，已有明效。……今通流等八闸遗迹尚存，原设官夫俱在，因而成之为力甚易。……诚令闸运，岁可省脚价银二十馀万。又汉、唐、宋时，漕皆从汴、渭直达京师，未有贮国储于五十里之外者。今令京军支粮通州，率称不便。而密云诸处皆有间道可通，设虏因乡道，轻骑疾驰，旋日可至，烧毁仓庾，则国储一空，京师坐困，此非细故。请以臣言下户、工二部定议修浚，僦舟夫略运百万，诚与陆运兼行，浚次第就渠径达京仓，此兴无穷之利，而杜不测之虞于计便”。翌年，整治通惠河成，粮运自通州俱由水路达京师。吴仲等虑及修浚通惠河成功不易，持久为难，特提出如下切实措施，以求长久不废：\n“大通桥至通州石坝，地势高四丈，流沙易淤，宜时加浚治。管河主事宜专委任，毋令兼他务。官吏、闸夫以罢运裁减，宜复旧额。庆丰上闸、平津中闸今已不用，宜改建通州西水关外。剥船造费及递岁修捻，俱宜酌处。”又“请留督工郎中何栋专理其事”。\n后来，吴仲出任浙江处州知府，还编撰一部《通惠河志》，详述通惠河事。由于吴仲这次主持整治通惠河，无用半年时间即取得成功，从此漕船直达都下，迄于明末不衰。因此，不仅当时就受到嘉靖皇帝的嘉奖，而且后人在通州专建一座通惠祠，以纪念这位对国家和人民有功德之人。颜琼所撰《通惠祠碑记略》云：\n“国家建都幽燕，岁漕自东南抵（张家）湾，僦车牛，资丁壮，陆挽以达京师，费脚价钜万。先是元郭守敬谓京西北白浮神山诸泉可瀹，以省搬运之苦。成化、弘治间，言者交章，每为异论所乘，事辄中罢。嘉靖丁亥（六年），毗陵吴公仲以御史按京储，周视水道，尽得其状，抗疏以闻。诏命仲专董其役。于是斥山通泽，决去陀泐漫漶，而泉流始清；塞诸水之罅漏旁溢者，而小川始入则壤。置闸鳞次，转运皆有程度，水利大通，千艘衔尾，直达都门。公去后数十年，民益思之，相与立祠岁祀焉”。\n除大通河外，还有昌平河、密云河、蓟州河等漕道，都是为供应昌平、密云、蓟州等地驻军的粮饷而开浚的。\n昌平河即温榆河，舟船从通州溯流而上，可达沙河巩华城外安济桥，以转运守卫皇陵官军粮饷。航程约145里，其中有30里淤浅难行处。隆庆六年（1572年）进行一次大规模疏浚，遂成畅流，能运给长陵等八卫官军月粮40000石。万历元年（1573年），又疏浚巩华城外旧河，进一步提高了昌平河漕运能力。\n密云河指密云以下一段潮白河。辽、金、元时，潮河与白河在顺义县牛栏山会合，共道而至通州，下为通济河（北运河）。由通州至牛栏山可用驳船转运给密云、古北口等地驻军的粮饷。但由牛栏山往上，潮、白二河分流，水浅沙壅，不通舟船，需陆路转运。嘉靖中，总督刘焘曾发卒浚牛栏山以上潮河，用小舟从通州向密云转粟。嘉靖三十四年（1555年），总督蓟辽、保定军务都御史杨博疏请并获准开通密云白河以济粮运。其法是于杨庄地方堵塞向西南流的白河，使之循其故道侧密云城西向南流；同时，于密云东南堵塞向西南流的潮河，使之从密云城南向西流。这样一来，二河于密云城西南河漕庄会合，流向牛栏山。为防密云城墉不被白河水冲啮崩塌，乃于密云城西北修筑泊岸。这一工程人称“遏潮壮白”。由于牛栏山以上潮白河已共道，水量大增，漕船从通州可以直抵密云城下，对于改善驻守北京东北大门主客兵的粮饷供应具有重要意义。至隆庆六年（1572年），蓟辽总督刘应节疏陈密云改河通漕的好处。语云：\n“密云环控潮、白二河，若天开以便漕者。向以二水分流，至牛栏山而上始合，故剥船自通州而上者，至牛栏山而止。若至隆庆仓，则雇觅车骡，从陆输挽，军民艰辛之苦，水次露积之虞，难一悉状。前总督杨博题改河资运，直接密云，备陈四利，预防一害，已有成议，因循至今。两河之流已为一派，水益深则漕益便。所谓四利者已举，而一害已除矣。然又有十利焉。密云招商买米，每石常至一两，今漕粮足岁支之额，免厚价以招商，一利也。往昔主客之粮，岁买不下十万，客兵则尽赖召买，今加复原额，即客兵悉有赖焉，二利也。发漕米一石于密云，则扣折色价一石于部，若只照7钱扣留存库，而以5钱折色放军，在密云每石商价已省3钱，在部扣则折色支放每石又馀2钱，发一石之米存5钱之价，三利也。主客之兵欲折则折，欲米则米，随时应之，不为所窘，四利也。荒歉不能为之灾，烽警不能为之绌，五利也。军储所在，民用资之，耕农虽少，米价不腾，六利也。舟运抵城，直输入仓，则陆运脚价可省，每岁计之，亦得万馀，而民间车驴更免拘集，七利也。通仓粟米腐积，各军领每为蹙额，今移通仓应贮之粟以漕于密云，而以密云扣存之折色给通仓应领之军，则通给无邑腐之粟，京军有实受之惠，八利也。漕米既足，岁计已充，民间招商买米之苦可以苏息，九利也。漕艘鳞集，则商舶踵至，市廛日充，民生日阜，十利也。臣等亲自放舟，自镇城由牛栏山至顺义一带通行无碍，则四利兼得，一害不生，而十利亦渐次可举矣”。\n蓟州河是运输蓟州官军粮饷的河道。明初，靠海运饷蓟州，由海入蓟运河口而达蓟。天顺二年（1458年），新开直沽河，阔5丈，深1丈5尺。成化二年（1466年）和二十年（1484年），先后两次疏浚。又浚鸦鸿桥河道（今丰润县还乡河），运粟十万石以饷蓟州东路。正德十六年（1521年），运粮指挥王瓒以“直沽东北新河，转运蓟州，河流浅，潮至方可行舟，边关每匮饷”为由，建言“宜浚使深广”。嘉靖元年（1522年），始定二年一浚之制。十七年（1538年），再浚殷留庄大口至旧仓店河道160里。明代之所以如此重视蓟州河漕道，是因为蓟镇实为卫护京师安全的东大门，从古北口至山海关的千里长城防线上屯驻的重兵，皆归蓟镇总兵官节制。\n明代运河的漕运，法凡三变。初为支运，后改兑运并参以支运，又改长运而制定。所谓支运，是令江西、湖广、浙江等粮户自运粮至淮安仓，再由浙江、南直隶军自淮安运至徐州仓，京卫军自徐州运至德州仓，山东、河南军自德州运至通仓、京仓。这种以次递运法，称为“支运”。每年四次，运粮达3000000石以上。支运法兴，而海、陆二运皆罢。但未行几年，运粮官军或被调去营造，或被派遣出洋，支运难以坚持，遂令江南及各地粮户自运粮至北京，但常因路遥违期，有误供给。宣德四年（1429年），改造支运之法，即让江西、湖广、浙江民运粮1500000石至淮安仓；苏州、松江、宁国、池州、庐州、安庆、广德诸府民运粮2740000石于徐州仓；应天、常州、镇江、淮安、扬州、凤阳、太平、滁州、和州、徐州民运粮2200000石于临清仓，再由官军从各仓接运京、通二仓。而山东、河南、北直隶由粮户直接运入京仓，不用支运。后来，山东、河南粮皆运至德州仓。故支运亦称“民运”。\n宣德六年（1431年），因江南民运粮，往返几一年，误农误事，遂生“兑运”之法。所谓兑运，即令江南粮户运粮至淮安、瓜洲（在长江北岸），河南粮户运粮至小滩（在大名府卫河边），山东粮户运粮至济宁，然后分别兑与卫所，由官军转运北上。故兑运之法又称“转搬法”。政府根据路途远近，给与兑运官军以路费和加耗米有差。军得补贴之惠，民省路遥之艰，军民两便，皆乐从事。兑运不尽之粮，仍令民自运至就近之仓收纳；不愿兑运者，听民自运。此后，兑运参以支运，至正统初，年运粮达4500000石之数，内中兑运者2800000石，淮、徐、临、德四仓支运之粮只占十之三四。\n成化七年（1471年），为避免兑运中官军勒索之弊，应天巡抚滕昭命令运粮官军直接分赴江南水次交兑，政府除给加耗米外，还每运1石多给米1斗，作为渡江费。当然，包括加耗在内多给运粮官军的米粮，都出在纳粮户身上，也就是说，粮户需要额外多交一些粮。此后数年，乃命原由淮安、徐州、临清、德州四仓支运的700000万石米，悉改水次交兑，由是所有的漕粮悉由官军长运，遂为定制。长运之法又称“直达法”。\n景泰以前，漕船大小不限，为数至多。天顺以后，定船数为11770艘，运粮官军120000人。起初，运至京师的漕粮未有定额，成化八年（1472年）始定4000000石。成化间规定了各地漕船运粮至京的期限，北直隶、河南、山东为五月初一日；南直隶为七月初一日，其过江支兑者延迟一个月；浙江、江西、湖广九月初一日。万历间，又将此期限提前一二个月。嘉靖中，对漕船过淮河的期限都作了具体规定。景泰二年（1451年）始设漕运总督官，驻淮安，总理漕务。\n明代后期，运道艰阻，部分漕粮改折征银，故运抵北京的漕粮渐少，至万历三十年（1602年）仅有1，380，000石。迨至天启、崇祯年间，天下萧然烦费，岁供愈不足支矣。\n清踵明后，亦定鼎于燕，漕运仍是关系国计民生的大政要务。清初漕运，盖仍明旧，用屯丁长运。“逮至中叶，会通河塞，而胶莱故道又难猝复，借黄转搬诸法行之又不能无弊，于是宣宗采英和、陶澍、贺长龄诸臣议复海运，遴员集粟，由上海雇商转船漕京师，民咸称便，河运自此遂废”。\n清前期的大运河漕运，局部运道与明代有别。例如，康熙二十五年（1686年），河道总督靳辅主持在宿迁、桃源、清河三县的黄河北岸开凿了一条新河，名曰中河。明代，这里的运道即黄河，称“河漕”。清开中河后，漕船经行黄河不过数里即入中河，成功地避开黄河180里之险，明代的所谓“河漕”遂废。后任河道总督于成龙废弃中河之下段，于稍远黄河处另凿60里长的一段新河，名曰新中河。至康熙三十九年（1700年），又一任河道总督张鹏翮截用旧中河上段与新中河下段，合为一河，重加修浚，运道称便。又如，嘉庆十三年（1808年），通州大水，康家沟坝冲决成河，张家湾河道遂淤。张家湾是明代漕运的终点码头之一，这次河道被淤后，虽然曾有清淤以恢复运道之议，但未落实。因此，通州以南的张家湾白河运道，也向东迁移而远离张家湾了。\n清代在大运河的治理上，较明代投入更多，成效尤为显著，所治理的重点是江苏北部黄河、淮河、运河交流地区，“由是治河、导淮、济运三策，群集于淮安、清口一隅，施工之勤，糜帑之钜，人民田庐之频岁受灾，未有甚于此者”。其中，靳辅及其幕客陈潢功不可没。此外，对山东西境的闸漕运道和相关的泉、湖以及卫河、白河漕道的治理工程，也不断兴举。于北京附近的疏治漕运水道工程，较重要的有：乾隆五十四年（1789年），浚通惠河、朝阳门外护城河及温榆河。嘉庆十二年（1807年）疏浚温榆河。光绪十二年（1886年），潮白河在通州北平家疃决口，东趋夺箭杆河道，未几堵复运河故道；转年，又决又堵。其中，浚通惠河与朝阳门外护城河，可用驳船从通州向京城转漕。疏浚温榆河与堵塞决口东趋的潮白河，是为了保证北运河漕道有足够的水量。此外，清代曾利用清河向圆明园八旗驻军拨运粮米，也曾藉潮白河水向密云驻军转运部分粮饷。\n清代的漕运制度，与明有同有异。漕粮有正兑、改兑、折征、改折、白粮、截漕、拨运等之分。输纳京仓者曰正兑，输纳通仓者曰改兑，折银征纳者曰折征，折合黑豆征纳者曰改折，输纳内务府专供皇宫和百官廪禄用糯米曰白粮，奉命中途截留地方备用者曰截漕，分运至蓟州者曰拨运。顺治二年（1645年）奏定，每岁额征漕粮四百万石。其中，正兑米360万石，改兑米70万石，定额分配各省。各省漕运之船，原额共14550号，但至嘉庆中，实存6242艘。凡漕船载米，不得过500石。每船旗丁十人。按例允许旗丁捎带土产私货百石。各省漕粮过淮时间亦有定限。总理漕政者为漕运总督，驻淮安，直隶、山东、河南、江西、江南、浙江、湖广七省文武官吏经理漕务者皆属焉。另有同知、通判、千总等文武官，负责监兑、押运、领运等。乾隆间，设巡漕御史四员，分驻淮安、济宁、天津、通州，巡察漕务。因漕粮为天庾正供，故对司运官吏考成綦严。\n北运河为漕道总汇，通州则为漕运会归。清冯应榴氏撰写一段文字，详细反映了清代通州漕运盛况。文曰：\n“此余于乾隆丙申（四十一年）以考功郎中奉使坐粮时，倩京口江萱所绘《潞河督运图》也。图中往来船舫，系于漕者十之七八，其一二瓜皮艇，则稽察征榷之用，坐粮使者所兼司也。漕艘之中，植两樯，而扬帆捩舵，衔尾以进，或已泊如鳞比者，为重运；卷帆抽舵，以尾推行者，为回空。回空必让重运先行，违者有罚。以布袋盛米麦黍豆于船，船约百馀袋，袋各一石。无蓬窗而以篙徐进者，为剥载。坐粮之运役曰经纪，曰车户者司之。盖潞河水浅舟多，不能齐达坝下，故别以船剥。坝有石有土，石坝在北门外，通州州判掌之，有楼曰大光，义取损上以益下也。满、汉仓场侍郎暨坐粮者，恒于斯茇憩凭眺焉。坝前为潞河，后即通惠河。隔潞河三四丈许，幅旁樯游小露者，是已运十三京仓之漕抵石坝，由大光楼下，背负而入通惠，肩踵相接，日数万人。通惠每闸有船，亦经纪司之。过闸负运者，谓之水脚，并隶使者所辖。至大通桥以上，则监督之职矣。石坝之北有浮桥，为榷税十三口之一。近东门者为土坝，州同兼掌之。运通州西中仓之漕，由坝而入城河，舟运至旧南门者，贮中仓；新南门者，贮西仓。城以内皆车运，故司事之役总曰车户，他政均与石坝相类。至中流饱帆而放棹者，即余官船。每漕艘抵通，使者曰乘舟往验其高下，乃分坐于各仓，并以时赴津门督催之。小舟飞浆，捧盘来迎余舟者，即取验之粮，以粮散盛于舟尾。漕艘而行者，杨村官给之剥载也，形如虚业，系绳于端，牵岸上者曰刮板，牵之者为浅（当为纤）夫，负柳枝行者为标夫。潞河沙易胶壅，非疏浚可施，惟时刮沙，俾随水去，无阻运足矣。好事者以新意改制，辄无益而止。又河之深浅无定，必以柳枝标识浅处，使漕艘望知避焉。夫漕为理财之一端；坐粮，司漕之一职耳。顾粗举规制，百不罄一，已繁重若是，矧其涉江淮河数千里，以挽纳神仓者乎？司漕诸君子，苟不以爱民恤丁，洁其身奉职为念，其何以副朝廷惠下之仁，任人之意乎？览斯图者，当亦有感于余言已”。\n虽然这段文字是冯氏观览江氏所绘《潞河督运图》后而写的，有解说图义之意，但因冯氏曾任坐粮官，熟悉通州漕运情况，所写真实地反映了清代通州漕运盛况，值得重视。\n清末铁路兴起。光绪二十六年（1900年）始，南漕改用火车由津运京。次年以财用匮乏，谕：“自本年始，直省河运海运，一律改征折色，责成各省大吏清厘整顿，节省局费运费，并查明各州县征收浮费，勒令缴出归公，以期汇成巨款”。于是，盛行数百年的大运河漕运成为历史。\n",
    "出处": "侯仁之.北京城市历史地理[M].北京：北京燕山出版社,2000.412-423",
    "交通工具": null,
    "交通要道": "明清北京城的漕渠和漕运",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.91
      ]
    ]
  },
  {
    "时期": "春秋战国",
    "原文": "如果说在远古时代是众多的河湖水道阻碍了河北平原上南北交通发展的话，那么最迟在春秋战国时代，沟通燕国（都蓟）和齐国（都临淄）的一条大道已经踏辟出来了。\n公元前685年，姜小白登上齐国王位，是为齐桓公。在著名政治家管仲的辅佐下，大力进行改革，国势益盛，国力益强。时仅7年，齐桓公即成为春秋时代第一个诸侯霸主。这时候，燕国是燕庄公执政。燕国以北山区有一个势力颇为强大的山戎部族，常南下侵扰，严重威协着燕国安全。燕庄公二十七年（公元前664年），山戎复大举来犯。燕国势危，求救于齐。次年，齐桓公亲自率兵讨伐山戎，向西打到居庸关外，向东打到离支、孤竹，大获全胜，解除了燕国的危难。当齐桓公班师回国的时候，大概出于感激，燕庄公以礼相送，一直送出燕国国境，进入齐国地界。或许燕庄公的举动感动了齐桓公，于是，齐桓公以大国国君的气度，当即把燕庄公相送所到的地方割给了燕国，并在这里修筑了一座城，命名为“燕留城”，作为纪念。这个燕留城在哪里呢？唐人李泰著《括地志》云：“燕留故城在沧州长芦县东北17里”。唐长芦县城在今河北沧州，也就是说，燕留城在今沧州东北17里。由此可见，齐桓公伐山戎时，来回是经河北平原东部或者说是途经渤海西岸的。在这之后，齐伐燕、燕攻齐的事屡有发生，其中最著名的是战国后期齐宣王伐燕和燕将乐毅伐齐。\n公元前320年至前312年，燕王哙在位期间，由于燕王哙沽名钓誉，昏庸无能，将燕国大权禅让给国相子之，“国事皆决于子之”。子之为巩固自己的权力和地位，与拥有相当势力的燕王哙的太子平之间展开一场争权夺利的严重斗争，闹得“众人恫怨，百姓离意”，燕国面临危难局面。这时，齐宣王乘人之危，发兵攻打燕国。燕国士卒无心也无力抵抗，国都城门大开，齐军如入无人之境，烧杀抢掠，把燕国的珍宝重器洗劫一空。燕王哙命归西天，国相子之也被人剁成肉酱，燕国蒙受了巨大损失和耻辱。国难之后，燕国立公子职为王，是为燕昭王。燕昭王招贤纳士，励精图治，“乐毅自魏往，邹衍自齐往，剧辛自赵往，士争凑燕”。燕昭王二十八年（公元前248年），燕国以乐毅为上将军，联合韩、赵、魏、秦、楚五国，共同伐齐，大败齐国，攻下齐国七十余城，只有莒和即墨城未破。燕军攻入齐都临淄，不仅把以前齐国从燕国抢掠去的东西都收了回来，连齐国的珍宝器物也都尽掠回燕国。乐毅为燕国报了国仇，因此被封为昌国君。\n从上述春秋战国时代燕、齐两国间发生的你攻我伐的战争来看，燕国与齐国之间，特别是燕都蓟城与齐都临淄之间，必定有一条通途大道。无论是齐国侵燕，还是燕国伐齐，都很难想象是通过太行山东麓大道进退的。只有在渤海西岸不远的地方开辟一条新路，燕齐之间的相互攻伐才有可能进行。既然齐桓公时修筑的燕留城在今沧州东北17里，那么这条新开辟的连通燕齐两国的大道必定通过沧州附近。这条南北大道，不妨称之为渤海西岸大道。（参见前图9-1）\n",
    "出处": "侯仁之.北京城市历史地理[M].北京：北京燕山出版社,2000.354-356",
    "交通工具": null,
    "交通要道": "渤海西岸大道",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.38,
        39.95
      ]
    ]
  },
  {
    "时期": "春秋战国",
    "原文": "北京地区有众多的河流，大都东流注入大海。河道水浅以致时常淤塞，不利航行。主要的河流有永定河、潮白河、拒马河、泃河。永定河是北京地区最大的河流，从门头沟三家店进入平原后流向东南，跨过丰台，流经房山与大兴区的交界线，在大兴南部与河北省交界处转向东流，注入渤海。永定河最重要的渡口位于卢沟桥一带，是沟通东西交通的枢纽。潮白河发源于蒙古高原，上游分潮河和白河，两河从北面进入北京地区后在密云县北汇成一支，然后流经通州向东南入海。潮白河在通州东的白庙渡口，是通往东北道路的重要渡口，也是通往中原与通向东北道路的重要连接点。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.22",
    "交通工具": null,
    "交通要道": "水上交通状况",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "春秋战国",
    "原文": "榆塞孔道，位于燕山山麓东端与渤海之间。从北京通州向东，沿燕山山脉南麓，经河北省三河、天津市蓟县、河北省玉田、唐山市北、卢龙，过秦皇岛北面，再东北行10公里到达今山海关（古渝关）。卢龙塞孔道，位于燕山山脉东段，河北遵化东北、唐山与承德交界处，是滦河（古濡水）劈山而成的沟通南北的天然谷道。汉设亭关，唐称卢龙塞，宋辽复称松亭关，明称喜峰口关。卢龙塞是北京通往东北平原和蒙古高原的要道，往东可达大凌河流域（位于辽宁西部，流经朝阳、凌海），北上可通西辽河上游及蒙古高原东部。从北京到卢龙塞孔道，大致从通州往东，经河北省三河、天津蓟县再转向东北，过河北遵化前行60公里左右。古北口孔道，位于密云西北燕山山脉中段的蟠龙山与卧虎山之间。古北口在唐代称为北口，五代时叫做古北口，金称铁门关，是北京经承德通往蒙古高原东部和东北平原的重要隘口。潮河发源于蒙古高原。从密云县城进入山区，沿着潮河河谷前行几十公里可达古北口。再穿过丘陵地带，可到达承德。军都陉孔道，位于昌平区西北的军都山。南端今称南口，北口即为八达岭岭口。全长20公里，居庸关就建造在沟中最狭窄处，是北京的西北门户。从军都关经延庆，可达河北省张家口。从张家口往西南可达山西大同，往北可通往蒙古高原。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.20-21",
    "交通工具": null,
    "交通要道": "北京通往东北地区的道路",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.91
      ]
    ]
  },
  {
    "时期": "春秋战国",
    "原文": "春秋战国时期北京地区之内的交通道路，发展得也更为密集。这一时期城市的发展和经济交流，为改善交通提供了基本的动力。当时各国的大城市一片繁荣，汉人桓宽记载：“燕之涿、蓟，赵之邯郸，魏之温、轵，韩之荥阳，齐之临淄，楚之宛、陈，郑之阳翟，三川之二周，富冠海内，皆为天下名都，……居五诸之冲，跨街衢之路也。”这些都城如此兴旺，无非是因为居于枢纽之地，修建了宽阔的街道。北京各区县发掘出了春秋战国时期的许多古城遗址，表明那时的城镇数量已经很多。公元前316年，燕王哙禅让君位与相国子之，结果引发燕国内乱，给临近的齐国、中山国提供了可乘之机。中山国在燕“奋枹振铎，辟启封疆，方数百里，列城数十，克敌大邦”。城镇之间的相互往来，构建了当时北京地区的主要交通体系。春秋战国时期，燕国的都城已经从房山区琉璃河董家林迁移到了蓟城，即北京老城区西南的广安门外。战国时期，燕国还在今河北省易县营建了下都，还有见于《太平寰宇记》所载的中都，其地在今北京房山区。1959年在房山区窦店镇西窦店村与芦村相交处，发现了一座土城遗址。根据地理位置判断，有学者认为这就是燕中都。作为燕国的都城，三都之间的联系应该相当密切，因此也就形成了连结它们的重要交通路线。在北京的不少区县，都有春秋战国至秦汉的古城遗址。它们或者作为军事要地而修建，或者由于行政原因而设置，还有一些因为经济发展而形成的城镇。政治、军事或者经济的需要，使这些城镇必须处在重要的交通线上，这样才便于人们往来其间。所以，春秋战国时期燕国林立的城镇，为我们呈现了当时日渐发达的交通状况。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.20",
    "交通工具": null,
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.38,
        39.95
      ]
    ]
  },
  {
    "时期": "春秋战国",
    "原文": "战国时期燕国的对外交往和开拓有了显著发展，尤其在燕昭王即位后励精图治，燕国势力达到全盛，甚至跻身七雄之列。战国初期，燕国还未卷入中原的争雄战争。然而，燕国所处的位置对争雄的诸侯国很有帮助，在苏秦游说燕文侯时就剖析得十分明了，亦可以探寻出当时燕国与他国的道路交通状况。\n苏秦将为从，北说燕文侯曰：“燕东有朝鲜、辽东，北有林胡、楼烦，西有云中、九原，南有呼沱、易水。地方二千余里，带甲数十万，车七百乘，骑六千匹，粟支十年。南有碣石、雁门之饶，北有枣栗之利，民虽不由田作，枣栗之实足食与民矣。此所谓天府也。夫安乐无事，不见覆军杀将之忧，无过燕矣。大王知其所以然乎？夫燕之所以不犯寇被兵者，以赵之为蔽于南也。秦、赵五战，秦再胜而赵三胜。秦、赵相弊，而王以全燕制其后，此燕之所以不犯难也。且夫秦之攻燕也，逾云中、九原，过代、上谷，弥地踵道数千里，虽得燕城，秦计固不能守也。秦之不能害燕亦明矣。今赵之攻燕也，发兴号令，不至十日，而数十万之众，军于东垣矣。度呼沱，涉易水，不至四五日距国都矣。故曰：秦之攻燕也，战于千里之外；赵之攻燕也，战于百里之内。夫不忧百里之患而重千里之外，计无过于此者。是故愿大王与赵从亲，天下为一，则国必无患矣。”（16）\n当时燕国的势力包括今北京、河北北部、山西东部以及辽西，与齐、赵毗邻。燕国北通秦晋，南近赵，东通齐鲁等国，在兼并战争中便于向南北用兵，对有意争雄的诸侯国来说，可谓“有所附而无不重”（17）。\n燕国强盛时的势力向东北已经达到了朝鲜，“朝鲜王满者，故燕人也。自始全燕时尝略属真番、朝鲜，为置吏，筑鄣塞”。（18）从燕通往东北的道路，史籍中没有详细记载，但尚有线索可寻。从云中经九原、代郡，就到了燕国的上谷郡。不止于此，还有其他道路可通往燕国。燕昭王时，“燕有贤将秦开，为质于胡，胡甚信之。归而袭破走东胡，东胡却千余里。……燕亦筑长城，自造阳至襄平。置上谷、渔阳、右北平、辽西、辽东郡以拒胡”。（19）燕国的长城从造阳至襄平。造阳，据《史记集解》引韦昭曰：“在上谷”。汉代上谷郡治所在今河北省怀来，襄平在今辽宁省辽阳。渔阳郡、右北平、辽西郡、辽东郡的治所，分别在今北京怀柔、天津蓟县、辽宁义县、辽宁辽阳。燕国为防止东胡的入侵，显然有通往五郡的道路。燕国与赵国则仅隔易水，交通十分便利。\n",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.18-19",
    "交通工具": null,
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.91
      ]
    ]
  },
  {
    "时期": "汉",
    "原文": "幽州通东北的另一条道路是沿渤海而行，称为傍海道。这条道路由于受雨季影响，在东汉末已经不是很常用了。建安十二年，曹操为扫平袁绍的残余势力、奠定稳固的北方出征乌桓。“夏五月，至无终。秋七月，大水，傍海道不通，田畴请为乡导，公从之。引军出卢龙塞，塞外道绝不通，乃堑山堙谷五百余里，经白檀，历平冈，涉鲜卑庭，东指柳城”。曹操由幽州蓟城出兵至无终（今天津蓟县），向东北出卢龙塞（今河北卢龙），沿渤海旁道路经白檀（今河北滦平北）向北至平冈（今内蒙古宁城西南），大败鲜卑于白狼堆（今辽宁建昌西北），最后向东北直捣柳城（今辽宁朝阳）。这条由北京经过卢龙塞通往东北的道路，以后成为军事家经常的选择。东晋永和六年（350），前燕慕容儁出师讨伐占据幽州的后赵，自龙城（今辽宁朝阳）趋卢龙塞，驻军无终，然后攻陷蓟城。从东北到幽州的道路，还可以由龙城经大漠，沿燕山北麓向西，从居庸关进入幽州地区。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.34",
    "交通工具": null,
    "交通要道": "傍海道",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.38,
        39.95
      ]
    ]
  },
  {
    "时期": "汉",
    "原文": "经居庸关和卢龙塞所在的道路，日渐发展为幽州通往西北以及东北的重要途径，历史上的大量战争与这两个关塞相联系。北魏时期，六镇镇兵起义：\n杜洛周反于燕州，仍以（常）景兼尚书为行台，与幽州都督、平北将军元谭以御之。景表求勒幽州诸县悉入古城，山路有通贼之处，权发兵夫，随宜置戍，以为防遏。别敕谭西至军都关、北从卢龙塞，据此二险，以杜贼出入之路。又诏景，山中险路之处，悉令捍塞。景遣府录事参军裴智成，发范阳三长之兵以守白■，都督元谭据居庸下口。俄而安州石离、冗城、斛盐三戍兵反，结洛周，有众二万余落，自松岍赴贼。谭勒别将崔仲哲等截军都关以待之。仲哲战没，洛周又自外应之，腹背受敌，谭遂大败。贼既南出，钞略蓟城。景命统军梁仲礼率兵士邀击，破之，获贼将御夷镇军主孙念恒。都督李琚为贼所攻蓟城之北，军败而死。景率属城人御之，贼不敢逼。洛周还据上谷。授景平北将军、光禄大夫，行台如故。洛周遣其都督王曹纥真、马叱斤等率众蓟南，以掠人谷。乃遇连雨，贼众疲劳。景与都督于荣、刺史王延年置兵栗园，邀其走路，大败之，斩曹纥真。洛周率众南趋范阳，景与延年及荣破之，又遣别将军重破之于州西彪眼泉，禽斩之及溺死者甚众。\n杜洛周在燕州发动起义，北魏幽州行台常景与幽州都督控制了军都关（居庸关）和卢龙塞，以防止起义军攻入蓟城或流动作战，击败了困守幽州地区的杜洛周，这也说明了居庸关与卢龙塞通道对幽州地区在交通和军事上的重要意义。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.34-35",
    "交通工具": null,
    "交通要道": "幽州通往西北以及东北",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.38,
        39.95
      ]
    ]
  },
  {
    "时期": "汉",
    "原文": "秦汉之际，幽州地区与华北平原的交通已比较便捷。沿太行山东麓修筑的驰道，为幽州通往中原提供了基础。这里居于华北平原北端，地接边塞，是多民族融合汇聚之处。西通关中，东接辽东，无论是进兵关中与西北大漠、东进蒙古高原和东北平原，还是控扼华北平原，兼并齐鲁，幽州地区都处在极其理想的战略位置。自秦汉以来，作为防御匈奴、鲜卑、乌桓的要塞，幽州逐渐发展成为军事重镇，具有不容忽视的地位。因此，幽州成为各种政治势力争夺中原的前哨阵地，由此进兵华北平原，是一条重要的交通路线。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.35-36",
    "交通工具": null,
    "交通要道": "进兵华北平原",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.91
      ]
    ]
  },
  {
    "时期": "汉",
    "原文": "西汉末年，刘秀凭借华北地区的有利条件赢得了天下。《后汉书·邓训传》注引《汉官仪》：“中兴以幽、冀、并州兵克定天下，故于黎阳立营，以谒者监之。”在反对王莽政权的起义中，刘秀受更始帝之命招抚河北。更始二年，邯郸王朗称帝，刘秀为避其锋芒，转奔幽蓟，后南下反击王朗。刘秀从蓟城向西南奔至涿郡饶阳，在定州深泽县东南渡过呼沱河，进入信都郡，聚集了自己的势力。北击中山（今河北定州），然后攻下真定（今河北正定），随即南下攻占钜鹿，由此奠定了攻下冀州的基础。《后汉书·耿弇传》载：\n会王郎诈称成帝子子舆，起兵邯郸。弇从吏孙仓、卫包，于道共谋曰：“刘子舆成帝正统，舍此不归，远行安之？”弇按剑曰：“子舆弊贼，卒为降虏耳。我至长安，与国家陈渔阳、上谷兵马之用，还出太原、代郡，反覆数十日，归发突骑以辚乌合之众，如摧枯折腐耳。”弇道闻光武在卢奴，乃驰北上谒，光武留署门下吏。弇因说护军朱祐，求归发兵，以定邯郸。光武笑曰：“小儿曹乃有大意哉！”因数召见加恩慰。弇因从光武北至蓟。……会蓟中乱，光武遂南驰，官属各分散。弇走昌平就况（按：耿弇之父耿况），因说况使寇恂东约彭宠，各发突骑二千匹，步兵千人。弇与景丹、寇恂及渔阳兵合军而南，所过击斩王郎大将、九卿、校尉以下四百余级，得印绶百二十五，节二，斩首三万级，定涿郡、中山、钜鹿、清河、河间凡二十二县，遂及光武于广阿。是时光武方攻王郎，传言二郡兵为邯郸来，众皆恐。既而悉诣营上谒。光武见弇等，说，曰：“当与渔阳、上谷士大夫共此大功。”乃皆以为偏将军，使还领其兵。加况大将军、兴义侯，得自置偏裨。弇等遂从拔邯郸。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.35-36",
    "交通工具": null,
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.38,
        39.95
      ]
    ]
  },
  {
    "时期": "汉",
    "原文": "汉武帝时期征伐朝鲜，元封三年夏，“朝鲜斩其王右渠降，以其地为乐浪、临屯、玄菟、真番郡”。汉王朝对东北的经营进一步加强，“彭吴穿秽貊、朝鲜，置沧海郡，则燕齐之间靡然发动”。连续的用兵引起了幽州乃至渤海一带的社会骚动。西汉向东北开疆拓土，经过幽州通往东北的道路日益重要，东北各民族通过右北平、渔阳、上谷、太原等郡，与汉朝频繁通使和贸易往来。从西汉末年开始，东北民族的势力通过幽州至东北的交通线，内侵到边郡地区。东汉“建武二十五春正月，辽东徼外貊人寇右北平、渔阳、上谷、太原，辽东太守祭肜招降之”。从此以后，幽州地区前往东北的道路一直维持畅通。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.34",
    "交通工具": null,
    "交通要道": "幽州地区前往东北的道路",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.91
      ]
    ]
  },
  {
    "时期": "汉晋",
    "原文": "从幽州通西北的道路，素代已经形成规模。由于匈奴兴盛，秦王朝营建了关中到西北边塞的直道以及塞上大道与长城，以抵御匈奴的进犯。西汉时期匈奴更盛，长城之外尽是其势力范围，“诸左王将居东方，直上谷以东，接秽貉、朝鲜；右王将居西方，直上郡以西，接氐、羌；而单于庭直代、云中。各有分地，逐水草移徙”。强盛的匈奴乘秦末战乱、西汉初期贫乏的时机，对汉朝北边侵扰不断。汉代云中、雁门、代郡、上谷、渔阳、右北平、辽西等北边诸郡无不被害，西汉也从诸郡出兵反击。匈奴纵横驰骋于汉朝北部边境，乃至深入长城之内所造成的困扰，令汉武帝坚定了反攻的决心。这里略举匈奴侵入汉时幽州地区渔阳、上谷诸郡的情况：\n后燕王卢绾复反，率其党且万人降匈奴，往来苦上谷以东，终高祖世。\n（元光六年）匈奴入上谷，杀略吏民。遣车骑将军卫青出上谷，骑将军公孙敖出代，轻车将军公孙贺出云中，骁骑将军李广出雁门。青至龙城，获首虏七百级。\n（元光六年）其冬，匈奴数千人盗边，渔阳尤甚。汉使将军韩安国屯渔阳备胡。其明年秋，匈奴二万骑入汉，杀辽西太守，略二千余人。又败渔阳太守军千余人，围将军安国。安国时千余骑亦且尽，会燕救之，至，匈奴乃去，又入雁门杀略千余人。\n（元光七年）安国为材官将军，屯渔阳，捕生口虏，言匈奴远去。即上言方佃作时，请且罢屯。罢屯月余，匈奴大入上谷、渔阳。安国壁乃有七百余人，出与战，安国伤，入壁。匈奴虏略千余人及畜产去。\n（元朔元年秋），匈奴入辽西，杀太守；入渔阳、雁门，败都尉，杀略三千余人。遣将军卫青出雁门，将军李息出代，获首虏数千级。\n（元朔二年春）匈奴入上谷、渔阳，杀略吏民千余人。遣将军卫青、李息出云中，至高阙，遂西至符离，获首虏数千级。收河南地，置朔方、五原郡。\n（元狩元年五月）匈奴入上谷，杀数百人。\n与匈奴的战争，对汉代幽州与塞外及西北的交通影响显著。匈奴为了入侵汉的边郡，对边境路况有一番探寻和发现，而汉朝为了反击匈奴，也着力北边诸郡互通声气、倚为援助。后来，汉武帝为夹击匈奴，特意差遣张骞等通西域，这是汉代开辟塞外交通的壮举。随着版图扩大，在西北开辟道路、设置机构，正式打通了与塞外的交通，进而为幽州与塞外的交通提供了条件。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.29-30",
    "交通工具": null,
    "交通要道": "从幽州通西北的道路",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.91
      ]
    ]
  },
  {
    "时期": "汉晋",
    "原文": "汉代幽州通往西北的孔道，集中在上谷与渔阳二郡。上谷郡居庸县有居庸关，是北京通西北的重要陉道。由上谷、渔阳通西北的道路可大致分为两线：一为幽州通雁门、代郡之路，并由此远及云中、九原等西北塞上诸郡，这是在秦塞北大道基础上形成的通道。另一为通往匈奴腹地，这是从幽州到达塞外的通道。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.31",
    "交通工具": null,
    "交通要道": "汉代幽州通往西北的孔道，集中在上谷与渔阳二郡",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.07,
        40.29
      ]
    ]
  },
  {
    "时期": "汉晋",
    "原文": "在西汉幽州通西北边塞诸郡的道路上，上谷郡的居庸关日渐成为关键通道，东汉之后尤其如此。建武十五年，吴汉“复率扬武将军马成、捕虏将军马武北击匈奴，徙雁门、代郡、上谷吏人六万余口，置居庸、常[山]关以东”。建武二十二年，“匈奴薁鞬日逐王比遣使诣渔阳请和亲，使中郎将李茂报命”。东汉时期匈奴虽然衰微，但新兴的乌桓与鲜卑又成了东汉王朝的边患，居庸关通道变为乌桓与鲜卑进出幽州地区的重要道路。\n乌桓者，本东胡也。汉初，匈奴冒顿灭其国，余类保乌桓山，因以为号焉。……及武帝遣骠骑将军霍去病击破匈奴左地，因徙乌桓于上谷、渔阳、右北平、辽西、辽东五郡塞外，为汉侦察匈奴动静。其大人岁一朝见，于是始置护乌桓校尉，秩二千石，拥节监领之，使不得与匈奴交通。……光武初，乌桓与匈奴连兵为寇，代郡以东尤被其害。居止近塞，朝发穹庐，暮至城郭，五郡民庶，家受其辜，至于郡县损坏，百姓流亡。其在上谷塞外白山者，最为强富。\n鲜卑者，亦东胡之支也，别依鲜卑山，故因号焉。其言语习俗与乌桓同。……汉初，亦为冒顿所破，远窜辽东塞外，与乌桓相接，未常通中国焉。光武初，匈奴强盛，率鲜卑与乌桓寇抄北边，杀略吏人，无有宁岁。……及南单于附汉，北虏孤弱，（建武）二十五年，鲜卑始通驿使。……和帝永元中，大将军窦宪遣右校尉耿夔击破匈奴，北单于逃走，鲜卑因此转徙据其地。匈奴余种留者尚有十余万落，皆自号鲜卑，鲜卑由此渐盛。\n",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.32",
    "交通工具": null,
    "交通要道": "在西汉幽州通西北边塞诸郡的道路上，上谷郡的居庸关日渐成为关键通道，东汉之后尤其如此。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.91
      ]
    ]
  },
  {
    "时期": "汉晋",
    "原文": "东汉建光元年，鲜卑入上谷，然后从马城塞入代郡，进寇居庸关。\n建光元年秋，其至鞑复畔，寇居庸。云中太守成严击之，兵败。功曹杨穆以身捍严，与俱战殁。鲜卑于是围乌桓校尉徐常于马城。度辽将军耿夔与幽州刺史庞参，发广阳、渔阳、涿郡甲卒，分为两道救之。常夜得潜出，与夔等并力并进，攻贼围，解之。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.33",
    "交通工具": null,
    "交通要道": "鲜卑入上谷，然后从马城塞入代郡，进寇居庸关。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.07,
        40.29
      ]
    ]
  },
  {
    "时期": "汉晋",
    "原文": "东汉末年群雄割据，幽州与长安的联系就依靠居庸关至西北的通道。\n初平元年，义兵起，董卓迁帝于长安。幽州牧刘虞叹曰：“贼臣作乱，朝廷播荡，四海俄然，莫有固志。身备宗室遗老，不得自同于众。今欲奉使展效臣节，安得不辱命之士乎？”众议咸曰：“田畴虽年少，多称其奇。”畴时年二十二矣。虞乃备礼请与相见，大悦之，遂署为从事，具其车骑。将行，畴曰：“今道路阻绝，寇虏纵横，称官奉使，为众所指名。愿以私行，期于得达而已。”虞从之。畴乃归，自选其家客与年少之勇壮慕从者二十骑俱往。虞自出祖而遣之。既取道，畴乃更上西关，出塞，傍北方，直趣朔方，循间径去，遂至长安致命。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.33",
    "交通工具": null,
    "交通要道": "幽州与长安的联系就依靠居庸关至西北的通道。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.07,
        40.29
      ]
    ]
  },
  {
    "时期": "汉晋",
    "原文": "田畴就是从居庸关出塞，沿着长城沿线的塞上大道，直奔朔方，然后转向都城长安。\n由居庸关出入，向西通往雁门郡，取飞狐口（今河北涞源县北）入雁门，这是由幽州地区通西北的另一重要道路。东汉初，王霸在上谷，为防御匈奴与乌桓，修建了雁门平城到代郡的飞狐道。建武十三年：\n卢芳与匈奴、乌桓连兵，寇盗尤数，缘边愁苦。诏霸将弛刑徒六千余人，与杜茂治飞狐道，堆石布土，筑起亭障，自代至平城三百余里。凡与匈奴、乌桓大小数十百战，颇识边事。数上书言宜与匈奴结和亲，又陈委输可从温水漕，以省陆转输之劳，事皆施行。后南单于、乌桓降服，北边无事。霸在上谷二十余岁。\n",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.33-34",
    "交通工具": null,
    "交通要道": "沿着长城沿线的塞上大道，直奔朔方，然后转向都城长安。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.07,
        40.29
      ]
    ]
  },
  {
    "时期": "清",
    "原文": "清代北京的陆路交通与明代相比又有较大的发展。主要表现在以下三个方面：\n一历史悠久的居庸关大道、古北口大道、山海关大道、卢沟桥大道等，都获得了新的交通意义，路也修得更好，沿途多建有行宫。例如，顺治十年（1653年），帝巡幸口外，出居庸关，驻跸赤城县汤泉行宫；康熙十一年（1672年）帝奉太皇太后出居庸关，幸赤城汤泉行宫；三十五年（1696年），康熙帝亲征葛尔丹，率大军出居庸关西进，宣化府、大同府“饲马修路，百姓劳苦”。蒙古诸王也因修路、凿井、监牧有功而得到奖赏。古北口大道因承德避暑山庄的修建和清帝年年到木兰围场秋弥而变得更加重要起来。山海关大道是京师与盛京（沈阳）间往来的主要通途，也是清帝展谒祖陵的必经之路。途中于迁安、卢龙、抚宁、临榆皆有行宫。康熙、乾隆等帝屡屡视察畿辅河工和黄河，并多次巡游山东、江浙各地，也三番五次地访游五台山，这些活动多取道卢沟桥，然后向南、向东南、向西南而去。因此，在霸州、文安、大城、保定、清苑、安州等地，皆建行宫，以为巡察永定河、大清河驻跸之所；又于良乡、涿州、新城、雄县、任丘、高阳、河间、献县、交河、阜城、景州……等地，也分别修建行宫，作为南巡黄河、山东、江浙路上的驻跸之所；还于完县、唐县、阜平、曲阳、正定等地各建行宫，作为去五台山游览途中的驻跸处。\n二新增加了几条皇家御道。第一条，出北京朝阳门，东经通州、三河、蓟州，到遵化州昌瑞山清东陵。这条路称东道，为清帝展谒东陵銮辇经行之路。在这条御道上，于三河县燕郊、蓟州白涧庄、桃花山桃花寺、葛山隆福寺、遵化州马兰峪等地，皆建有行宫。因康熙、乾隆帝等谒东陵时，常登盘山揽胜，故有岔道通盘山，建有盘山行宫。第二条，出广宁（安）门，西南经良乡、房山、涿州、涞水，达易州泰宁山清西陵。这条路称西道，为清帝展谒西陵銮辇经行之路。这条御道上，于卢沟桥龙王庙、良乡县黄辛庄、房山县半壁店、涞水县秋澜、易州梁各庄等地，各建行宫。有时也自良乡取道涿州，至新城县高碑店，转经涞水去西陵，故又有涿州行宫。第三条，出东直门，经顺义、怀柔、密云、滦平，达承德避暑山庄和木兰围场。这条路又称北道，实际上是原古北口大道，为清帝每年巡幸热河山庄和去围场秋弥时銮辇往返之路。在这条御道上，于顺义县三家店、怀柔县祗园寺、密云县刘家庄、罗家桥、瑶亭、滦平县巴克什营、两间房、长山峪、王家营、喀喇河屯（滦河）等地，皆建有行宫。有时銮舆出安定门，先至小汤山，然后向东过顺义县南石槽，再奔怀柔县祗园寺行宫；或由圆明园启程，斜向东北行，经清河、蔺沟奔顺义县南石槽，接去怀柔的大道。所以，昌平小汤山、蔺沟和顺义南石槽也有行宫。从承德往木兰围场的道路上，建有钓鱼台、黄土坎、中关、什巴尔台、波罗河屯、张三营、济尔哈朗图、阿穆呼朗图等八处行宫。（附图：北京地区清室行宫分布图）\n因为承德避暑山庄实际上是清王朝的第二政治中心，所以从北京或圆明园至承德的御道格外重要。第四条，出西直门经高梁桥、海淀到畅春园、圆明园、万寿山清漪园（颐和园）、玉泉山静明园、香山静宜园等。北京西郊的“三山五园”，是康熙至乾隆年间，集中巨大的财力物力和人力，精心营建的皇家离宫。特别是号称“万园之园”的圆明园，实为北京皇宫外的另一处皇宫和朝廷，雍正、乾隆、嘉庆、道光、咸丰皇帝经常在这里起居和听政。清末慈禧太后又以颐和园为宫外宫。所以，由京城到西郊园林的御道皆以巨石铺砌，绝无坑洼颠簸、泥淖陷足之虞。在北京近郊的诸多道路中，此路最为重要。此外，因怀柔县东南90里丫髻山（今属平谷县）上有碧霞元君庙，“每年孟夏，四方之民会此祈祷者，并肩叠迹，不可胜计”。康熙五十二年（1713年），适值康熙帝六旬大寿，遂于此山增建玉皇阁，并举行隆重的庆寿祝禧典礼，四方臣民纷纷前往观瞻。此后，丫髻山碧霞元君庙香火益盛，清皇室亦常常去进香。所以，出东直门经顺义东去丫髻山的道路，也变得重要起来，先于路南蟠龙山（今作庞里山）建行宫，后移建于路北大辛庄（今顺义行宫村），另在丫髻山东2里也有行宫，今平谷县刘家店乡的行宫村便因此得名。\n这些御道大都修得宽阔平整。中间一般只许皇帝銮辇通行，商旅平民的车马牲畜和往来行人只能走两边。皇家銮舆通行之前，沿途地方官吏必须召集百姓平整路面，铺撒新鲜黄土，还要用水泼洒，以防起尘，为此沿途须有许多盛满水的缸瓮。雍正十一年（1733年）二月，帝谒东陵，见沿道安设水缸，蓄水洒道，便谕之曰：“跸路所经，虽有微尘何碍？地方官当以牧养生民为重。若移奉上之心以抚百姓，岂不善乎？”话虽如此说，但遇到皇帝的銮舆出行，有谁敢怠慢不恭呢？\n三大规模改造广宁（安）门外和朝阳门外大道。雍正七年（1729年）正月，“命侍郎法保等察修直隶至江南大道”。这一差命反映了清政府对道路建设的高度重视。大概就在这一年，开始兴工将广宁门至小井村的土路改造为石路。雍正帝亲自撰写的《广宁门新修石道碑文》云：“……京师为四方会归、万国朝宗之地。我国家幅员广大，文轨所同，廓于无外。梯山航海者，联镳接轸，络绎而交驰，广宁门其必由之路。门外通逵，轮蹄所践，岁月滋久，渐至深洼。时雨即降，潦水停注，则行旅经涉，淹蹇泥淖之中，朕甚悯之。乃命奉宸苑相度修治，自广宁门至小井村，长一千五百丈，皆填洼为高，砌以巨石，其广2丈。凡费户部帑金八万两。工既竣，司役之臣请纪其事。朕宵衣旰食，勤求治理，凡可以济人利物者，惟恐智虑之未周，而施行之不力。念兹国门之外，辐辏之衢，稽于经籍，王政所重，宜以时修治，且期坚固永久，使仕宦商旅，车马往来，胥游于平直之路，朕心慰焉。爰濡笔而纪之……”同年，又将朝阳门至通州的土路改造为石路。这一工程较改造广宁门外的土路更为宏大。雍正帝《御制朝阳门至通州石道碑文》云：“自朝阳门至通州40里，为国东门孔道。凡正供输将，匪颁诏糈，由通州达京师者，悉遵是路。潞河为万国朝宗之地，四海九州岁致百货，千樯万艘，辐辏云集。商贾行旅，梯山航海而至者，车毂织络，相望于道。盖仓庾至都会，而水陆之冲逵也。虽平治之令以时举行，而轮蹄经涉，岁月滋久，地势渐洼；又时雨既降，积雪初融之后，停注泥淖，有一车之蹶需数十人之力以资牵挽者矣。朕心轸念，爰命所司相度鸠工，起洼为高，修建石路，计长五千五百八十八丈有奇，宽二丈，两旁土道各宽一丈五尺，长亦如之。其由通州新城至各仓门及东西沿河两道，亦皆建修石路，共计长一千五十馀丈，广一丈二尺及一丈五尺不等。费帑金三十四万三千四百八十四两有奇。经始于雍正七年八月，至雍正八年五月告竣。……是役也，远师古圣王之良法美意，而斟酌久远，一劳永逸，良用欣慰。庶使遵是路者瞻周道之荡平正直，咸庆同轨之盛治焉。爰志其岁月而勒诸石云。”这两篇碑文，把雍正年间彻底改造广宁门外大道和朝阳门外大道的原因、目的、工程规模、耗费银两及其时间等问题，讲述得清清楚楚，明明白白。\n30年之后，于乾隆二十二年（1757年），同时对广宁门外和朝阳门的石路进行翻修。乾隆《御制重修广宁门石道碑文》云：“广宁门在京城西南隅，为外郛七门之一。然天下十八省所隶以朝觐、谒选、计偕、工贾来者，莫不遵路于兹。又当国家戎索益恢，悉荒徼别部数万里辐辏内属，其北路则径达安定、德胜诸门，而迤西接轫联镳，率由缘边腹地会涿郡渡卢沟而来，则是门为中外孔道，尤不与他等。乾隆丁丑（二十二年）十月，敕所司重修石道以利行者，至庚辰（二十五年）七月乃竣。于是上溯我皇考命工创建时，逮今30年矣。兹役也，因旧址修筑者一千九百八十四丈有奇，又新道增筑者四百七十七丈有奇。凡支帑金十三万八千一百有奇。崇先制，诏后来，不可以无纪也……”乾隆《御制重修朝阳门石道碑文》则云：“直省漕艘估舶，帆樯数千里，经天津北上，至潞城而止，是为外河。引玉泉之水，由京师汇大通桥，东流以达于潞，用以转运者，是为内河。然外阔而内狭，故自太仓官廪兵糈暨廛市南北百货，或舍舟遵陆，径趋朝阳门。以舟缓而车便，南北之用有不同也。其间轮蹄络织，曳挽邪许，喧声彻昕夕不休，故常以四十里之道备水陆要冲。而旧制初未甃石，往往积涔成洼，经潦作泞，行者弗便焉。雍正七年，我皇考世宗宪皇帝命工始建石道，规方定则，垂利数十载于今，顾神皋理大物博，民用不舍，质之贞者日以刓，理之致者日一泐。不亟治，将隳前功是惧。爰咨将作都料以闻。朕曰：‘毋节帑，毋狭材。帑节，是重糜帑也；材狭，是重废材也。’时大臣董斯役者搘椭为平，易砾以整，物备用良，无坎无垤，而石之斥旧佐新者，十不存四五矣。计延袤六千六丈有奇，支户部金二十八万四千九百有奇。经始于乾隆丁丑十月，越庚辰七月落成。……”由乾隆亲撰的这两篇碑文可知，乾隆间重修广宁门外和朝阳门外石道，工程比雍正创建时要大，不仅路有延长，而且工程质量高，石料“易砾以整，物备用良”，路面“无坎无垤”。两条石道重修工程同时进行，充分反映了当时国力的强盛。而北京城内外基本是土路的时候，能有广宁门外、朝阳门外和西直门外三条平整坚固的石道，其意义可见一斑。（附图：清北京城郊主要石道示意图）\n",
    "出处": "侯仁之.北京城市历史地理[M].北京：北京燕山出版社,2000.372-377",
    "交通工具": null,
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "清",
    "原文": "清兵入关后，昌平守陵军及北部边关驻军锐减，至巩华城的漕运衰落下去。以后，因清代诸旗驻军多在清河镇附近，漕运的重点也随之转移到清河。会清河开凿于康熙年间，大约使用到光绪初就废止了。\n清康熙四十六年（1707年），“开会清河，起水磨闸，历沙子营，至通州石坝止。中建七闸，闸夫一百二十名，运通州米由通流河至本裕仓。”通流河即指通州城外北运河的一段，通州石坝是明嘉靖七年于城北门所建码头。会清河的航线，即从通州石坝起，至清河口转沙子营村（今存），再溯清河至本裕仓止。本裕仓亦建于康熙四十六年，设仓库三十廒（150间）。本裕仓的位置，约在今清河镇东南一里余的仓营村。\n会清河上的七闸，据王履泰《畿辅安澜志》记载是：“长源闸、长清闸、安丰闸、顺成闸，俱在宛平县[安丰闸今废]。云津闸、天兴闸、翔帆闸俱在大兴县[天兴、翔帆二闸今废]。”从记载顺序和地理位置上看，长源闸在宛平县，位于最上游，应就是前引文中所记的“水磨闸”，今清华园北有水磨闸村，应是该闸所在地。其他几座闸址，已不易查考。因此过去许多人误将会清河与通惠河混为一谈，实际这两条河相距甚远（见图2-11）。\n清代对会清河十分重视，不断修治。康熙五十一年（1712年）议准通州石坝至沙子营地方河道淤浅，每年将中流酌量挖浅，以利漕运。四年后（1716年）又奏准：“凡榆河遇淤，归入北运河岁修。”自此以后，从通州经沙子营至清河镇，全河都得到岁修保障，一方面可增加会清河漕运量，同时也增加了通州石坝前水量。\n会清河停运时间史无明文记载，从本裕仓修治、使用时间看，大约清同治以后就很少使用。乾隆六十年间本裕仓修理过十一次，嘉庆年间修理过六次，同治后不见修治记载。到光绪初年京仓大修时已无本裕仓①，这时会清河可能完全停止了漕运。而温榆河通航船只，直到解放前还有几十艘（见图2-12），不过大都是商运性质了。\n",
    "出处": "蔡蕃.北京古运河与城市供水研究[M].北京：北京出版社,1987.53-55",
    "交通工具": null,
    "交通要道": "清代的会清河",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "清",
    "原文": "这项建议的实施，大大改进了京城内外的道路质量。在乾隆二十二年（丁丑，1757）十月谕令吉庆等人查明勘估朝阳、西直、广宁诸门外的石道状况之后，重修朝阳门至通州之间的道路，在相继进行的几项工程中最为重要。道路的繁忙带来了过度的人踏马踩与车轮碾压，必然加剧路面的损坏程度。此次整修距离雍正八年（1729）已经将近三十年，经过三年的施工，到乾隆二十五年（庚辰，1760）七月落成。乾隆帝《御制重修朝阳门石道碑文》，叙述了这条道路的繁忙程度、重新修筑的意义及其过程，其前半段如下：\n直省漕艘估舶，帆樯数千里，经天津北上，至潞城而止，是为外河。引玉泉之水，由京师汇大通桥，东流以达于潞，用以转运者，是为内河。然外阔而内狭，故自太仓官廪兵糈暨廛市南北百货，或舍舟遵路，径趋朝阳门。以舟缓而车便，南北之用有不同也。其间轮蹄络织，曳挽邪许，讙声彻昕夕不休，故常以四十里之道备水陆要冲。而旧制初未甃石，往往积涔成洼，经潦作泞，行者弗便焉。雍正七年，我皇考世宗宪皇帝命工始建石道，规方定则，垂利数十载于今。顾神皋理大物博，民用不舍，质之贞者日以刓，理之緻者日以泐。不亟治，将隳前功是惧，爰咨将作都料以闻。朕曰：毋擳帑，毋狭材。帑擳，是重糜帑也。材狭，是重废材也。时大臣董斯役者搘椭为平，易砾以整，物备用良，无坎无垤，而石之斥旧佐新者什不存四五矣。计延袤六千六百四十四丈有奇，支户部金二十八万四千九百有奇。经始于乾隆丁丑十月，越庚辰七月落成。\n此次重修朝阳门外石道，乾隆帝提出，不要刻意节省金钱或选择尺寸狭小的石头，将就材料看似节约，实际上却浪费了金钱与优质材料。有了经费充足、石材优质的保障，主管工程的大臣指挥人们把路上的坑洼垫平，把散碎的砾石换成整块的板材，广泛采用优质石料，原有旧石留作辅助材料的不足十分之四五，确实进行了一场大规模的高级道路建设。此后，修建石路的工程推进到德胜门至清河一线。乾隆二十七年十月丙申（1762年11月22日）谕旨称：\n京城为辇谷重地，轮蹄辐辏，并属通衢，修治最关紧要。近来朝阳、广宁等门缮修石道，官民均为便利。惟德胜门外至清河一带地势低洼，一遇大雨时行遂多泥泞。此时积水虽消，而车马往来尚多未便。现在物价较昂，未必不由于此。著步军统领衙门，会同兆惠、舒赫德、和尔精额、倭赫，选派贤能司员，详加相度，妥协修治。其余各门，距从前修理之时亦属年久，或有未能平坦、不便行旅之处，并著查勘奏明、酌量办理。多兴土功，亦所以养穷民也。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.130",
    "交通工具": null,
    "交通要道": "朝阳门至通州之间的道路",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "清",
    "原文": "清末“都城内外，水陆大小桥梁凡三百有七十。或废久罔徵，或琐无足述”。这里的“都城内外”，大致包括北京内外城与海淀一带的园林区。分布在护城河、三海子、三山五园以及城内多条排水沟渠之上的桥梁，有的长期废圮无处寻找，有的规模很小无足轻重，《光绪顺天府志》择要提到名字的桥梁，有昆明湖长桥（俗名“十七孔桥”）、宣武门响闸桥等数十座。《嘉庆重修一统志》记载的京师主要津梁，有东安门内的东安桥，西华门西的玉蝀桥，正阳门内御河上的玉河桥，地安门西北的银锭桥，德胜门内的德胜桥，正阳门外的正阳桥，西直门外的高梁桥，昆明湖以南的麦庄桥等，这些都是从明代继承下来的桥梁。广安门外的普济桥，建于康熙年间。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.131",
    "交通工具": null,
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.41,
        39.91
      ]
    ]
  },
  {
    "时期": "清",
    "原文": "这道谕旨强调了朝阳门至通州道路的重要地位，提出了铺设石路、拓宽路面、整修两旁土路的设想，并派员实地查勘、着手实施。这年八月至次年五月，完成了改土路为石路的工程，使这条漕粮运输线更加畅通。雍正十一年十二月初九日（1734年1月13日）《御制朝阳门至通州石道碑文》，记载了修路的始末缘由，其前半段如下：\n自朝阳门至通州四十里，为国东门孔道。凡正供输将，匪颁诏糈，由通州达京师者，悉遵是路。潞河为万国朝宗之地，四海九州岁致百货，千樯万艘，辐辏云集。商贾行旅，梯山航海而至者，车毂织络，相望于道。盖仓庾之都会，而水陆之冲逵也。虽平治之令以时举行，而轮蹄经涉，岁月滋久，地势渐洼。又时雨既降、积雪初融之后，停注泥淖，有一车之蹶需数十人之力以资牵挽者矣。朕心轸念，爰命所司相度鸠工，起洼为高，建修石路。计长五千五百八十八丈有奇，宽二丈。两傍土道各宽一丈五尺，长亦如之。其由通州新城、旧城至各仓门及东西沿河两道，亦皆建修石路，共计长一千五十余丈，广一丈二尺及一丈五尺不等。费帑金三十四万三千四百八十四两有奇。经始于雍正七年八月，至雍正八年五月告竣。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.129",
    "交通工具": null,
    "交通要道": "朝阳门至通州",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "清",
    "原文": "以北京为中心的全国陆上交通，向东经过通州、蓟州，从山海关到达辽宁的盛京（沈阳）；从北京以北的昌平与西北的宣化，经过山西能够到达陕西，或西北出张家口到达长城以外的蒙古等地；南下的道路经过良乡与涿州后，东南一支从直隶的河间可以到达山东以及东南沿海各省，西南一支由直隶的保定历经正定、顺德（邢台）、广平（永年）、大名四府，经过河南以靠近山西、陕西，再向南经过湖北、湖南一直到云南、贵州一带。由驿站连通的主要道路，最后都汇聚于京师。这样的格局是历史的积累，在清代得到了延续并有所发展。设在北京东华门、由会同馆掌管的皇华驿，“设驿马五百匹，马夫一百五十名，车一百五十辆，车马一百五十匹，车夫一百五十名。每年经费由（兵）部核明数目，移咨户部给领”，是清代天下邮驿网络的中心。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.137",
    "交通工具": "驿马",
    "交通要道": "由驿站连通的主要道路，最后都汇聚于京师。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "清",
    "原文": "太行山东麓大道自先秦时期就是从西南方向进入北京的干道，在华北平原河湖广布的古代环境条件下，它的交通意义更加突出。清代依然延续着已有的格局，朝廷多次布置整修这条交通线。雍正七年正月癸酉（1729年2月25日）谕工部：\n平治道路，王政所先。是以《周礼》有野庐合方之职，自四畿达之天下，掌其修治。俾车马所至，咸荡平坦易。行李辐辏，津梁通达，无雨水阻滞之累。迩年以来，广宁门外已修石道，其至通州运粮之路亦修整高洁，往来行人颇为便利。今直隶至江南大道，车轮马迹践压岁久，致通衢竟成沟堑。两旁之土，高出如岸。一遇雨水之时，众流汇归，积潦难退。行旅每苦泥泞，或至守候时日。朕心深为轸念。但此通行大道已久成洼下，势难培筑增高。而大道之旁高阜甚多，平治亦殊不易。若于大道相近之处另开一道，工力似属易施。其间或有地形断续之处应修建桥梁，或有沟塍淤积之处应疏浚水道，或所开之迳有借用民间田地者，应补给价值并除钱粮。或绕行之路有远隔村庄旅舍者，应引归故道、使有顿宿。是非熟于相度地势、历练道迳之人不能详察妥当，特派工部侍郎法保、副都统韩光基、原任护军统领喀尔吉善、二等侍卫特库四员，于今年夏秋之交，自京师起程，由良乡至宿迁大道一路踏勘。将如何另开新道之处详悉议定，估计工费，绘图呈览。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.118-119",
    "交通工具": null,
    "交通要道": "太行山东麓大道自先秦时期就是从西南方向进入北京的干道",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.91
      ]
    ]
  },
  {
    "时期": "清",
    "原文": "清朝自顺治到光绪的历代帝后，间隔分葬在河北遵化的东陵与易县的西陵。顺治十八年正月丁巳（1661年2月6日）顺治帝去世，康熙二年四月辛酉（1663年5月30日），“奉移世祖章帝宝宫往孝陵”，把原来停在北京景山的灵柩移到遵化西北七十里的昌瑞山（原名“丰台岭”，清初赐名“凤台山”，至此封为“昌瑞山”）孝陵安葬。其后，康熙、乾隆、咸丰、同治帝的景、裕、定、惠四座皇帝陵都选在这里，此外还有慈安、慈禧太后等后陵四座、妃园五座、公主陵一座，共同构成了“清东陵”这个帝王后妃陵墓群。东陵在北京以东125公里，帝王祭拜时所经行的路线，也就是北京至东陵之间主要交通道路的所在。《清圣祖实录》记载，康熙十一年八月壬戌（1672年10月10日），“奉太皇太后幸遵化县汤泉，……驻跸通州”；其后四天每日一站，先后驻跸三河县城南、蓟州城西、稻地里村（天津蓟县东南大稻地村）、明月山前（约在遵化西南24公里石门附近），丁卯（15日）至汤泉行宫（遵化西北16公里汤泉）。到孝陵（汤泉西10公里）行礼后，“驻跸鲇鱼池城内行宫”（汤泉西北2公里鲇鱼池村）。北京朝阳门—通州—三河—蓟县—遵化马兰峪—东陵，是这条路线上的主要站点。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.126-127",
    "交通工具": null,
    "交通要道": "北京朝阳门—通州—三河—蓟县—遵化马兰峪—东陵，是这条路线上的主要站点。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "清",
    "原文": "在此次修路三十年之后，乾隆年间再次整修并延长了广宁门至卢沟桥之间的石道。乾隆帝《御制重修广宁门石道碑文》称：\n广宁门在京城西南隅，为外郛七门之一。然天下十八省所隶以朝觐、谒选、计偕、工贾来者，莫不遵路于兹。又当国家戎索益恢，悉荒徼别部数万里辐辏内属，其北路则径达安定、德胜诸门，而迤西接轫联镳，率由缘边腹地会涿郡渡卢沟而来，则是门为中外孔道，尤不与他等。乾隆丁丑十月，敕所司重修石道以利行者，至庚辰七月乃竣。于是上溯我皇考命工创建时，逮今三十年矣。兹役也，因旧址修筑者一千九百八十四丈有奇，又新道增筑者四百七十七丈有奇，凡支帑金十三万八千一百有奇……\n乾隆帝的碑文，再次强调了广宁门外道路在京师交通中的特殊地位。从天下诸省进京的各色人等，北路的经过安定门与德胜门入城，西南路的则要汇聚于涿郡（今河北涿州）之后沿着太行山东麓大道北上，渡过卢沟亦即经过卢沟桥到达广宁门。作为中外交通孔道的广宁门，其重要性是其他地方不能比拟的，由此至卢沟桥之间的道路因而受到极度重视。乾隆二十二年（1757）十月决定重修石道，二十五年（1760）七月竣工，此时距离雍正九年（1731）修筑石道恰好三十年。此次历时将近三年的工程，利用雍正年间旧有基础修筑了一千九百八十四丈有余，新筑道路四百七十七丈有余，石道的终点从小井村向西延伸到大井村，共计支付帑金十三万八千一百多两。雍正年间的整修使原来的土路变成了石路，乾隆年间继续加以巩固和延长，这段道路的质量显然是太行山东麓大道其他路段无法比拟的。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.122-123",
    "交通工具": null,
    "交通要道": "延长了广宁门至卢沟桥之间的石道",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.22,
        39.85
      ]
    ]
  },
  {
    "时期": "清",
    "原文": "至于从北京出山海关至东北的道路，自吴三桂引领清兵入关后在历史上更加著名，它也是清朝皇帝来往于北京至盛京（沈阳）的必由之路。顺治帝从盛京至北京的经行之地，代表了这条道路沿途的重要地点和基本走向。《清世祖实录》记载：顺治元年八月乙亥（1644年9月20日），“上自盛京迁都燕京。是日，车驾启行。驻跸旧边内木桥地方”。此后，基本上每日或隔日一站，先后经过开城（今新民县东南，辽河西岸，以下括注皆为对应的今地名）、杨石木（辽中县养士堡）、张古台口、广城、苏尔济、魏家岭（台安县魏家岭）、广宁（北宁市广宁镇）、谢家台。自九月初一开始，先后驻跸大凌河（凌海）、小凌河（锦州）、塔山（葫芦岛市塔山乡）、宁远（兴城）、曲树河堡、沙河驿（绥中县沙河站）、前屯卫（绥中县前卫镇）、老军屯。从可以考知的地名看，这条路线绝大部分与京沈铁路或高速公路的辽宁段一致。九月甲午（10月9日），“入山海关，驻跸西河地方”（当在山海关南的石河附近）。进入今河北境内之后每日一站，经过深河驿（抚宁县深河）、兔尔山河地方（抚宁西南兔耳山）、永平府（卢龙）、王家店（迁安县沙河驿）、丰润县（丰润）、梁家店（玉田县亮甲店），再经蓟州（天津蓟县）、三河县（河北三河）、通州（北京通州）。甲辰（10月29日）“未刻，上自正阳门入宫”。这条道路沿着燕山南麓山地与平原交接地带，大体自东向西行进，实际上就是先秦时期已经开辟的燕山南麓大道。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.123-124",
    "交通工具": null,
    "交通要道": "至于从北京出山海关至东北的道路，自吴三桂引领清兵入关后在历史上更加著名，它也是清朝皇帝来往于北京至盛京（沈阳）的必由之路。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.92
      ]
    ]
  },
  {
    "时期": "清",
    "原文": "在太行山东麓大道的最北段，即从卢沟桥转向东北进入北京广宁门的道路，在清代受到了格外重视。卢沟桥扼守着这条交通干线的咽喉，康熙、乾隆等皇帝多次取道卢沟桥，向南、西南、东南视察京畿河防或巡游山东、江浙等地，其繁忙程度就是整条道路的缩影。清初文华殿大学士冯溥《芦沟桥行》描写道：\n芦沟之桥走百货，柴车阻塞断人过。前车脱轭扶牛立，后车挨帮骑马坐。须臾十车五车横，千车百车不肯行。日中相望愁日暮，九衢遥瞩徒峥嵘。豪贵驰来鞭挞厉，回辕让路开复闭。念子气骄衣裳单，天寒露宿真拙计。都城百雉开九门，九门亦复如云屯。侯家应有车千辆，牛马风尘日月昏。忆昔子针来奔晋，华轩炙毂夹道进。观者惊愕未敢言，雷轰电掣公卿震。富贵事君莫等伦，不见诗咏车辚辚。寄言行役冠裳客，好避驱车独力人。\n这首诗生动地显示了卢沟桥上各类车辆的拥堵、普通行路者的艰辛、达官权贵的骄横、作者对下层人民的同情，也是卢沟桥具有特殊地位的写照。有鉴于此，清代多次整修这段对京师交通极为重要的道路。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.120",
    "交通工具": null,
    "交通要道": "从卢沟桥转向东北进入北京广宁门的道路",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.22,
        39.85
      ]
    ]
  },
  {
    "时期": "清",
    "原文": "南北大运河维系着北京的经济命脉，在明代北京皇城东扩后，通惠河的西部河段被圈入城里，漕船不能再像元代那样直接驶入都城，只能沿着通惠河的东段逆流而上，经过几道船闸的调节，才能抵达东便门外的大通桥。清朝中期以后通惠河淤塞严重，漕船需要先在通州码头卸货，再借助人力或畜力，用车辆运至京城。这样，从通州到北京朝阳门之间的陆上通道，就变得极为重要。这段道路沟通了京城与水路运输大动脉之间的关联，广宁门至卢沟桥段则维系着京城与太行山以东大道的陆上往来，东连水路、西接陆路，在京城的两翼彼此呼应。清代对于它们的整修，也几乎是同时进行的。雍正七年三月甲寅（1729年4月7日）谕内务府：\n自朝阳门外至通州，乃京师向东大路。向因雨水之时难于行走，动支钱粮修补铺垫，闻近年又复损坏。若修垫石路，酌量其宽广可容车二辆，两旁土路亦修筑平稳，于往来行旅大有裨益。著总管常明会同侍郎普泰详加验看。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.128",
    "交通工具": null,
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "清",
    "原文": "驴是容易饲养、比较驯服、耐力较强的牲畜，骑驴代步也是北京城内的交通方式之一。清人记载：“康熙丙辰五月初一日（1676年6月11日），京师大风，昼晦。有人骑驴过正阳门，御风行空中，至崇文门始坠地，人驴俱亡恙。”这虽是百年不遇的极端事件，但也提供了清代北京居民骑驴代步的一个证明。北京城内也有养驴拉脚的行业，从新街口到西直门，交道口到安定门，东四到朝阳门，大街上常见赶驴拉脚的人。从宣武门到白云观之间，骑驴到白云观进香、赶庙会的游客更是络绎不绝。今天的宣武门西河沿街在清代称作“赶驴市”，就是由于这里集中了大批毛驴，可供游人骑行进入内城或到白云观、卢沟桥、西山等地观光的缘故。这些毛驴日复一日、年复一年地来往于两地之间，对沿途的路径、景物非常熟悉，无论载人还是驮货，都显得驾轻就熟。从赶驴市到白云观，顾客付钱之后不用脚夫跟随，毛驴就驮着客人沿着熟悉的路径奔行到目的地。赶驴市脚夫的合伙人在白云观等到客人后，用手一拍驴身，它就能够自觉地跑回赶驴市。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.155",
    "交通工具": "驴",
    "交通要道": "从新街口到西直门，交道口到安定门，东四到朝阳门，大街上常见赶驴拉脚的人",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.22,
        39.85
      ]
    ]
  },
  {
    "时期": "清",
    "原文": "乾隆年间仍然延续了漕运的基本畅通，陆运的漕粮在通州张家湾卸载，车运入京；水运的漕粮仍至通州石坝，经通惠河转入京师。大力开发京西水利，收集西山玉泉诸水使河道水量充沛，乾隆三年（1738）、二十三年（1758）、二十五年（1760）先后疏浚北京东护城河，这些都增强了通惠河的航运能力。但是，治理河道淤浅、解决水源短缺，始终是保障漕运的最大问题。乾隆二年七月己酉（1737年8月18日）谕总理事务王大臣：“通州至天津一带河路，向系坐粮厅管理修浚。闻近年以来淤浅之处甚多，粮艘及民船往来殊属艰难。”因此派遣官员前往直隶等省查勘水道，议定疏浚办法与管理机构。鉴于通惠河之上的普济等四闸属通州，庆丰等七闸属大兴县，分别添设吏目与主簿一员，负责河堤安全与河道疏浚。嗣后，“天津至通州一带河道向系流沙，淤浅靡定”之类的报告屡见不鲜，朝廷决定：\n每岁春初，令坐粮厅详查所属境内，闸座堤岸等工应行修理，确估呈报。该侍郎派员查明，即准令兴修。至各处挑浅应用器具若干、添造若干，先期详明置备。粮艘随到，如遇水浅处所，一面呈报一面募夫挑挖。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.149",
    "交通工具": null,
    "交通要道": "陆运的漕粮在通州张家湾卸载，车运入京；水运的漕粮仍至通州石坝，经通惠河转入京师。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "清",
    "原文": "谈迁在顺治十三年二月乙卯（1656年3月1日）搭乘回空漕船返回故里，他首先骑驴出东便门，在通州南门休息一晚，第二天到张家湾：\n三十里登舟，宋俊伯先约处州卫之漕舟。……丁巳，午刻，宋俊伯来。泊舟处隶武清，东隶香河。……癸亥，……发三里抵河西务。河岸善崩，往见崩及城下，今城倾数十丈矣。……乙丑，宿于丁字沽。……丁卯，大雾，午泊天津而晴。天津产鱼盐，榷署在河西务，昨岁增满洲官二人，知回漕多贩鱼，又税之。时回漕五百七十一艘。余置鲍鱼一石，费二金。戊辰，行三十里杨柳青……\n谈迁沿着通惠河南岸、北运河西岸出入京师，关于通惠河和北运河的记述是可靠的。当时北上的漕船一般在张家湾卸载，然后用便于在狭浅河道行驶的驳船转运至通州，或存入通州仓，或再度转运北京城入京仓。转运北京城的漕粮在通州城北石坝换载驳船，上溯通惠河逐闸转运，直至北京东便门外大通桥。大通桥有若干车户专门负责将漕粮运至朝阳门、东直门一带的京仓。谈迁顺治十三年的记载显示，卸载后南返的漕船有571艘之多，一般要捎带着天津的鱼盐等物南下，行人当然也可以搭便船。通惠河河面狭窄，只能浮运部分漕粮，其余的要由通州陆路运往京师。顺治十三年（1656）修筑通州至京师的道路，就是为了解决陆路运输的困难。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.146-147",
    "交通工具": "登舟",
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "清末",
    "原文": "（4）津浦铁路。北起天津，南至浦口，长1，863里，耗资80，490，000馀元。早在光绪六年（1880年），刘铭传即有修筑清江（今江苏淮阴）至京师铁路的创议。十一年（1885年），左宗棠复倡“清江至通州宜先设铁路，以通南北之枢，一便于转漕，而商务必有起色；一便于徵调，而额兵即可多裁”。是年冬，李鸿章也以“陶城、临清间二百馀里，运道淤垫”为由，“请试办铁道，为南北大道枢纽”。但是这些建策皆遭冷遇和抵制。二十一年（1895年），“命张之洞遴保人才，及筹议清江至京路事。”但张之洞认为：“铁路以卢汉为要，江宁（南京）、苏、杭次之，清江筑路非宜”。遂将两江总督张之洞调任湖广总督，移驻汉口，综理卢汉铁路事宜去了。二十二年（1986年），修筑津镇铁路之议再起。事隔两年，朝廷先后派出要员为督办，准备兴工。又因向德、英两国借款问题上，风波迭起，故工程一拖再拖。直到三十四年（1908年），才由吕海寰董其事，正式开工。全路以韩庄运河为界，分为南、北两段，同时兴修。南段借资于英国，北段借资于德国。至宣统三年（1911年），南北两段在韩庄接轨，但黄河洛口大桥工程晚后一年竣工，于民国元年（1912年）全线通车。虽然津浦铁路不以北京为起点，但其在天津与京奉铁路相接，实为北京通往东南沿海的交通大动脉。",
    "出处": "侯仁之.北京城市历史地理[M].北京：北京燕山出版社,2000.384-385",
    "交通工具": null,
    "交通要道": "津浦铁路",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "清末",
    "原文": "“内政始于道路”，道路改造是城市改造的重要前提。在清末“新政”的推动下，北京开始了近代市政建设。北京长期作为国都，“地居中央则群才所萃，近接政府则教令易施”。为利于行旅，清政府首先拨款在繁华地段和官衙集中的东四、东西长安街、东华门大街、前门大街、王府井大街、户部大街等主要街道，采用近代技术修筑了第一批石渣路，逐渐取代原有土路和石板路。巡警机构建立之后，各厅建立了清道队，负责维护道路卫生及整修。同时，在主要街道种植树木，并加强道路交通管理。但受到诸多因素的制约，清末北京道路新式建设规模十分有限，“如南北池子、南北长街、南北新华街、府右街及香厂、万明、仁寿、华严、仁民等路，或地宜商场，限于经济；或路居要津，城墙为障，均未能开辟。而其余繁盛通衢未及展修者，比比皆是。”京都市政公所建立之后，将京师各路通盘筹划，“分别缓急，揆度财力，择要次第兴筑”，完成120余段。",
    "出处": "张艳丽.北京城市生活史[M].人民出版社,2016.283",
    "交通工具": null,
    "交通要道": "繁华地段和官衙集中的东四、东西长安街、东华门大街、前门大街、王府井大街、户部大街等主要街道，采用近代技术修筑了第一批石渣路",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        108.95,
        34.26
      ]
    ]
  },
  {
    "时期": "清末",
    "原文": "清末城市道路状况依然较为恶劣，据清末夏仁虎《旧京琐记》记载：“北京市在未修马路以前，其通衢中央皆有甬路，宽不及二丈，高三、四尺，阴雨泥滑，往往翻车，其势甚险。”清末北京内外城道路得到了整修，将原有甬路铲平，修成土路或石渣路。中间是人行道与轻便车道，两侧是重车道，最外侧挖排水沟。“一自维新修马路，眼前王道始平平”，马路修成后解决了路窄难行的困难。京师马路还采用“锯子活”的方法修筑，用碎石填平，灌以石灰水，名为桃花浆，再用汽碾压结实，修成后非常坚固，“更喜京师诸马路，都将锯子活修成”。街道两旁种植杨柳树，绿树相间，“点缀两边好风景，绿杨垂柳马缨花”，往来行人流连忘返。路两旁安装了路灯，“夜行信步无危险”，行人夜间赶路更为安全，不用担心掉进沟眼。前门、骡马市、大栅栏、崇文门、王府井、东长安街、灯市口、朝阳门、鼓楼、宣武门、德胜门、西安门、西直门等处主要街道，都得到不同程度的修整，受益者包括内外城的绝大多数居民。\n前门车马出入较多，经常造成拥挤。按例，前门在上灯时关闭，车马行人为了赶在关门前通过匆匆赶路，造成城门一带秩序十分混乱。三更时，城门再开一次，只许进城不许出城，时人将这些人称为“倒赶城”。清末修改道路通行规定，车马均靠左边行走，一旦违反，以违警律论处，与前门“东出西入”的规则一致，极大地方便了居民出行。“而今出入东西判，鱼贯行来妙莫言”，往来行人无不称便。\n经过整修，北京城重要干道得到一定程度的改善，“北京改修的大街独放可谓异彩”。同时，如南北池子、南北长街、南北新华街、府右街及香厂、万明、仁寿、华严、仁民等路，或处商场闹市，或限于经费，或路居要津，城墙为障，均未能开辟。其余街巷没有展修者，比比皆是。可见，清末京师主干道整修只是北京内外城道路整修工作的开始。",
    "出处": "张艳丽.北京城市生活史[M].人民出版社,2016.254-255",
    "交通工具": "车马",
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        108.95,
        34.26
      ]
    ]
  },
  {
    "时期": "清末",
    "原文": "清末着手将甬道铲平，修成土路或石渣路。中间是人行道与轻便车道，左右两侧是重车道，重车道外再挖排水沟，雨水由此流入护城河。街道两旁种植杨柳树，树立牌楼等作为地名标志。在排放生活污水的沟眼四周修建了“木间”即栏杆，街道两旁安装了路灯，使行人再无倾陷之患。质量最好的路面是用称为“锯子活”的方法修筑的马路，先用碎石填充路面，然后灌上石灰水，再用汽碾轧坚碾平。前门、骡马市、大栅栏、崇文门、王府井、东长安街、灯市口、朝阳门、鼓楼、宣武门、德胜门、西安门、西直门等处的主要街道，都得到了不同程度的整修。宣统元年（1909）刊行的兰陵忧患生《京华百二竹枝词》写道：“一自维新修马路，眼前王道始平平。”“点缀两边好风景，绿杨垂柳马缨花。”“更喜京师诸马路，都将锯子活修成。”“改良街道名称好，各把牌楼树两头。”《京华百二竹枝词》还反映了清末北京交通管理的变化。车马行人拥挤的前门一带，道路阻塞动辄长达一两个小时，“而今出入东西判，鱼贯行来妙莫言。”东出西入的规则，使行路变得有了秩序。“小巷难行窄且斜，订章出进口无差。”经过警察局的整顿，胡同插车现象明显减少。马路修筑以后，骡马驴车随意停放的现象减少，“眼底耳根两清净，从今不见破骡车”，通行起来顺畅了许多。此外，前门原来在上灯时关闭，届时行人车马竞走飞驰，稍微延缓就有被关在城外之虞。三更时城门复开，但只许进城不许出城，凡入城者名为“倒赶城”。清末则改为出入无禁，“无复人言倒赶城”，大大方便了行人。清末的一条交通规则与今天正好相反，“靠左边行分两旁，章程订立本周详”。这样的警章订立后，车马均靠左边行走，有不遵者以违警论处，与前门“东出西入”的规则是一致的。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.183",
    "交通工具": null,
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        108.95,
        34.26
      ]
    ]
  },
  {
    "时期": "清末民初",
    "原文": "清末民初的李岳瑞记载：\n同治四年（1865）七月，英人杜兰德，以小铁路一条，长可里许，敷于京师永宁门外平地，以小汽车驶其上，迅疾如飞。京师人诧所未闻，骇为妖物，举国若狂，几致大变。旋经步军统领衙门饬令拆卸，群疑始息。此事更在淞沪行车以前，可为铁路输入吾国之权舆。\n这里所说的“淞沪行车”，是指同治五年（1866）英国怡和洋行在上海未经中国政府同意就擅自修建的淞沪窄轨铁路。光绪二年（1876）竣工后，清政府以民怨沸腾为借口禁止其运营，经过谈判交涉后花费28.5万两白银将其购回，光绪三年（1877）将款项如数兑清后立即拆毁，铁轨和火车旋即运往台湾，一说沉入打狗港中，一说在光绪九年（1883）又载回上海，运往北方供修筑开平铁路之用。一般认为这是中国第一条真正意义上的铁路，但比杜兰德在北京铺设的小铁路还要晚些。由于国人早期对铁路的隔膜，这两条铁路都没有逃脱被迅速拆毁的命运。直隶总督李鸿章在光绪十三年六月二十六日（1887年8月15日）的信函《综论饷源并山东热河各矿》中说到，此前他将七里长的铁轨经水路运到通州，然后又运进北京，“前此铁道一里，哄动都人。惜轨短人推，未能曲尽其妙，或犹难免浮言。将来分设外火器营，试演捷速，当共讶其灵便，风气或自此开也”。杜兰德的小铁路只铺设了一里多长，按照李鸿章的说法，试验性质的行车要靠人力推动，与后来以蒸汽或电力驱动的火车大不相同。但李岳瑞说“以小汽车驶其上，迅疾如飞”，实际上就是蒸汽驱动的小火车。如果只靠人力推动车辆，这既不符合英国人展现铁路的优越性以打动清朝统治者的初衷，也不至于使京师乃至全国感到惊诧和怪异。铁路与火车在中国最早出现于同治四年的北京城外，是可以确定的事实。李岳瑞所谓铺设铁路的地点“永宁门外”，通常认为就是宣武门外护城河沿线，但北京在历史上未曾有过“永宁门”，究竟为何如此称呼还需继续探究。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.164-165",
    "交通工具": "火车",
    "交通要道": "铁路的地点“永宁门外”，通常认为就是宣武门外护城河沿线，但北京在历史上未曾有过“永宁门”",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.66,
        39.91
      ]
    ]
  },
  {
    "时期": "秦",
    "原文": "公元前221年，秦始皇统一中国后，废除分封诸侯的弊政，推行以郡县治理地方的新法，而且实行车同轨、书同文、度量衡同一标准的大一统治国之道。在交通建设方面，主要是修治通向全国各地的驰道。\n修治驰道始于秦始皇二十七年（公元前220年）。所谓驰道，是秦代专供皇帝行驶车马的道路，故又称“天子道”。《汉书·贾山传》云：“秦为驰道于天下，东穷燕齐，南极吴楚，江湖之上、滨海之观毕至。道广五十步，三丈而树，厚筑其外，隐以金椎，树以青松。”据此可知，秦代修筑的驰道规格是相当高的，不仅路面很宽（秦制六尺为步，五十步合三丈），路基也很坚实（厚筑其外，隐以金椎），又有青松美化（三丈而树，树以青松）。可以说，秦始皇修治驰道是我国古代交通道路建设上的一个里程碑。\n秦始皇修治驰道的原因有二：第一，秦始皇是在先后攻灭韩、魏、楚、赵、燕、齐六国之后建立起实行中央集权制的新型政权的。为了防止旧日六国诸侯势力东山再起，死灰复燃，秦始皇必须不断地巡察各地，控驭四方。第二，秦始皇好大喜功，需要到处巡行，立碑刻石，以颂秦功秦德。\n秦始皇所修的驰道“东穷燕齐”，燕国故地有秦始皇的驰道则毫无疑问。那么，秦始皇的驰道通过哪里？《史记·秦始皇本纪》：秦始皇三十二年（公元前215年），“始皇之碣石，使燕人卢生求羡门、高誓。刻碣石门，坏城廓，决通堤防。”接着“始皇巡北边，从上郡入（即返回国都咸阳）。”按碣石指碣石山，在今河北省昌黎县北，东南距渤海约20公里。在一千多年以前，碣石山尚在渤海岸边。《水经注·濡水》云：“今于此（指碣石山所在地）枕海有石如甬道，数十里。当山顶有大石如柱形，往往而见立于巨海之中。潮水大至及波退不动不没，不知深浅，世名之天桥柱也。状若人造，要亦非人力所就。”推测，秦始皇的马车是沿着太行山东麓大道先到达蓟城，然后又沿着燕山南麓大道而到碣石的。因为那时候自西南而东北斜贯河北平原的捷径是不存在的。即便他有可能沿汾河谷地经太原，再东出太行山北上，也要经过一段太行山东麓大道。当秦始皇巡行北边的时候，必定是自碣石沿着燕山南麓大道先到蓟城，然后再向西北出居庸关。舍弃此道，无路可行。因此，秦始皇的驰道通过燕国故地者，无疑就是太行山东麓大道、燕山南麓大道和居庸关大道。也就是说，通过燕国故地的秦始皇驰道是在旧有大道的基础上进一步整修的。秦二世元年（公元前209年），皇帝又东巡郡县，“到碣石，并海，南至会稽。”“遂至辽东而还”。可以肯定，秦二世“到碣石”、“至辽东而还”，也是沿着秦始皇太行山东麓驰道和燕山南麓驰道而往返的。\n",
    "出处": "侯仁之.北京城市历史地理[M].北京：北京燕山出版社,2000.356-358",
    "交通工具": "马车",
    "交通要道": "经过蓟城的秦始皇驰道",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.38,
        39.95
      ]
    ]
  },
  {
    "时期": "秦",
    "原文": "秦始皇东巡碣石时，首先从咸阳走驰道到蓟城，再由蓟城沿燕山南麓的道路前往碣石，即从蓟城向东，经右北平郡无终（今天津蓟县）、令支（今河北迁安西）到达碣石。秦始皇在碣石完成求仙活动，然后北巡，从右北平折返燕地，经渔阳、上谷、代、雁门、云中、九原等北边诸郡，最后从上郡返回咸阳。概而言之，当时从燕地通往咸阳的主要干道有两条，一是沿着太行山东麓的驰道入函谷关到咸阳，一是根据塞上大道从上谷向西，过雁门或者云中，从上郡抵达咸阳。秦代在幽州所修的驰道，在西汉时期同样是交通要道。汉高祖五年（前202）七月，刘邦平定燕王臧荼的叛乱。《史记·周勃列传》载：“以将军从高帝击反者燕王臧荼，破之易下。所将卒当驰道为多。”进兵过程利用了燕地的驰道。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.29",
    "交通工具": null,
    "交通要道": "一是沿着太行山东麓的驰道入函谷关到咸阳，一是根据塞上大道从上谷向西，过雁门或者云中，从上郡抵达咸阳。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.38,
        39.95
      ]
    ]
  },
  {
    "时期": "秦",
    "原文": "由咸阳向东通往燕地的驰道大致沿太行山东麓修筑，这条驰道可从《史记》的记载中得到印证：“然邯郸亦漳、河之间一都会也，北通燕、涿，南有郑、卫。”邯郸为太行山东麓大道的重要站点之一，而燕地的蓟城则是大道东北之末端，南端为郑、卫的郑州、洛阳。大致路线是由咸阳向东出函谷关（今河南灵宝北），经三川郡（今洛阳），再转向东北经邯郸郡邺县（今河北临漳西南）、邯郸县（今邯郸）、恒山郡（今正定县南），然后东北至广阳郡蓟城（今北京）。从咸阳向东北方向，从蒲坂出发，沿着汾水上溯太原，穿太行山井陉道，延伸到恒山郡，就连接到了东北通燕地的驰道。另外，从太原郡通代郡（今河北蔚县西南），再至上谷郡、渔阳郡，就抵达了燕地。从代郡到燕地、再至右北平直至碣石的这段道路，是秦塞上道路的东段，从代郡往西经云中、九原，是其西段。这条塞上大道沿着长城铺设，从咸阳向北经上郡（治今陕西榆林东南）的直道与其连接。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.28-29",
    "交通工具": null,
    "交通要道": "这条塞上大道沿着长城铺设，从咸阳向北经上郡（治今陕西榆林东南）的直道与其连接。",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.38,
        39.95
      ]
    ]
  },
  {
    "时期": "秦始皇统一中国",
    "原文": "秦始皇统一中国，诏令车同轨；又以都城咸阳为中心，为“驰道于天下，东穷燕齐……道广五十步，三丈而树，厚筑其外，隐以金椎，树以青松。”秦二世亦大修驰道、直道。四通八达的驰道，使得燕地交通网络迅速发展起来。秦始皇曾“东巡碣石，并海”，经过燕地驰道，到达蓟城，再由蓟城沿燕山南麓道路前往碣石，之后从碣石北巡，从右北平折返燕地，经渔阳、上谷、代、雁门、云中、九原等北边诸郡，经直道返回咸阳。统一车轨道路的举措，对北京地区居民交通出行带来极大便利。",
    "出处": "张艳丽.北京城市生活史[M].人民出版社,2016.19",
    "交通工具": null,
    "交通要道": "经过燕地驰道，到达蓟城，再由蓟城沿燕山南麓道路前往碣石，之后从碣石北巡，从右北平折返燕地，经渔阳、上谷、代、雁门、云中、九原等北边诸郡，经直道返回咸阳",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.38,
        39.95
      ]
    ]
  },
  {
    "时期": "辽",
    "原文": "漕船从海上登陆后转入内河运输、最后到达南京城的具体路线缺乏史料佐证，一说漕船沿今蓟运河西入泃河，至三河或北京平谷一带卸载，然后陆运至辽南京。此外，还有流传广泛的萧太后河之说。这条河流相传是辽代太后萧绰执政时，利用永定河故道开挖的一条运粮河。清朝《光绪顺天府志》称：\n饮羊河在通州城南，与牧羊台近，或曰即萧后运粮河。久涸，惟地洼，河形犹存，夏则积潦成流。按窝头河即萧后运粮河也，然则，饮羊河亦即窝头河故道。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.79",
    "交通工具": null,
    "交通要道": "沿今蓟运河西入泃河，至三河或北京平谷一带卸载，然后陆运至辽南京",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.41,
        39.91
      ]
    ]
  },
  {
    "时期": "辽",
    "原文": "辽金时期幽州地区陆路交通的主干，往南通达两宋都城，往北则与辽金的重要城市相接。辽始都临潢（今内蒙古巴林左旗），称上京。而后陆续征服周边，设中京（今内蒙古宁城县）、东京（今辽阳）、西京（今山西大同）、南京（今北京）。金初建都会宁府（今黑龙江省阿城南白城），称上京；又设北京（大定府）、东京（辽阳府）、西京（大同府）、南京（开封府）。海陵王天德五年（1153）迁都燕京，称中都。两宋使臣多次通过幽州向北前往辽金两国的首都或陪都，契丹国君经常巡狩于五京之间，北宋使者也往往到其所在地朝聘。如北宋王曾出使契丹，“初奉使者止达幽州，后至中京，又至上京，或西凉淀、北安州、炭山、长泊。”（7）熙宁八年（1075）沈括出使，“是时，契丹以永安山为庭。”（8）金代迁都后，幽州地区与华北平原的通道得以打开，历来所行的太行山东麓大道畅通无阻。尤其是卢沟桥的修建，进一步改善了幽州地区向南的通道。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.71",
    "交通工具": null,
    "交通要道": "往南通达两宋都城，往北则与辽金的重要城市相接",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.92
      ]
    ]
  },
  {
    "时期": "辽",
    "原文": "唐朝末期，久已生息繁衍、游牧鱼猎在西辽河上游的契丹民族强盛起来。唐亡之年（天佑四年，907年），其首领阿保机即皇帝位，始建国，初称契丹，后改曰辽。后唐清泰三年（936年），因助叛唐欲自立的石敬瑭当上皇帝，建立后晋，石敬瑭遂割幽、蓟等16州予辽，以为酬谢。辽会同元年（938年），升幽州为陪都，称南京，又号燕京。辽之南京，“户口三十万。大内壮丽，城北有市，陆海百货，聚于其中；僧居佛寺，冠于北方。锦绣组绮，精绝天下。……既筑城后，远望数十里间，宛然如带，回环缭绕，形势雄杰，真用武之国也”。\n辽与北宋以白沟河为界，南北对峙，长达一个半世纪之久。其间，辽南京的地位和作用极其重要。对于中原宋王朝来说，“天下视燕为北门，失幽、蓟则天下常不安。幽、燕视五关为喉襟，无五关则幽、蓟不可守”。因此，宋王朝亟要收复燕京，但屡屡告败。对于辽王朝来说，南京是对付强敌宋王朝的前沿基地，故每次辽帝亲征，总是留亲王一人在幽州，权知军国大事。\n在辽代诸帝之皇后中，以景宗皇后萧绰（小字燕燕）最为著名。《辽史》论之曰：“后明达治道，闻善必从，故群臣咸竭其忠。习知军政，澶渊之役，亲御戎车，指麾三军，赏罚信明，军士用命。圣宗称辽盛主，后教训为多”。本题所谓的辽萧太后，即指此人而言。在今北京地区，留下了许多有关她的故事，萧太后运粮河就是其中之一。\n《辽史·百官志四》载，辽于南京设南京转运使司，亦曰燕京转运使司。这是掌管水陆转运粮食、盐铁及其他货物的衙门。太平元年（1021年）十一月，以仇正（“正”下脱“己”字——作者）为燕京转运使。开泰六年（1017年）十月，“南京路饥，挽云、应、朔、弘等州粟振之”。这是陆路转运之例。太平年间，“燕又仍岁大饥，户部副使王嘉复献计造船，使其民谙海事者，漕粟以振燕民，水路艰险，多至覆没”。可见辽代确从东北经海路向燕京地区漕运过粮食。问题在于，当时又如何将这些振饥之粟转运燕地各州县呢？\n《长安客话》云：香河县“境南有大龙湾、小龙湾二水，夏秋始合流，经宝坻界入海，相传辽时海运故道”。大、小龙湾水尚存，在今青龙湾河稍北（青龙湾河即因其得名），下至宝坻八门城南入蓟运河。此水为辽时海运故道，虽系“相传”，但较可信，即从海上来的漕船，入今蓟运河口，然后循大、小龙湾水逆流而上，至香河县（辽析潞、三河、武清三县地置_作者）西北进入潞河。\n今由通县张家湾西至京城广渠门外，有一条河，名曰“萧太后河”。此河元代称文明河，为粮储运道。事实上，元代的粮储运道主要是通惠河与坝河，即便元代文明河也行漕运，很可能是沿用前代即辽、金时的漕渠。因为辽南京或金中都在新建元大都的西南郊，由潞河循此一渠道向南京或中都转运漕粮，路程更便捷。此河今名萧太后河，绝非偶然，似乎透露着这样的信息：辽代就是由潞河转入这条河道而向南京运输粮食的。\n清人震钧记载：“八里庄之西2里有河名十里河，又名萧太后运粮河。东岸有土城，湮都宛然，土人名萧太后城。”这条史料说明，辽代漕渠至南京城后，又循护城河向西北方向延伸，到达今玉渊潭以西的地方。这里所说的萧太后城，或许是指见于史籍记载的所谓金中都方圆七十五里的外郭城的西北隅。\n辽代漕渠，见于史志记载者还有。例如，光绪《畿辅通志》云：“蓟运河乃转而东流，至曹家口头，有殷流河合梯子山泉来入之。殷流河亦作阴流河，即紫金片，又谓之辽运河。《蓟州志》：‘紫金片在州南8里，长1里余，宽10余丈，水甚深，冬夏不竭，乃辽运河之故道也’”。可知今蓟运河亦为辽代之漕道。又《清一统志》：“苍头河，在香河县西北20里。旧志：相传即肖后运粮河。水泛则上通牛栏山水、窝头庄水；下通三路堤口……。今名窝头河，本无源，伏秋水发，众流会于窝头，迳香河县百家湾，东与渠水合”。按苍头河上游，今名箭杆河；中游即今通县与三河县分界的一段潮白河；下游经香河县北、宝坻县南，至八门城会蓟运河，在今潮白新河之北，仍名窝头河或箭杆河。\n综上所述，辽萧太后运粮河大致有三条：其一，自今蓟运河口入内河，循今香河县南境的大、小龙湾水入潞河，再顺今萧太后河至南京城下，并延伸至南京城西北。其二，循今窝头河而上，经今宝坻县南、香河县北，西北至顺义牛栏山。其三循今蓟运河而上，至蓟州、三河、平谷等地。\n",
    "出处": "侯仁之.北京城市历史地理[M].北京：北京燕山出版社,2000.400-403",
    "交通工具": null,
    "交通要道": "辽萧太后运粮河",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.92
      ]
    ]
  },
  {
    "时期": "辽以前",
    "原文": "辽以前，幽州蓟城为军事重镇。东汉末年，曹操为征乌桓开凿了平虏渠、泉州渠与新河，沟通了北京地区与河北地区的众多河道。隋代，为用兵辽东，开凿了永济渠，永济渠南接沁水，北达幽州蓟城，形成了沟通北京与中原的水上交通线。",
    "出处": "侯仁之主编 唐晓\n峰，温宗勇，尹钧科副主编.北京历史地图集．文化生态卷[M].北京：文津出版社,2013.159",
    "交通工具": null,
    "交通要道": "东汉末年，曹操为征乌桓开凿了平虏渠、泉州渠与新河，沟通了北京地区与河北地区的众多河道。隋代，为用兵辽东，开凿了永济渠，永济渠南接沁水，北达幽州蓟城，形成了沟通北京与中原的水上交通线",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.38,
        39.95
      ]
    ]
  },
  {
    "时期": "辽金",
    "原文": "辽金本事游牧，常年迁徙，对道路交通的管理并无成法。但其后仿效唐宋制度，为便于政令传达，也建立了驿站，尤其在重要首府之间设置馆舍邮驿。使者的行止就赖于这些馆舍，两宋使者对此多有记载。金灭北宋后，将其疆域扩展至淮河一线与南宋对峙，并仿宋朝分疆域为十九路，各路路府之间道路交错，六京之间更是驿路纵横连接。为便于控制中原之地，设置了起自金、南宋边境泗州，经南京（开封）、中都（北京）至上京（今黑龙江阿城南）的重要驿道：\n泗州至临淮县六十里，临淮至青阳驿八十里，青阳驿至虹县八十里，虹县至灵壁县六十里，灵壁县至静安镇六十里，静安镇至宿州六十里，宿州至靳泽镇六十里，靳泽至柳子镇五十里，柳子至永城县六十里，永城至酂阳三十七里，酂阳至会宁亭镇三十七里，会宁亭至谷熟县八十里，谷熟至南京四十里，南京至宁陵县七十里，宁陵至拱州六十里，拱州至雍邱县七十里，雍邱至封邱县六十里，封邱至胙城县四十里，胙城至沙店河南铺四十五里，沙店至滑州四十里，滑州至浚州二十五里，浚州至裴家庄三十五里，裴家庄至汤阴县四十里，汤阴至相州三十里，相州至丰乐铺三十里，丰乐至磁州三十里，磁州至台城铺三十里，台城至邯郸县三十五里，邯郸至临洺镇四十里，临洺至沙河县三十五里，沙河至邢州四十里，邢州至都城店二十五里，都城店至内邱县三十里，内邱至范县店十五里，范县店至柏乡县二十五里，柏乡至江店十五里，江店至赵州三十里，赵州至栾城县三十里，栾城至灵店铺三十五里，灵店至真定府二十五里，真定至古县南铺三十里，古县南铺至新县三十里，新县至中山府四十五里，中山至望都县南定七里店四十里，七里店至经杨店四十里，经杨店至保州三十五里（金人改为徐州），保州至梁门四十五里，梁门至故城店三十里，故城店至黄村铺三十里，黄村至泽伴铺三十里，泽伴铺至涿州三十里，涿州至刘李店三十里，刘李店至良乡县三十里，良乡至卢沟河铺三十里，卢沟河铺至燕京三十里，燕京至交亭三十里，交亭至潞州三十里，潞州至三河县三十里，三河至下店四十里，下店至邦军店三十五里，邦军店至蓟州三十里，蓟州至罗山铺三十里，罗山铺至玉田县四十里，玉田至沙流河四十里，沙流河至永济务四十里，永济务至榛子店四十里，榛子店至七个岭四十里，七个岭至赤峰口四十里，赤峰口至平州四十里，平州至双望店四十里，双望店至新安四十里，新安至旧榆关三十里，旧榆关至润州三十里，润州至千州四十里，千州至南新寨四十里，南新寨至莱州四十里，莱州至石家店四十里，石家店至隰州四十里，隰州至杨家馆五十里，杨家馆至桃花岛四十里，桃花岛至童家庄四十里，童家庄至胡家务四十里，胡家务至麻吉步落四十里，麻吉步落至新城四十里，新城至茂州四十里，茂州至惕稳寨四十里，惕稳寨至军官寨四十里，军官至显州五十里，显州至沙河五十里，沙河至兔儿埚五十里，兔儿埚至梁鱼务三十五里，梁鱼务至大口六十里，大口至广州七十里，广州至沈州六十里，沈州至蒲河四十里，蒲河至兴州四十里，兴州至银州南铺五十里，银州南铺至铜州南铺四十里，铜州南铺至咸州南铺四十里，咸州南铺至宿州北铺四十里，宿州北铺至安州南铺四十里，安州南铺至夹道店五十里，夹道店至杨柏店四十五里，杨柏店至奚营西四十五里，奚营西至没瓦铺五十里，没瓦铺至木阿铺五十里，木阿铺至信州北五十里，信州北至威州四十里，威州至小寺铺五十里，小寺铺至胜州铺五十里，胜州铺至济州四十里，济州至济州东铺二十里，济州东铺至北易州五十里，北易州至宾州渡混同江七十里，宾州至报打孛堇铺七十里，报打孛堇铺至来流河四十里，来流河至阿萨铺四十里，阿萨至会宁第二铺三十五里，会宁第二铺至会宁头铺四十五里，会宁头铺至上京三十里。自上京至燕二千七百五十里，自燕至东京一千三百一十里，自东京至泗州一千三十四里。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.76-78",
    "交通工具": null,
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.92
      ]
    ]
  },
  {
    "时期": "辽金",
    "原文": "辽金时期的主要市场都在城北。辽南京的主要对外交通固然是在北方，金中都时期却是以与南部的交通为主，但是城市北部的市场却始终保持着活力，并一直持续到元大都时期，并不受到对外交通变化的影响。由此可以认为，辽金旧城北部的市场主要是为城市内部居民提供生活用品的市场。",
    "出处": "诸葛净.辽金元时期北京城市研究[M].南京：东南大学出版社,2016.107-108",
    "交通工具": null,
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.35,
        39.88
      ]
    ]
  },
  {
    "时期": "远古",
    "原文": "天设地造，北京的西、北、东北三面群山耸立，重峦叠嶂。西面为太行山之北端，俗称北京西山，简称西山；东北为燕山，西北为军都山；只有南面和东南面与华北大平原相联。在山区，有一些天然的峡谷隘口，成为沟通山前山后的交通孔道，其中以居庸关（军都陉）、古北口、卢龙塞或喜峰口、榆关或山海关最为著名；在平原，有许多源于太行山、燕山腹地的河流，自西北而东南奔注，或分或合，改道泛滥，并形成许多的淀泊沼泽。其中以桑干河（今永定河）、沽水（今白河）、鲍邱水（今潮河）、巨马河、濡水（今滦河）为重要。北京地区固有的地理位置和山川形势，对于远古时代先民的交往来说，既创造了有利的条件，也设置了难逾的障碍。\n利用有利条件，避开难逾障碍，是人类生存的本能。生活在今北京地区的远古先民，在与其他地方先民的交往中，经过日复一日、年复一年积累经验，终于找到几条最适宜的路线：向西南，沿着太行山东麓南北一线高地，可达中原各地；向西北，穿过居庸孔道，可上蒙古高原；向东北，出古北口可去燕山腹地；向东，紧傍燕山南麓，经喜峰口或山海关，便抵辽西、辽东各地及以远。所以，太行山东麓大道、居庸关大道、古北口大道、燕山南麓和喜峰口或山海关大道，是远古时代北京地区的先民与各地交往的主要道路。反过来说，生活在中原各地的远古先民，要到北方，也必须走太行山东麓大道，先来到今北京这地方，然后分别出居庸关、古北口、喜峰口或山海关等，到达山后各地；而生活在居庸关、古北口、喜峰口或山海关外的各地先民，要南下中原，同样必须走居庸关大道、古北口大道、喜峰口或山海关大道，先来到今北京之地，然后再沿着太行山东麓大道南下。远古时代，今河北平原上，因河道纵横，湖沼广布，人们是不便通过的。其他的山间道路，也远没有这几条险关要塞通畅便捷。由此可见，从远古时代起，今北京这地方就是南北交通的分合之区、枢纽之地。交通枢纽最有利于形成大型聚落。因此，远在三千多年以前，今北京这地方就出现了一个重要聚落，名字叫作蓟。蓟的位置应当就在今北京广安门一带。\n总之，历史悠久的太行山东麓大道、居庸关大道、古北口大道、燕山南麓和喜峰口或山海关大道的分合形势，是北京的原始聚落--蓟形成的最重要的条件，也是促进蓟城和燕国不断发展的主要因素之一。战国时期，燕国“东有朝鲜、辽东，北有林胡、楼烦，西有云中、九原，南有呼沱、易水。地方二千余里……”[1]，成为北方的一大强国，战国“七雄”之一。显然，在燕国对其国土进行有效统治的时候，上述四大交通干道是发挥了重要作用的。（附图：先秦蓟地主要道路示意图）\n",
    "出处": "侯仁之.北京城市历史地理[M].北京：北京燕山出版社,2000.352-354",
    "交通工具": null,
    "交通要道": "向西南，沿着太行山东麓南北一线高地，可达中原各地；向西北，穿过居庸孔道，可上蒙古高原；向东北，出古北口可去燕山腹地；向东，紧傍燕山南麓，经喜峰口或山海关，便抵辽西、辽东各地及以远",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.38,
        39.95
      ]
    ]
  },
  {
    "时期": "金",
    "原文": "金海陵王于贞元元年（1153年）迁都燕京并改号中都之后，中都成为统治着淮河以北广大土地的金王朝的首都。金中都政治地位的抬升和城市功能的扩大，使金代的漕渠与漕运得到进一步发展。\n海陵王天德三年（1151年），或许为供应扩建燕京之需，升潞县为州，取“漕运通济”之义，命名为通州。通州的建置和命名，反映了该邑在漕运事业中所处的重要地位。正隆四年（1159年）二月，为伐宋作准备，“造战船于通州”。十月，海陵王“观造船于通州”。两年后，金大举伐宋，其中由工部尚书苏保衡和益都尹郑家统制的浙东道水军，从海道径趋临安。这也说明从通州至渤海的水路，是畅通无阻的。但是，由通州至中都，还是靠陆路转运。\n大定四年（1164年）八月，“以山东大熟，诏移其粟以实京师。”事隔俩月，金世宗到中都近郊，见运河湮塞，问得是“户部不为经画所致”后，责斥户部侍郎曹望之曰：“有河不加浚，使百姓陆运劳甚，罪在汝等。朕不欲即加罪，宜悉力使漕渠通也”。于是，开凿疏浚中都的漕道提到日程上了。\n大定十年（1170年），议决卢沟以通京师漕运。世宗高兴地说：“如此，则诸物径达京师，利孰大焉。”有司初步估计，需征调千里内民夫从役。但因山东被灾岁饥，若兴工役，必妨农作，故当年作罢。翌年底，省臣复奏请决卢沟通漕运的工程，“自金口疏导至京城北入濠，而东至通州之北入潞水，计工可80日。”最后核计，只需50天。十二年（1172年），渠成，是为金口河。但因“地势高峻，水性浑浊。峻则奔流漩洄，啮岸善崩；浊则泥淖淤塞，积滓成浅，不能胜舟。”尽管有“请求识河道者，按视其地”之措，但也无能改善者，竟不能行而罢。虽然金口河不能行船，但是灌溉效益仍发挥了十余年的时间。直到大定二十七年（1187年），为防危害中都城，才将金口堵塞。按金口，在石景山北麓，今石景山发电厂院内。由此向东，金口河大致经北辛安南、杨庄北、龚村和田村南、梁各庄和铁家坟、朱各庄北，东入玉渊潭（以上河段讹称金钩河），然后向东南至木樨地、青龙桥入金中都北护城河，再向东大致经内城西南隅的前百户庙、东太平街、溲水河、旧帘子胡同等地，又东经今人民大会堂和历史博物馆南部，东接内城东南隅的船板胡同、泡子河（金北京火车站南），而东至通州入潞河。\n决卢沟、开金口以通中都漕运失败后，金王朝另谋良策，“为闸以节高良河、白莲潭诸水，以通山东、河北之粟”。高良河即今西直门外的高梁河，白莲潭即包括今什刹海、北海、中海等在内的天然湖泊。高梁河水注入白莲潭中。在白莲潭的东岸、南岸、西岸分别修闸引水，南入中都北护城河和金口河，然后东流至通州潞河。从中都东至潞水50里的通粟渠道，谓之闸河。但是，闸河亦或通或塞，因此大量的漕粮主要还靠陆路转运至中都。例如，大定二十一年（1181年），“以八月京城储积不广，诏沿河恩、献等六州粟百万余石运至通州，辇入京师”。\n金代在恩州的临清、历亭，景州的将陵、东光，清州的兴济、会川等濒河城中都建有仓库，从中原征收的粮食，先贮存于这些粮仓中，然后再向通州漕运。其通漕之水，主要有经行滑州、大名、恩州、景州、沧州、会川之境的旧黄河，连通苏门、获嘉、新乡、卫州、浚州、黎阳、卫县、彰德、磁州、名州的漳水和御河，经深州的衡水和所会入的滹沱河，以及霸州的拒马河，雄州的沙河，山东的北清河等。由这些漕渠而来的漕船，皆合于信安海儒，而后溯白河至通州，再由通州入闸河，需10馀日才能到达京师。\n金代漕运分春运和秋运。春运从河冰消融开始，夏天雨季停止；秋运从八月开始，至河水冰封为止。届时实行纲运之法，即将漕船按一定的数量编组，每一组为一纲，一纲漕船统一行动。运前3日先修理船只，然后一天装一纲船，装完之后需封船，3日后启行。根据道里远近和逆水而行或顺水而行，规定到达期限。每纲漕船到达目的后，有专人先检查所封有无变化，以防途中盗窃。若无问题，则限3日内卸完，又3日后付给收据和运费。当然运费是很低的，石米百里只给50文1分2厘7毫。\n",
    "出处": "侯仁之.北京城市历史地理[M].北京：北京燕山出版社,2000.403-405",
    "交通工具": null,
    "交通要道": "金中都的漕渠与漕运",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.92
      ]
    ]
  },
  {
    "时期": "金代",
    "原文": "皇室帝、后、妃、太子等出行，都乘各种形制的专用车，各种车都根据身份、等级有所差别。皇帝所乘坐的有“辂”和“车”两种，共有10类之多，分别用于不同场合。这些专用车上装饰华丽，有坐床、踏床、踏道、垂帘等用具，有的形状如屋，并饰有金银等饰品。皇后、太子等出现也乘专用豪华车，仅规格较低。皇室成员出行都备有仪仗队（称为卤簿），成为专门的仪礼；皇帝出行时还用黄土铺路，以示其尊严。金代在中都供皇帝所用的车，有玉辂、金辂、指南车、崇德车、黄钺车、鸾旗车、豹尾车、革车等。这些车的规制都很大，有的车厢像房屋一样，除御座外，还有床位、走廊等。例如一种叫明运车的皇帝用车，车厢如屋，尖顶，重檐周有勾栏。顶上饰金龙，四角垂铎。车厢分上下两层。还有一种进贤车，上面的车厢设有床。车上设施齐全，有明金凤、朱丝网络、紫罗销金生色宝相帷、明金生色云龙络带。车辕上有凤头、立鸾、香炉等。备有明金衣褥、红罗衬褥、明金缘红竹帘、踏褥等用品。还有一种九龙车，五凤车，可坐可卧。其他诸如皇太子、亲王、文武百官等均有规制不同的专用车，设施也很齐全、豪华。御辇，也是皇室的交通工具，一般车用兽力拖动，而它是由人力拽拉前进的。如皇帝用的火辇、皇后用的平头辇、玉华辇等。城市内交通出行方面，除了中原文化因素外，还体现出诸多草原游牧民族的风格来。当时南京还饲养不少骆驼，苏辙使辽，曾在南京街道上见到双驼拉车。宋人使辽，看见燕京街道来往车辆上都有毡棚，车上又铺设毡垫。\n奚车是契丹民族的一种常用交通出行工具，随着战争和文化交流，这也出现在燕京城内。李商隐《为荥阳公贺破幽州奚冠表》说幽州节度使张仲武奏破奚人部落，俘获物资中有奚车五百乘。《辽史·仪卫志》：“契丹故俗，便于鞍马。随水草迁徙，则有毡车，任载有大车，妇人乘马，亦有小车，贵富者加之华饰。”苏颂使辽，在燕山地区看到一户人家，只有一座毡帐，却有几辆奚车，合家宿于荒野之中。苏辙使辽，副使到幽州突然患病，契丹人便以这种车供副使乘坐。苏辙遂作诗曰：“邻国知君未可讽，双驼借与两轮红。”第二节 饮食与服饰",
    "出处": "张艳丽.北京城市生活史[M].人民出版社,2016.71",
    "交通工具": "奚车",
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.92
      ]
    ]
  },
  {
    "时期": "隋",
    "原文": "大业四年正月，“诏发河北诸郡男女百余万开永济渠，引沁水南达于河，北通涿郡。”北通幽燕的永济渠是隋代大运河的最北段，推动永济渠开凿的除了经济、技术因素外，尚有政治与军事的需要。《隋书·阎毗传》：隋炀帝“将兴辽东之役，自洛口开渠，达于涿郡，以通运漕。毗督其役”。因此，永济渠是联系东都洛阳与东北重镇幽州的直接渠道。隋及唐前期用兵辽东和契丹、突厥，以黎阳、洛阳为中转，利用永济渠转输军粮等至幽州。大业七年（611）隋炀帝欲征伐辽东，“二月乙亥，自江都行幸涿郡，御龙舟，渡河入永济渠”，“四月庚午，车驾至涿郡之临朔宫”。随后在七月“发江淮以南民夫及船运黎阳（今河南浚县西南30里）及洛口（今河南巩义市东南）诸仓米至涿郡，舳舻相次千余里”。武后时为讨伐突厥、契丹，也运送江淮粮食到幽州。陈子昂《上军国机要事》称：“即日江南、淮南诸州租船数千艘，已至巩、洛，计有百余万斛，所司便勒往幽州，纳充军粮。”安史之乱时，清河就因堆积了大量江淮军需物资，而被称之为“北库”，清河人李萼请颜真卿凭此抵御叛军：\n今清河，公之西邻。国家平日聚江、淮、河南钱帛于彼以赡北军，谓之“天下北库”。今有布三百余万匹，帛八十余万匹，钱三十余万缗，粮三十余万斛。昔讨默啜，甲兵皆贮清河库，今有五十余万事……公诚资以士卒，抚而有之，以二郡为腹心，则余郡如四支，无不随所使矣。\n永济渠的开凿利用了沁水、清水等多条河流，《资治通鉴》引《大业杂记》：“三年六月，敕开永济渠，引汾（沁）水入河，于汾（沁）水东北开渠，合渠（清）水至于涿郡二千余里，通龙舟。”汾水应为沁水，胡三省注：“按永济渠即今御河，未尝通汾水，杂记误也”。渠水则是清水之误。沁水是黄河北岸的河流，在河南沁阳县东南流。开永济渠时分沁水为两支，在沁水下游洛口以东的武陟县导主流南入黄河，另在上游东岸开渠引沁水东流，先后遏清水、淇水等河北境内诸条南北向河流汇入白沟、清河（即今卫河），沿曹操时代开凿的平虏渠向东北，溯潞河下游（古笥沟，今北运河）而上，至今天津武清境内折入桑干河（今永定河），西北抵涿郡蓟城（今北京）。沁水本入黄河，但河流多沙，水流湍急，永济渠下游沁水入黄河段需要治理才能通漕运。上游新开渠道虽然利用了旧河道，但疏导起来工程浩大，以致“丁男不供，始役妇人”。\n",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.60-61",
    "交通工具": null,
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.38,
        39.95
      ]
    ]
  },
  {
    "时期": "隋",
    "原文": "大业八年隋炀帝出征高丽，也通过这条道路，“三月壬子，行幸涿郡。癸亥，次临渝宫，亲御戎服，祃祭黄帝，斩叛军者以衅鼓”。临渝关道是隋军从涿郡出兵必经之路，乘隋炀帝出征之际，杨玄感叛乱就计划利用这条通道。\n先是玄感阴遣家僮至长安，召李密及弟玄挺赴黎阳。及举兵，密适至。玄感大喜，以为谋主。谓密曰：“子常以济物为己任，今其时矣！计将安出？”密曰：“天子出征，远在辽外，去幽州犹隔千里。南有巨海，北有强胡，中间一道，理极艰危。公拥兵出其不意，长驱入蓟，据临渝之险，扼其咽喉。归路既绝，高丽闻之，必蹑其后。不过旬月，资粮皆尽。其众不降则溃，可不战而擒，此上计也。”",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.53",
    "交通工具": null,
    "交通要道": "幽州通柳城郡及奚、契丹辽东道",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        108.95,
        34.26
      ]
    ]
  },
  {
    "时期": "隋",
    "原文": "公元581年，隋王朝建立，中国重又统一。隋文帝在位期间，于蓟城仍置幽州。大业三年（607年），罢州为郡，改幽州为涿郡。涿郡治所蓟城建有临朔宫。\n隋世，突厥民族称雄漠北，与隋王朝有争有交。大业三年，隋炀帝北巡榆林（隋榆林郡治在今内蒙古自治区托可托西南黄河右岸），并想继出塞外，通过突厥领地，然后东至涿郡。但怕引起与隋相友好的突厥启民部落的惊恐，于是先派遣武威将军长孙晟前往突厥宣喻皇帝的旨意。启民可汗染干听过以后，召集所部奚、习、室韦等数十种落酋长会聚一起，恭候隋皇帝的到来。长孙晟见启民可汗的牙帐杂草丛生，污秽不堪。为了让染干亲自清除干净，并为其他部落作个表率，以明威重，于是心生一计，指着牙帐前的杂草说：“此根大香。”染干立即嗅了嗅，说：“殊不香也。”长孙晟说：“天子行幸所在，诸侯躬亲洒扫，耘除御路，以表至敬之心。今牙中芜秽，谓是留香草耳。”这时，染干恍然大悟，遂拔出佩刀，亲自斩草除秽。他的贵人及诸部也争相效仿，出现了“举国就役而开御道”的动人场面。结果，一条西起榆林，中经启民可汗牙帐，向东直达涿郡蓟城的长三千里、宽百步的隋炀帝“御道”开辟出来了。\n显然，这条横贯北国的隋炀帝御道，远没有秦始皇的驰道规格高、质量优，有些路段只是芟草除秽，或是削高填洼；有些路段可能就旧路为之。但是，这条隋炀帝御道为突厥所修辟，东西穿过突厥领地，因此对于加强民族团结、巩固北部边防来说，是具有重要意义的。这条隋炀帝御道的开辟，说明历史悠久的由蓟城出居庸关而通往西北草原的大道，在隋世又得到进一步的发展和强化。\n",
    "出处": "侯仁之.北京城市历史地理[M].北京：北京燕山出版社,2000.358-359",
    "交通工具": null,
    "交通要道": "从榆林至涿郡横贯北国的隋炀帝“御道”",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.38,
        39.95
      ]
    ]
  },
  {
    "时期": "隋",
    "原文": "隋代的幽州（涿郡）与并州（太原郡），均为防御北边的军事重镇，兴盛的突厥成了隋朝的强敌。突厥在北朝之末击败柔然，取得了在西北大漠的统治地位，转而掠取中原王朝的利益。其时突厥首领沙钵略屡犯隋境：\n沙钵略勇而得众，北夷皆归附之。及高祖受禅，待之甚薄，北夷大怨。会营州刺史高宝宁作乱，沙钵略与之合军，攻陷临渝镇。上敕缘边修保鄣、峻长城以备之，仍命重将出镇幽、并。沙钵略妻，宇文氏之女，曰千金公主，自伤宗祀绝灭，每怀复隋之志，日夜言之于沙钵略。由是悉众为寇，控弦之士四十万。上令柱国冯昱屯乙弗泊，兰州总管叱李长叉守临洮，上柱国李崇屯幽州，达奚长儒据周槃，皆为虏所败。\n这样严峻的形势，迫使隋朝在北部边塞屯集大军以为守备，并州与幽州则是防守的重点，两地之间交通道路的军事价值因此变得更为重要。\n由幽州入并州的道路之一是井陉道。这条道路自汉代以来就常在战争中发挥作用，在隋代也是最直接的进兵要道。隋炀帝即位初，其弟汉王杨谅策划谋反，决定胜败关键的战事就发生在井陉道。杨谅于开皇十七年出为并州总管：\n自山以东，至于沧海，南拒黄河，五十二州尽隶焉。特许以便宜，不拘律令。……谅自以所居天下精兵处，以太子谗废，居常怏怏，阴有异图。遂讽高祖云：“突厥方强，太原即为重镇，宜修武备。”……及蜀王以罪废，谅愈不自安。会高祖崩，徵之不赴，遂发兵反。……于是遣所署天将军余公理出太谷，以趣河阳。大将军綦良出滏口，以趣黎阳。大将军刘建出井陉，以略燕、赵。柱国乔钟葵出雁门。署文安为柱国，纥单贵、王聃、大将军茹茹天保、侯莫陈惠直指京师。\n在杨谅的部署中，试图控制燕赵、洛阳、长安以及太原的门户雁门，从并州攻入幽州、冀州的道路就是井陉道。这条道路在隋炀帝的平乱计划中同样得到重视，《隋书·李子雄传》记载：\n汉王谅之作乱也，炀帝将发幽州兵以讨之。时窦抗为幽州总管，帝恐其有二心，问可任者于杨素。素进子雄，授大将军，拜廉州刺史，驰至幽州，止传舍，召募得千余人。抗恃素贵，不时相见。子雄遣人谕之。后二日，抗从铁骑二千，来诣子雄所。子雄伏甲，请与相见，因擒抗。遂发幽州兵步骑三万，自井陉以讨谅。时谅遣大将军刘建略地燕、赵，正攻井陉，相遇于抱犊山下，力战，破之。\n正由于井陉道为通幽并的关键通道，大业三年隋炀帝北巡之时，又对这一通道进行了修筑。“（五月）戊午，发河北十余郡丁男凿太行山，达于并州，以通驰道。”在唐代，太宗贞观十九年征伐辽东的大军班师，也取道易州、定州，经井陉道入并州返回长安。“十一月，辛未，车驾至幽州，庚辰，过易州境，……丙戌，车驾至定州。壬辰，车驾发定州。十二月戊申，至并州”。次年“二月，乙未，上发并州。三月，己巳，车驾还京师”。五代后唐庄宗天祐十年十二月击败幽州刘仁恭后，也取道此路回军。\n已卯，帝下令班师，自云、代而旋。时镇州王镕、定州王处直遣使请帝由井陉而西，许之。庚辰，帝发幽州，掳仁恭父子以行。甲申，次定州，舍于关城。翌日，次曲阳，与王处直谒北岳祠。是日，次行唐，镇州王镕迎谒于路。……（天祐十一年正月）己亥，帝发镇州，因与王镕畋于行唐之西。壬子，至晋阳。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.47-49",
    "交通工具": null,
    "交通要道": "幽州通并州的井陉道",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        108.95,
        34.26
      ]
    ]
  },
  {
    "时期": "隋",
    "原文": "隋大业四年（608年）开永济渠北通涿郡（治蓟城），下游系利用桑干河分支达于蓟城。永济渠从静海独流口折西经信安镇，于永清县境北合桑干河分支至蓟城南。涿郡是当时准备征伐辽东的大本营，水上运输量很大。唐代永济渠畅通，贞观十八、十九年（644～645年）征辽东，又以幽州蓟城为集结点，由幽州再向东的水运利用了一段永定河（桑干河），不全是永济渠旧道。宋代也利用永济渠，只是渠线逐渐更改。辽金统治北方后，永济渠各段逐渐湮废。\n",
    "出处": "蔡蕃.北京古运河与城市供水研究[M].北京：北京出版社,1987.57",
    "交通工具": null,
    "交通要道": null,
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.38,
        39.95
      ]
    ]
  },
  {
    "时期": "隋唐",
    "原文": "沿太行山东麓的南北通道，一直是幽州沟通华北平原的主干道。隋唐时这条道路用兵非常之多，如征伐辽东，从南方尤其是洛阳运送军需至幽州，都取此道。贞观十九年，唐太宗自洛阳出发伐辽东，就是走太行山东麓大道赴幽州，然后出渝关至辽东。\n十九年二月庚戌，发雒阳宫，辛亥次河阳（今河南孟县）……戊午次汲县，壬戌次安阳，癸亥次于邺。三月壬申次平棘（今赵县），丁丑幸定州，壬辰发定州。四月丁未发幽州。\n安史之乱时，叛军据此路长驱直入洛阳。其行程大致如下：从幽州西南至易州，再至定州，西南行至恒州（镇州，今正定县）或南行至赵州，继续南行至邢州、磁州、相州（今安阳）、卫州，再至河阳，过黄河达东都洛阳。或在相州黎阳渡白马津关至滑州，南至汴州（大梁），再西至郑州、洛阳。",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.58",
    "交通工具": null,
    "交通要道": "沿太行山东麓的南北通道，一直是幽州沟通华北平原的主干道",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.91
      ]
    ]
  },
  {
    "时期": "隋唐",
    "原文": "隋唐之时幽州通往长安的道路，一路是从幽州西南取道太行山东麓，经代州去往长安。这条道路在隋唐时期最常用，也是最为便捷的通道。唐朝代州领雁门、繁畤、崞、五台四县。从幽州经代州去太原然后达长安的道路，其行程大致如下：出居庸关经妫州（今延庆），向西南行经蔚州至灵丘县，沿着滹沱河河谷下行，经过瓶形砦（今平型关）、大堡戍、繁峙县到雁门，再过崞县进入太原，最后至长安。从幽州过居庸关进入蔚州至代州道路，是一条军事与交通的主道。“幽州将刘仁恭将兵戍蔚州，过期未代，士卒思归。会李匡筹立，戍卒奉仁恭为帅，还攻幽州，至居庸关，为府兵所败。仁恭奔河东，李克用厚待之”。唐武宗禁佛，五台山僧侣被遣散，因此，“五台僧多亡奔幽州。……张仲武乃封二刀付居庸关曰：‘有游僧入境则斩之’”。由代州入太原之道经由崞县，隋炀帝大业十一年：\n八月乙丑，巡北塞。戊辰，突厥始毕可汗率骑数十万，谋袭乘舆，义成公主遣使告变。壬申，车驾驰幸雁门。癸酉，突厥围城，官军频战不利。上大惧，欲率精骑溃围而出，民部尚书樊子盖固谏乃止。齐王■以后军保于崞县。\n从幽州居庸关经蔚州取道太原至长安的道路，到唐后期尤其成为常途。《资治通鉴》记载：大历九年，“朱泚入朝，至蔚州有疾”。胡三省注：“此幽州西出山后，取太原路入朝。”元和五年七月，幽州节度使刘济讨伐成德军节度使王承宗：\n刘济之讨王承宗也，以长子绲为副大使，掌幽州留务。济军瀛州，次子总为瀛州刺史，济署行营都知兵马使，使屯饶阳。济有疾，总与判官张玘、孔目官成国宝谋，诈使人从长安来，曰：“朝廷以相公逗留无功，已除副大使为节度使矣。”明日，又使人来告曰：“副大使旌节已至太原。”又使人走而呼曰：“旌节已过代州。”举军惊骇。\n隋唐时期，幽州通长安的道路，亦有出居庸关至妫州，西行经蔚州往雁门关，再达长安。其行程即从蔚州西行，沿着恒山山脉之北的桑干河谷，入朔州，过雁门关达代州，最后至长安。隋大业三年，炀帝北巡即是沿着这条道路出行。“帝过雁门，雁门太守丘和献食甚精。至马邑，马邑太守杨廓独无所献，帝不悦。……戊子，车驾顿榆林郡”。这条道路也是沿隋开皇长城而行。隋开皇长城起自岚州，经过幽州。《元和郡县志》“岚州合和县”条载：“隋长城起县北四十里，东经幽州，延袤千余里，开皇十六年，因古迹修筑。”《隋书·卫玄传》载：隋高祖受禅未久，“拜岚州刺史。会起长城之役，诏（卫）玄监督之”。在唐后期河北藩镇割据的情况下，这也是常用的道路。王建《题江台驿》云：“水北金台路，年年行客稀。近闻天子使，多取雁门归。”\n唐末以后，幽州藩镇与东北的契丹互有攻防，同河北诸藩镇也多处于敌对关系，因此几乎停止了与华北平原的交往。保持较多联系的是河东太原李克用，通西北一途尚且不至断绝。\n",
    "出处": "孙冬虎，许辉.北京交通史[M].北京：人民出版社,2012.47-50",
    "交通工具": null,
    "交通要道": "幽州经居庸关通长安道",
    "lineCoords": [
      [
        116.4,
        39.91
      ],
      [
        116.4,
        39.91
      ]
    ]
  }
]