[
    {
        "时期":"北魏时期",
        "植被总体描述原文":"《水经注》云：如浑水（流经魏都平城，今大同市）又南至灵泉池，“池东西一百步（一步五尺），南北二百步，池渚旧名白杨泉，泉上出白杨树，因以为名”。又云“其水（指如浑水枝津）自北苑南出，历京城内，河干两湄。太和十年（486），累石结岸，夹塘之上，杂树交荫”。又云：武周川水“又东转迳灵岩南，凿石开山，因崖结构，真容巨壮，法世所稀。山堂水殿，烟峙相望。林渊锦镜，缀目日新”。又云：于延水“水侧有桑林，故时人亦谓是水为桑河”。以上所引《水经注》中的“泉上出白杨树”、“杂树交荫”、“林渊锦镜”、“水侧有桑林”等语，都反映了北魏时桑乾河上游流域的林木状况。",
        "出处":"尹钧科、吴文涛.历史上的永定河与北京[M].北京：北京燕山出版社.2005.122",
        "植被分布":"桑乾河上游流域",
        "植被类型":null,
        "植被疏密情况":"杂树交荫"
    },
    {
        "时期":"宋、辽时期",
        "植被总体描述原文":"宋、辽之世，桑乾河上游的森林植被仍然是很好的。《续资治通鉴长编》载：“火山、宁化之间，山林饶富，财用之薮也。自荷叶坪、芦芽、雪山一带直至瓦窑坞，南北百余里，东西五十余里，材木薪炭足以供一路。”按宋火山军治今山西偏关县，宁化军治今山西宁武县，故宋火山、宁化之间正是桑乾河发源地。这里有南北百余里、东西五十余里的辽阔林区。在宋辽绘制的一些地图中，都绘出了今永定河上游流域山区茂密的林木，例如《地理图》、《九域守令图》、《晋献契丹全燕之图》等就是典型例证。在《晋献契丹全燕之图》这幅古地图上，于儒州（今延庆），妫州（旧怀来）、新州（今宣化）、云中府（今大同）等地以北的高山上，清楚地绘出高大茂密的树林，并明确标注着图5-1 《晋献契丹全燕之图》（釆自《契丹国志》）“松林广数千里”的字样（图5-1）。这片广大的松林，就是多见于宋、辽史籍的“平地松林”。如《辽史·圣宗纪》：统和五年（987）七月，“猎于平地松林”；又十五年（997）八月，“猎于平地松林”；又开泰三年（1014）七月，“如平地松林”等。虽然平地松林大都在冀北山地和内蒙古自治区的东南部，地当滦河、潮白河上游流域，去永定河上游流域稍远，但这区辽阔的松林“广数千里”，其西部边缘当延伸入洋河上游流域。此外，《胡峤陷北记》中所谓的“黑榆林”，当在今河北省崇礼县境，亦属洋河上游流域。",
        "出处":"尹钧科、吴文涛.历史上的永定河与北京[M].北京：北京燕山出版社.2005.123-125",
        "植被分布":"桑乾河上游；永定河上游流域",
        "植被类型":null,
        "植被疏密情况":"山区有茂密的林木；高大茂密的树林；拥有完好的森林植被"
    },
    {
        "时期":"明代",
        "植被总体描述原文":"明代，北京平原地区和一些山间盆地、沟谷是军民屯田和主要农耕区，其中有不少的皇庄和官地。种植作物主要有小麦、大麦、黍、稷、谷子、高粱、水稻等。在山区广泛分布着松、柏、槐、杨、楸等林木和栗、核桃、杏、桃、梨等果木，还有各种灌木。尤其是明皇陵及周围地区，林木更为繁茂。",
        "出处":"侯仁之.北京历史地图集．文化生态卷[M].北京：文津出版社.2013.139",
        "植被分布":"北京平原地区和一些山间盆地",
        "植被类型":"松、柏、槐、杨、楸等林木和栗、核桃、杏、桃、梨等果木，还有各种灌木",
        "植被疏密情况":"林木繁茂"
    },
    {
        "时期":"西汉时期",
        "植被总体描述原文":"《史记·货殖列传》云：“夫山西饶材、竹、谷、■旄、玉石。”这里的山西泛指太行山以西广大地区。“材”，无疑是指各种木材；“谷”，《索隐》谓之“木名，皮可为纸”；“■”，谓之“山中苎，可以为布”。今永定河上游流域包括在内的“山西”，既“饶材、竹、”，说明西汉时期这里的森林植被是很茂盛的。",
        "出处":"尹钧科、吴文涛.历史上的永定河与北京[M].北京：北京燕山出版社.2005.120",
        "植被分布":"永定河上游流域",
        "植被类型":null,
        "植被疏密情况":"森林植被茂盛"
    },
    {
        "时期":"金",
        "植被总体描述原文":"金、元时期，永定河中、上游流域仍多森林。元代在矾山县，在蔚州、定安县都设有负责砍伐林木的机构，并委派官员专督伐木。这在《元史》中有明确记载。如果那时候永定河中、上游流域已无茂密的森林，元朝何必要在这些地方设置掌管砍伐林木的机构呢?流传于今的著名的《卢沟运筏图》,反映的就是元代在永定河(时称浑河)上游砍伐的林木顺河水漂运至卢沟桥，然后再运往大都城或其他地方的情景。这有力地说明，金、元时期永定河中、上游流域还是饶有森林资源的。但是，砍伐取材也日益严重，这在下面还要着重论述。",
        "出处":"尹钧科等.历史上的永定河与北京[M].P125",
        "植被分布":"永定河中、上游流域",
        "植被类型":null,
        "植被疏密情况":"多森林；饶有森林资源"
    },
    {
        "时期":"隋、唐时期",
        "植被总体描述原文":"《太平广记》：“唐武士彟，太原文水人。微时，与邑人许文宝以鬻材为事，常聚材木数万茎，一旦化为丛林茂，因致大富。士彟与文宝读书林下，自称为厚材，文宝自称枯木。”按武士彟，《旧唐书》、《新唐书》中都有传，谓其“家富于财，颇好交结”，或“世殖赀，喜交结”，佐证《太平广记》中关于武士彟的故事是真实的。武士彟与同乡好友许文宝以卖木材发家致富，说明隋、唐之世山西文水县一带的林木是很多的。文水县在太原西南、吕梁山东麓，由此可以断定，隋、唐时吕梁山上的森林十分茂盛。《新唐书·裴延龄传》称，唐开元间，长安“近山无巨木，求之岚、胜间”。岚即岚州，治所在今山西岚县北；胜即胜州，治所榆林，在今内蒙古自治区托克托西南、黄河对岸。据此可知，今山西省西北部，在唐代是重要木材产地。《太平寰宇记》所谓岚州土产有“松柏木”，石州（今山西离石）土产有“松木”，亦可佐证隋、唐时吕梁山地的松柏之多。永定河的源地管涔山与吕梁山北端相接，正处唐代岚、胜州之间，上多林木，自在情理之中。",
        "出处":"尹钧科、吴文涛.历史上的永定河与北京[M].北京：北京燕山出版社.2005.122-123",
        "植被分布":"吕梁山地",
        "植被类型":null,
        "植被疏密情况":"森林十分茂盛；多有松柏"
    },
    {
        "时期":"魏、晋、十六国",
        "植被总体描述原文":"《晋书·载记·石勒下》云：太兴二年（319），“大雨霖，中山、常山尤甚，滹沱泛溢，冲陷山谷，巨松僵拔，浮于滹沱，东至渤海，原隰之间皆如山积”。翌年，石勒下令曰：“去年水出巨材，所在山积，将皇天欲孤缮修宫宇也。其拟洛阳之太极起建德殿（按于邺都建宫殿）。”于是，“遣从事中郎任汪帅使工匠五千人采木以供之”。这里所说的五千工匠采木，不是到山上另去砍伐，而是收拾加工被大水冲下来堆积如山的巨松。据石勒说，“中山西北暴水，流漂巨木百余万根，集于堂阳”。按堂阳，县名，西汉始置，沿至唐代，故治在今河北省新河县西、滏阳河畔。可见，当时不独滹沱河沿岸平原上巨木多如山积，也有数以百万计的巨木被滏阳河水冲漂下来。滏阳河出于晋东太行山中，滹沱河出于晋东北恒山之阳、五台之阴，他们冲漂下来的大量巨木无疑都来自太行山中的原始森林。这不禁使人想到，流经恒山之阴的㶟水（今永定河）、源于恒山东麓、五台山东麓的唐河、拒马河里，也必定会有不少的大树被冲漂下来。换句话说，这些河流上游的晋北山地，在魏、晋、十六国时，恐怕也少不了原始森林。",
        "出处":"尹钧科、吴文涛.历史上的永定河与北京[M].北京：北京燕山出版社.2005.121-122",
        "植被分布":null,
        "植被类型":null,
        "植被疏密情况":"有大量的原始森林"
    }
]