[
    {
        "时期":"元",
        "气候总体描述原文":"第三次是在元顺帝至正二十七年（1367年），从三月份开始，“京师有大风，起自西北，飞砂扬砾，昏尘蔽天。逾时，风势八面俱至，终夜不止，如是者连日。……至五月癸未，乃止。”这种类似的情况，还有一次发生于在此之前的后至元四年（1338年）四月，“京师天雨红沙，昼晦”。从这两次的记述情况来看，应该是我们今天所说的“沙尘暴”，只是后至元四年的这一次时间较短，而至正二十七年的这一次时间较长，污染较为严重。",
        "出处":"吴建雍等.北京城市发展史（元代卷）[M].北京：北京燕山出版社,2008.230-231",
        "降水量":"飞砂扬砾，昏尘蔽天",
        "降水季节":"三月份",
        "温度\/冷暖":"冷",
        "极端天气":"从这两次的记述情况来看，应该是我们今天所说的“沙尘暴”，只是后至元四年的这一次时间较短，而至正二十七年的这一次时间较长，污染较为严重。"
    },
    {
        "时期":"元",
        "气候总体描述原文":"王恽在元成宗元贞二年（1296年）的元旦大朝会时，适逢降雪，于是吟诗曰：“万宝陈庭未是奇，千官朝处玉为墀。……小臣归美丰年庆，不数元和贺雨诗。",
        "出处":"吴建雍等.北京城市发展史（元代卷）[M].北京：北京燕山出版社,2008.231",
        "降水量":null,
        "降水季节":"元旦",
        "温度\/冷暖":"冷",
        "极端天气":null
    },
    {
        "时期":"元",
        "气候总体描述原文":"诗人张翥在泰定元年（1324年）的元旦正好在大都，遇上了一场大雪，从大年初一，一直下到初三。于是赋诗遣兴，描写道：“几岁无此雪，南国见应稀。平地深三尺，飞花大一围。……” 通过他的描述，可以看出，这场雪是很大的。诗人张翥的感受，不禁使人联想起唐代诗人李白曾来到这里，写下了“燕山雪花大如席”的诗句。",
        "出处":"吴建雍等.北京城市发展史（元代卷）[M].北京：北京燕山出版社,2008.231",
        "降水量":"燕山雪花大如席",
        "降水季节":"元旦",
        "温度\/冷暖":"冷",
        "极端天气":"通过他的描述，可以看出，这场雪是很大的"
    },
    {
        "时期":"光绪十六年（1890）",
        "气候总体描述原文":"光绪十六年（1890）自五月二十九日以后，“大雨滂沱，连宵达旦，河水骤涨”。据北郊雨量监测记载，共下了16天的大暴雨，最大一天的雨量是330.5毫米，为1841年有雨量记录以来最大值",
        "出处":"吴建雍等.北京城市发展史（近代卷）[M].北京：北京燕山出版社,2008.211",
        "降水量":"最大一天的雨量是330.5毫米",
        "降水季节":"五月二十九日",
        "温度\/冷暖":null,
        "极端天气":null
    },
    {
        "时期":"清",
        "气候总体描述原文":"第一次强降雨发生在五月二十日（公历7月6日）至五月二十二日（公历7月8日）。前引五月己丑（二十一日，公历7月7日）光绪皇帝以渥沛甘霖，命报谢，实际此时已是强降雨过程开始，已有过多之嫌。六月十三日御史周天霖奏报：“自上月二十日（即五月二十日，公历7月6日），大雨淋漓，前三门外水无归宿，人家已有积水，房屋即有倒塌。”有学者认为第一次强降雨过程始于五月二十一日（公历7月7日），实际上这时已是暴雨造成永定河水势盛涨的情况。直隶总督李鸿章奏称：“五月二十一日（公历7月7日）以后，阴雨淋漓，永定河水势渐长，洼区被淹，各河均出险工。”",
        "出处":"于德源.北京灾害史（上·下册）[M].北京：同心出版社,2007.153",
        "降水量":null,
        "降水季节":"五月二十日（公历7月6日）至五月二十二日（公历7月8日）",
        "温度\/冷暖":null,
        "极端天气":null
    },
    {
        "时期":"清",
        "气候总体描述原文":"但是最终造成这次百年大灾的是第二次强降雨。自五月二十九日（公历7月15日）至六月初三日（公历7月19日）的连续5昼夜的暴雨，使得永定河水势狂涨，南、北各工均发生决口，洪水向东冲击丰台、右安门外，向西南冲击良乡地区。六月初六日顺天府府尹潘季驯奏称：“此次连雨五日（指五月二十九日至六月初三日即公历7月15日至19日），目睹房屋倒塌不可胜数……道路积水数尺，消息难通”，“惟通州较近，据报潮白河、通惠河里外相连，居民困苦”，“良乡则称山水陡下，灌入西门，衙署监狱均被冲塌”。直隶总督李鸿章则奏报：“自二十九日（公历7月15日）起至六月初六日（公历7月22日），大雨狂风连宵达旦，山水奔腾而下，势若建瓴，各河盛涨、惊涛骇浪，高过堤巅，永定河两岸并南、北运河……先后漫溢决口。上下数百里间一片汪洋，有平地水深二丈余者，庐舍民田尽成泽国，人口牲畜淹毙颇多，满目秋禾悉遭漂没，实为数十年来所未见。”但是关于第二次强降雨的始降日期，李鸿章也说过，“据永定河道禀称，五月二十八日（公历7月14日），以后连雨如注……河水陡涨至二丈三尺八寸，浩瀚奔腾，异常汹涌”。另外御史周天霖也奏称：北京城内“至二十九日（公历7月15日）以后，大雨如注，历四昼夜尚未稍息，家家存水，墙倒屋塌”。七月初三日密云副都统国俊片称：“古北口防守尉称，本年五月二十八日夜间（公历7月14日），骤雨倾盆，连续五昼夜，山水暴注，河水涨发，直入古北口大关。”由此笔者推测，北京东北、西北山区的第二次强降雨是始于五月二十八日（公历7月14日），城区的第二次强降雨是始于五月二十九日（7月15日）。有学者根据《故宫晴雨录》的记载，判断第二次强降雨是五月二十九日至六月初三亦即公历7月15日至19日，其原因也正是在于《故宫晴雨录》记载的观测点是设在城区的建国门外古观象台。",
        "出处":"于德源.北京灾害史（上·下册）[M].北京：同心出版社,2007.153-154",
        "降水量":null,
        "降水季节":"五月二十九日（公历7月15日）至六月初三日（公历7月19日）",
        "温度\/冷暖":null,
        "极端天气":null
    },
    {
        "时期":"清",
        "气候总体描述原文":"第三次强降雨是六月初八（公历7月24日）至六月十一日（7月27日）。六月初十日（公历7月26日）御史徐树钧奏称：“现在水势极大，无奈船只不通。”同日，光绪皇帝在上谕中也说：“近日阴雨连旬，京畿一带河流盛涨。”十一日（公历7月27日）仍“以大雨不止……祈祷”。可见第三次强降雨过程对于灾害的扩大化起到了重要作用。",
        "出处":"于德源.北京灾害史（上·下册）[M].北京：同心出版社,2007.154",
        "降水量":"六月初八（公历7月24日）至六月十一日（7月27日）",
        "降水季节":null,
        "温度\/冷暖":null,
        "极端天气":null
    },
    {
        "时期":"金",
        "气候总体描述原文":"金世宗大定十年（1170年）九月初六日，金中都（今北京）降雪纷纷。南宋诗人范成大作为使者出使金国，于九月初九日正好抵达中都城，宿于城外宾馆。他写的《燕宾馆》诗云：“九月朝天种落欢，也将佳节劝杯盘。苦寒不似东篱下，雪满西山把菊看。”自注说：“（燕宾馆）燕山城（即金中都，今北京，北宋曾置燕山府）外馆也。至是适以重阳，虏（指金人）重此节，以其日祭天，伴使把菊酌酒相劝。西望诸山皆缟，云（初）六日大雪。”金世宗大定十年九月初六是公元1170年10月17日。这个月份北京地区降雪，在今天看来实在是罕见现象",
        "出处":"吴建雍等.北京城市发展史（先秦—辽金卷）[M].北京：北京燕山出版社,2008.207",
        "降水量":"苦寒不似东篱下，雪满西山把菊看",
        "降水季节":"九月初六日",
        "温度\/冷暖":"冷",
        "极端天气":"金世宗大定十年九月初六是公元1170年10月17日。这个月份北京地区降雪，在今天看来实在是罕见现象"
    }
]